{"index": 0, "ucName": "AutenticazioneAmministratore", "steps": "1. L'amministratore accede al sistema. 2. Il sistema visualizza il form di login per l'immissione dei dati (nome utente e password). 3. L' amministratore inserisce i dati e sottomette la richiesta di autenticazione. 4. Il sistema riceve il form, verifica i dati e consente l'accesso all'amministratore al sistema con i permessi di accesso specificati.", "dataset": "eANCI"}
{"index": 1, "ucName": "LogoutImpiegato", "steps": "1. L'impiegato vuole terminare la sessione di lavoro e clicca sul bottone Logout. 2. Il sistema disconnette l'impiegato dal sistema e ritorna alla schermata principale.", "dataset": "eANCI"}
{"index": 2, "ucName": "ComeDiventareVolontari", "steps": "1. Il Cittadino accede a questa schermata descrittiva 2. Il sistema risponde all'esigenza permettendogli di conoscere come fare per diventare un volontario della Protezione Civile, e dei requisiti che il Cittadino dovrà necessariamente possedere. 3. Il Cittadino prende atto di ciò che è scritto e desidera perciò accedere alla modulistica associata, e pertanto, verrà chiamato il caso d'uso DownloadModulo.", "dataset": "eANCI"}
{"index": 3, "ucName": "Comitato", "steps": "1. Il Cittadino accede a questo servizio per poter prendere atto della composizione gerarchica della Protezione Civile. 2. Il sistema risponde alla curiosità del Cittadino con una schermata dove è presente un organigramma dei componenti della Protezione Civile comunale in accordo con le altre istituzioni governative del territorio in base alla legge della Giunta Comunale da tutti approvata.", "dataset": "eANCI"}
{"index": 4, "ucName": "DownloadIscrizione", "steps": "1. Il Cittadino accede a questa schermata perché vuole iscriversi al Servizio Civile. 2. Il sistema risponde con una pagina dove il Cittadino che ne ha fatto richiesta, può effettuare il download del modulo da compilare e presentare alla sede della Protezione Civile.", "dataset": "eANCI"}
{"index": 5, "ucName": "DownloadModulo", "steps": "1. Il Cittadino accede al download della modulistica in quanto vuole entrare a far parte del Volontariato 3. 2. Il sistema risponde a tale esigenza con la possibilità di visionare il modulo Il Cittadino prende atto del modulo, e decide di avviare il download del file. 4. Il sistema risponde all'esigenza del Cittadino con il salvataggio del modulo per partecipare all'azione del volontariato.", "dataset": "eANCI"}
{"index": 6, "ucName": "GestioneModifiche", "steps": "1. L'impiegato dopo essersi autenticato nel sistema accede alla funzionalità Protezione Civile per modificare i relativi form. 2. Il sistema risponde a tale esigenza con la possibilità di visualizzare una schermata con i casi d'uso AggiornaCondizioniAtmosferiche, AggiornaAnalisiAmbientali, AggiornaBandieConcorsi. 3. L' impiegato seleziona la funzionalità da modificare. 4. Il sistema risponde all'esigenza dell'impiegato con il form di modifica richiesto.", "dataset": "eANCI"}
{"index": 7, "ucName": "Incendi", "steps": "1. Il Cittadino può accedere a questa sezione se ha scelto di visionare il caso d'uso Rischi, e decida di saperne di più circa le possibili cause che scatenano gli incendi. 2. Il sistema risponde all'esigenza del Cittadino con una descrizione dettagliata su come prevenire gli incendi, e chi si occupa di essi.", "dataset": "eANCI"}
{"index": 8, "ucName": "MonitoraggioIdro-pluviometrico", "steps": "1. Il Cittadino accede a questa schermata in quanto vuole soddisfare la sua curiosità nel conoscere la situazione monitorata dalla Protezione Civile delle acque comunali 2. Il sistema risponde con una schermata dove permette di visualizzare informazioni circa le modalità del monitoraggio delle acque comunali, la situazione batteriologica e l'aggiornamento delle ultime analisi effettuate sui campioni prelevati.", "dataset": "eANCI"}
{"index": 9, "ucName": "MonitoraggioVulcanico", "steps": "1. Il Cittadino accede a questa schermata in quanto ne vuole sapere di più circa il funzionamento effettivo di come la Protezione Civile svolge il monitoraggio dei vulcani presenti sul territorio comunale e nazionale, con una descrizione dettagliata delle tecnologie informatiche adottate. 2. Il sistema risponde alla richiesta con la visualizzazione di una scheda informativa nella quale viene descritto tutto ciò che la Protezione Civile fa per avere sotto controllo l'attività vulcanica", "dataset": "eANCI"}
{"index": 10, "ucName": "NumeriUtili", "steps": "1. Il Cittadino accede a questa pagina per usufruire dei recapiti telefonici da contattare in caso di pericolo di qualsiasi genere. 2. Il sistema risponde permettendo la visualizzazione di una scheda descrittiva con i numeri di telefonici degli enti che si occupano dell'incolumità del Cittadino stesso. 3. Il Cittadino accedendo a questa schermata può, inoltre, visualizzare consigli, e procedure standard, suddivisi per categorie, circa la corretta comunicazione tra lui e l'interlocutore addetto al Call Center di un determinato organo comunale. 4. Il sistema risponde con una schermata di supporto all'emergenza corrispondente al servizio che il Cittadino decide di contattare.", "dataset": "eANCI"}
{"index": 11, "ucName": "ProtezioneCivile", "steps": "1. Il cittadino accede alla scheda descrittiva circa le informazioni di carattere generale riguardo l'organo comunale in questione. 2. Il sistema risponde alla funzionalità informativa, permettendo la visualizzazione di una descrizione circa i ruoli attivi svolti dalla Protezione Civile.", "dataset": "eANCI"}
{"index": 12, "ucName": "ModificaCittadino", "steps": "1. L'impiegato preme il pulsante di modifica cittadino. 2. Il sistema mostra un form per la modifica del cittadino. 3. L'impiegato inserisce i dati. 4. Il sistema salva le modifiche apportate.", "dataset": "eANCI"}
{"index": 13, "ucName": "Rifiuti", "steps": "1. Il Cittadino accede alla scheda informativa perché vuole conoscere l'effettiva situazione dei rifiuti del suo comune, e se ovviamente, l'ambiente è tutelato dalla Protezione Civile con l'aiuto degli enti comunali. 2. Il sistema risponde a tale esigenza con una schermata ampia e descrittiva dove vengono puntualizzati gli obiettivi della Giunta Comunale e note informative sui pericoli di incendi dei rifiuti, e di che tipo è la raccolta dei rifiuti nel proprio comune. Inoltre, è possibile visionare il caso d'uso VisualizzaRisultatiTossicologiciAmbiental i.", "dataset": "eANCI"}
{"index": 14, "ucName": "Rischi", "steps": "1. Il Cittadino accede alla schermata circa i significati dei rischi di cui si occupa la Protezione Civile, con immagini specifiche per ogni categoria di pericolo, e video di come opera durante le operazioni di soccorso. 2. Il sistema risponde alla richiesta del Cittadino, con una schermata dove sono presenti cause, significati, circa le frane, alluvioni, e fenomeni di erosione costiera, e video di interventi. 3. Il Cittadino, dopo aver visionato la scheda descrittiva può voler conoscere le cause di altri pericoli di cui l'organo si occupa e pertanto decide di visionarle attivando, i casi d'uso Incendi, Vulcanico, Sismico, SanitarioAntropico,MonitoraggioIdro- pluviometrico. 4. Il sistema mette a disposizione anche delle ulteriori schede informative su altri pericoli di cui si occupa la Protezione Civile.", "dataset": "eANCI"}
{"index": 15, "ucName": "SanitarioAntropico", "steps": "1. Il Cittadino accede alla schermata desiderata dall'elenco dei rischi ambientali che è accanto ad ogni descrizione di questi ultimi. 2. Il sistema risponde alla richiesta del Cittadino fornendogli una dettagliata spiegazioni di cosa significhi questo caso d'uso in termini pratici, e distribuendogli consigli e procedure standard in caso di pericoli.", "dataset": "eANCI"}
{"index": 16, "ucName": "ServizioCivile", "steps": "1. Il Cittadino accede a questa sezione per avere informazioni circa la propria utilità a favore degli altri. 2. Il sistema risponde con una visualizzazione di una schermata dove chiarisce gli obiettivi del servizio civile, informazioni di carattere generale e la possibilità di chiamare il caso d'uso DownloadIscrizione.", "dataset": "eANCI"}
{"index": 17, "ucName": "Sismico", "steps": "1. Il Cittadino accede alla schermata descrittiva di come avviene il monitoraggio sismico del territorio e la possibilità di acquisire informazioni circa le cause di un terremoto, e le tecnologie di misurazione e prevenzione utilizzate dagli specialisti del nucleo operativo. 2. Il sistema risponde fornendo al Cittadino la possibilità di visionare in modo sempre descrittivo, le caratteristiche degli strumenti, il lavoro svolto dagli specialisti, e gli enti nazionali con cui essi collaborano.", "dataset": "eANCI"}
{"index": 18, "ucName": "VisualizzaRisultatiTossicologiciAmbientali", "steps": "1. Il Cittadino accede a tale scheda per potersi rendere conto personalmente della situazione ambientale del comune in cui risiede, se è tenuta sotto controllo, e quali sono i valori a rischio e del perché di questa situazione. 2. Il sistema risponde con una schermata descrittiva circa i valori tossicologici pervenuti dalle analisi chimiche e tossicologiche effettuate dalla Protezione Civile sull'ambiente e sul terreno comunale.", "dataset": "eANCI"}
{"index": 19, "ucName": "Volontariato", "steps": "1. Il Cittadino accede alla schermata introduttiva. 2. Il sistema risponde visualizzando la scheda descrittiva circa le informazioni di carattere generale su questo aspetto della Protezione Civile, e la possibilità di conoscere i prerequisiti per partecipare. 3. Il Cittadino prende coscienza di ciò che è scritto, e pertanto seleziona il link dove viene chiamato il caso d'uso ComeDiventareVolontari. 4. Il sistema risponde permettendogli la visualizzazione di questa descrizione.", "dataset": "eANCI"}
{"index": 20, "ucName": "Vulcanico", "steps": "1. Il Cittadino accede a questa scheda, dal caso d'uso Rischi se intende conoscerne di più, circa la situazione vulcanica del proprio comune di appartenenza, e la possibilità di visualizzare le modalità di monitoraggio della Protezione Civile. 2. Il sistema risponde con la corretta visualizzazione di una schermata descrittiva circa i diversi tipi di eruzione di un vulcano, mettendo a disposizione, la possibilità di visualizzare l'attuale situazione vulcanica del comune. 3. Il Cittadino vuole conoscere le modalità di monitoraggio dei vulcani presenti, e pertanto, richiamerà il caso d'uso MonitoraggioVulcanico 4. Il sistema mette a disposizione del Cittadino un link al caso d'uso MonitoraggioVulcanico, per poter conoscere la reale situazione.", "dataset": "eANCI"}
{"index": 21, "ucName": "CalcolaImporto", "steps": "1. Il Cittadino preme il pulsante relativo alla funzione del calcolo delle imposte. 2. Il Sistema presenta la lista delle tasse e delle imposte per cui è possibile calcolare l'importo. 3. Il Cittadino seleziona l'imposta di interesse. 4. Il Sistema mostra un form da compilare per il calcolo. 5. Il Cittadino inserisce i dati necessari. 6. Il Sistema verifica la correttezza dei dati,computa l'importo e lo mostra al Cittadino.", "dataset": "eANCI"}
{"index": 22, "ucName": "CalcolaImportoNonRiuscito", "steps": "1. Il Cittadino preme il pulsante relativo alla funzione del calcolo delle imposte. 2. Il Sistema presenta la lista delle tasse e delle imposte per cui è possibile calcolare l'importo. 3. Il Cittadino seleziona l'imposta di interesse. 4. Il Sistema mostra un form da compilare per il calcolo. 5. Il Cittadino inserisce i dati necessari. 6. Il Sistema verifica la correttezza dei dati ma non riesce ad effettuare il calcolo, notificando all'utente il motivo del fallimento.", "dataset": "eANCI"}
{"index": 23, "ucName": "ModificaEMailAmministratore", "steps": "1. L'amministratore accede al form di modifica e-mail. 2. Il sistema mostra il form l'inserimento della nuova e-mail. 3. L'amministratore inserisce la nuova email e preme il tasto di conferma. 4. Il sistema aggiorna la nuova e-mail.", "dataset": "eANCI"}
{"index": 24, "ucName": "ContestaMulta", "steps": "1. Il Cittadino clicca sul pulsante per accedere alla funzionalità di gestione online delle multe. 2. Il Sistema redirige il cittadino verso la sezione desiderata. 3. Il Cittadino clicca sul pulsante per il pagamento online delle multe. 4. Il Sistema effettua una ricerca delle multe a carico del Cittadino presenti nel database per le quali non è ancora pervenuto il pagamento. 5. Il Cittadino seleziona la multa per la quale desidera effettuare una contestazione. 6. Il Sistema mostra tutte le informazioni disponibili relative alla multa, oltre al form da compilare per la contestazione. 7. Il Cittadino inserisce le informazioni necessarie. 8. Il Sistema verifica la correttezza delle informazioni, inoltra la richiesta di contestazione a chi di dovere e notifica il tutto al Cittadino.", "dataset": "eANCI"}
{"index": 25, "ucName": "ICI", "steps": "1. II Cittadino clicca sul pulsante per accedere all'area Pagamento Online delle tasse. 2. Il Sistema visualizza la lista delle tasse che possono essere pagate online. 3. Il Cittadino seleziona la sezione dedicata all'Imposta Comunale sugli Immobili e al relativo pagamento. 4. Il Sistema redirige il Cittadino verso la sezione necessaria, mostrando il form della relativa tassa e il relativo importo da pagare. 5. Il Cittadino conferma la correttezza delle informazioni e avvia la transazione, selezionando il metodo di pagamento preferito. 6. Il Sistema effettua la transazione e mostra un messaggio di avvenuto pagamento.", "dataset": "eANCI"}
{"index": 26, "ucName": "IPPA", "steps": "1. II Cittadino clicca sul pulsante per accedere all'area Pagamento Online delle tasse. 2. Il Sistema visualizza la lista delle tasse che possono essere pagate online. 3. Il Cittadino seleziona la sezione dedicata all' Imposta sulla Pubblicità e le Pubbliche Affissioni e al relativo pagamento ed inserisce il codice della pratica. 4. Il Sistema redirige il Cittadino verso la sezione necessaria, mostrando il form della relativa tassa e il relativo importo da pagare. 5. Il Cittadino conferma la correttezza delle informazioni, seleziona il metodo di pagamento preferito e avvia la transazione. 6. Il Sistema effettua la transazione e mostra un messaggio di avvenuto pagamento.", "dataset": "eANCI"}
{"index": 27, "ucName": "IRPEF", "steps": "1. II Cittadino clicca sul pulsante per accedere all'area Pagamento Online delle tasse. 2. Il Sistema visualizza la lista delle tasse che possono essere pagate online. 3. Il Cittadino seleziona la sezione dedicata all'Imposta sul Reddito delle Persone Fisiche e al relativo pagamento. 4. Il Sistema redirige il Cittadino verso la sezione necessaria, mostrando il form della relativa tassa e il relativo importo da pagare. 5. Il Cittadino conferma la correttezza delle informazioni, seleziona il metodo di pagamento preferito e avvia la transazione. 6. Il Sistema effettua la transazione e mostra un messaggio di avvenuto pagamento.", "dataset": "eANCI"}
{"index": 28, "ucName": "Modulistica", "steps": "1. II Cittadino clicca sul pulsante per accedere sezione dedicata alla modulistica. 3. 2. Il Sistema redirige il Cittadino verso la sezione richiesta e mostra i vari moduli disponibili per il download. Il Cittadino seleziona il modulo desiderato. 4. Il Sistema avvia il download.", "dataset": "eANCI"}
{"index": 29, "ucName": "PagamentoMulte", "steps": "1. Il Cittadino clicca sul pulsante per accedere alla funzionalità di gestione online delle multe. 2. Il Sistema redirige il cittadino verso la sezione desiderata. 3. Il Cittadino clicca sul pulsante per il pagamento online delle multe. 4. Il Sistema effettua una ricerca delle multe a carico del Cittadino presenti nel database per le quali non è ancora pervenuto il pagamento. 5. Il Cittadino seleziona la multa per la quale desidera effettuare il pagamento. 6. Il Sistema mostra il form della multa e il relativo importo da pagare. 7. Il Cittadino verifica la correttezza delle informazioni e avvia la transazione, selezionando il metodo di pagamento preferito. 8. Il Sistema effettua la transazione e mostra un messaggio di avvenuto pagamento.", "dataset": "eANCI"}
{"index": 30, "ucName": "PagamentoNonRiuscito", "steps": "1. Il Cittadino clicca sul pulsante per accedere all'area Pagamento Online delle tasse o delle multe. 2. Il Sistema visualizza la lista delle tasse/ multe che possono essere pagate online. 3. Il Cittadino seleziona la tassa/multa di interesse 5. 4. Il Sistema redirige il Cittadino verso la sezione necessaria, mostrando il form al cittadino. Il Cittadino avvia la transazione. 6. Il Sistema non consente la transazione poiché si sono verificati problemi con il metodo di pagamento selezionato.", "dataset": "eANCI"}
{"index": 31, "ucName": "RicercaVerbaliMulte", "steps": "1. Il Cittadino clicca sul pulsante per accedere alla funzionalità di gestione online delle multe. 3. 2. Il Sistema redirige il cittadino verso la sezione desiderata. Il Cittadino clicca sul pulsante per la ricerca dei verbali (solo a suo carico). 4. Il Sistema effettua una ricerca delle multe a carico del cittadino (pagate e non) presenti nel database e le mostra in una lista nella quale è possibile navigare per mostrare tutte le informazioni disponibili per una determinata multa.", "dataset": "eANCI"}
{"index": 32, "ucName": "RichiestaIPPA", "steps": "1. II Cittadino clicca sul pulsante per accedere all'area di richiesta dei servizi del comune. 2. Il Sistema redirige il cittadino verso la sezione necessaria. 3. Il Cittadino seleziona la sezione dedicata alla richiesta di Imposta sulla Pubblicità e le Pubbliche Affissioni. 4. Il Sistema mostra il form della relativa richiesta,ricavando automaticamente i dati necessari. 5. Il Cittadino inserisce ulteriori dati necessari alla corretta compilazione del form,conferma la correttezza delle informazioni e invia la richiesta. 6. Il Sistema notifica all'impiegato la richiesta.", "dataset": "eANCI"}
{"index": 33, "ucName": "RichiestaIPPAAccettata", "steps": "1. 3. L'Impiegato visualizza la notifica ricevuta. 2. Il Sistema mostra all'Impiegato la richiesta effettuata dal cittadino. L'Impiegato certifica la validità della richiesta controllando l'esattezza dei dati e abilita la procedura burocratica per la richiesta del servizio. 4. Il Sistema invia una e-mail di conferma al cittadino che ha richiesto il servizio.", "dataset": "eANCI"}
{"index": 34, "ucName": "ModificaEMailCittadino", "steps": "1. Il cittadino accede al form di modifica e- mail. 3. 2. Il sistema mostra il form l'inserimento della nuova e-mail. Il cittadino inserisce la nuova email e preme il tasto di conferma. 4. Il sistema aggiorna la nuova e-mail.", "dataset": "eANCI"}
{"index": 35, "ucName": "RichiestaIPPARifiutata", "steps": "1. 3. L'Impiegato visualizza la notifica ricevuta. 2. Il Sistema mostra all'Impiegato la richiesta effettuata dal cittadino. L'Impiegato rivela un errore nella richiesta e rifiuta la procedura la richiesta. 4. Il Sistema invia una notifica al cittadino che ha richiesto il servizio.", "dataset": "eANCI"}
{"index": 36, "ucName": "RichiestaTOSAP", "steps": "1. II Cittadino clicca sul pulsante per accedere all'area di richiesta dei servizi del comune. 2. Il Sistema redirige il cittadino verso la sezione necessaria. 3. Il Cittadino seleziona la sezione dedicata alla richiesta di Tassa per l'Occupazione del Suolo e delle Aree Pubbliche. 4. Il Sistema mostra il form della relativa richiesta,ricavando automaticamente i dati necessari. 5. Il Cittadino inserisce ulteriori dati necessari alla corretta compilazione del form,conferma la correttezza delle informazioni e invia la richiesta. 6. Il Sistema notifica all'impiegato la richiesta.", "dataset": "eANCI"}
{"index": 37, "ucName": "RichiestaTOSAPAccettata", "steps": "1. 3. L'Impiegato visualizza la notifica ricevuta. 2. Il Sistema mostra all'Impiegato la richiesta effettuata dal cittadino. L'Impiegato certifica la validità della richiesta controllando l'esattezza dei dati e abilita la procedura burocratica per la richiesta del servizio. 4. Il Sistema invia una e-mail di conferma al cittadino che ha richiesto il servizio.", "dataset": "eANCI"}
{"index": 38, "ucName": "RichiestaTOSAPRifiutata", "steps": "1. 3. L'Impiegato visualizza la notifica ricevuta. 2. Il Sistema mostra all'Impiegato la richiesta effettuata dal cittadino. L'Impiegato rivela un errore nella richiesta e rifiuta la procedura la richiesta. 4. Il Sistema invia una notifica al cittadino che ha richiesto il servizio.", "dataset": "eANCI"}
{"index": 39, "ucName": "TIA", "steps": "1. II Cittadino clicca sul pulsante per accedere all'area Pagamento Online delle tasse. 2. Il Sistema visualizza la lista delle tasse che possono essere pagate online. 3. Il Cittadino seleziona la sezione dedicata alla Tassa per l'Igiene Ambientale e al relativo pagamento. 4. Il Sistema redirige il Cittadino verso la sezione necessaria, mostrando il form della relativa tassa e il relativo importo da pagare. 5. Il Cittadino conferma la correttezza delle informazioni,seleziona il metodo di pagamento preferito e avvia la transazione. 6. Il Sistema effettua la transazione e mostra un messaggio di avvenuto pagamento.", "dataset": "eANCI"}
{"index": 40, "ucName": "TOSAP", "steps": "1. II Cittadino clicca sul pulsante per accedere all'area Pagamento Online delle tasse. 2. Il Sistema visualizza la lista delle tasse che possono essere pagate online. 3. Il Cittadino seleziona la sezione dedicata alla Tassa per l'Occupazione del Suolo e delle Aree Pubbliche e al relativo pagamento ed inserisce il codice della pratica. 4. Il Sistema redirige il Cittadino verso la sezione necessaria, mostrando il form della relativa tassa e il relativo importo da pagare. 5. Il Cittadino conferma la correttezza delle informazioni, seleziona il metodo di pagamento preferito e avvia la transazione. 6. Il Sistema effettua la transazione e mostra un messaggio di avvenuto pagamento.", "dataset": "eANCI"}
{"index": 41, "ucName": "Modulistica", "steps": "1. II Cittadino clicca sul pulsante per accedere sezione dedicata alla modulistica. 3. 2. Il Sistema redirige il Cittadino verso la sezione richiesta e mostra i vari moduli disponibili per il download. Il Cittadino seleziona il modulo desiderato. 4. Il Sistema avvia il download.", "dataset": "eANCI"}
{"index": 42, "ucName": "ConsultazioneHelpOn-Line", "steps": "1. Il Cittadino entra nella sezione dedicata all'help on-line. 2. Il sistema presenta una schermata contenente la lista delle funzionalità. 3. Il cittadino accede alle informazioni di help cliccando sul collegamento relativo alla funzionalità di cui vuole ricevere. 4. Il sistema presenta le informazioni di aiuto, spiegando le modalità e le azioni da eseguire per la specifica funzionalità.", "dataset": "eANCI"}
{"index": 43, "ucName": "DatiErrati", "steps": "1. Il sistema mostra un messaggio al video del terminale indicante che la richiesta immessa era incorretta. 2. Cittadino legge il messaggio di notifica. 3. Il sistema ripresenta il form di input.", "dataset": "eANCI"}
{"index": 44, "ucName": "ServizioNonDisponibile", "steps": "1. Il sistema mostra un messaggio al video del terminale indicante che non è possibile effettuare la richiesta. 2. Cittadino legge il messaggio di notifica. 3. Il sistema ripresenta il form di input.", "dataset": "eANCI"}
{"index": 45, "ucName": "ModificaEMailImpiegato", "steps": "1. L' impiegato accede al form di modifica e- mail. 2. Il sistema mostra il form l'inserimento della nuova e-mail. 3. Il impiegato inserisce la nuova email e preme il tasto di conferma. 4. Il sistema aggiorna la nuova e-mail.", "dataset": "eANCI"}
{"index": 46, "ucName": "ModificaImpiegato", "steps": "1. L'amministratore preme il pulsante di modifica impiegato. 2. Il sistema mostra un form per la modifica del impiegato. 3. L'amministratore inserisce i dati. 4. Il sistema salva le modifiche apportate.", "dataset": "eANCI"}
{"index": 47, "ucName": "ModificaPasswordAmministratore", "steps": "1. L'amministratore vuole modificare la password e preme il bottone modifica password. 2. Il sistema visualizza il form per l'inserimento della vecchia password. 3. L'amministratore inserisce la vecchia password, la nuova password e preme il tasto di conferma. 4. Il sistema notifica che la password è stata modificata.", "dataset": "eANCI"}
{"index": 48, "ucName": "ModificaPasswordCittadino", "steps": "1. Il cittadino vuole modificare la password e preme il bottone modifica password. 2. Il sistema visualizza il form per l'inserimento della vecchia password e della nuova. 3. Il cittadino inserisce la vecchia password, la nuova password e preme il tasto di conferma. 4. Il sistema notifica che la password è stata modificata.", "dataset": "eANCI"}
{"index": 49, "ucName": "ModificaPasswordImpiegato", "steps": "1. L'impiegato vuole modificare la password e preme il bottone modifica password. 2. Il sistema visualizza il form per l'inserimento della vecchia password e della nuova. 3. L'impiegato inserisce la vecchia password, la nuova password e preme il tasto di conferma. 4. Il sistema notifica che la password è stata modificata.", "dataset": "eANCI"}
{"index": 50, "ucName": "RecuperaPasswordCittadino", "steps": "1. Il cittadino ha dimenticato la password e preme sul bottone Recupera Password. 2. Il sistema mostra la schermata per il recupero della password che richiede l'inserimento del nome utente e del codice della carta d'identità. 3. Il cittadino inserisce i suoi dati e preme il tasto di conferma. 4. Il sistema verifica la correttezza dei dati e invia la password all'indirizzo email del cittadino.", "dataset": "eANCI"}
{"index": 51, "ucName": "AutenticazioneCittadino", "steps": "1. Il cittadino accede alla sessione di autenticazione. 2. Il sistema mostra il form di login per l'immissione dei dati (nome utente e password). 3. Il cittadino inserisce i dati e sottomette la richiesta di autenticazione. 4. Il sistema verifica l'esattezza dei dati e consente l'accesso al cittadino.", "dataset": "eANCI"}
{"index": 52, "ucName": "RecuperoPasswordAmministratore", "steps": "1. L'amministratore ha dimenticato la password e preme il bottone recupero password. 2. Il sistema mostra la form per l'inserimento della matricola. 3. L'amministratore inserisce la propria matricola e preme il tasto di conferma. 4. Il sistema verifica i dati e invia la password all'indirizzo email dell'amministratore.", "dataset": "eANCI"}
{"index": 53, "ucName": "RecuperoPasswordImpiegato", "steps": "1. L'impiegato ha dimenticato la password e preme il bottone recupero password. 2. Il sistema mostra la form per l'inserimento della matricola. 3. L'impiegato inserisce la propria matricola e preme il tasto di conferma. 4. Il sistema verifica i dati e invia la password all'indirizzo email dell'impiegato.", "dataset": "eANCI"}
{"index": 54, "ucName": "RegistrazioneCittadino", "steps": "1. Il cittadino accede al form di registrazione. 2. Il sistema mostra il form per la registrazione. 3. Il cittadino inserisce i suoi dati e preme il tasto di conferma. 4. Il sistema verifica la correttezza dei dati, li salva e invia una e-mail di registrazione avvenuta al cittadino.", "dataset": "eANCI"}
{"index": 55, "ucName": "RegistrazioneCittadino", "steps": "1. Il cittadino accede al form di registrazione. 2. Il sistema mostra il form per la registrazione. 3. Il cittadino inserisce i suoi dati e preme il tasto di conferma. 4. Il sistema verifica la correttezza dei dati, li salva e invia una e-mail di registrazione avvenuta al cittadino.", "dataset": "eANCI"}
{"index": 56, "ucName": "RicercaImpiegato", "steps": "1. L'amministratore preme sul bottone Ricerca impiegato. 3. 2. Il sistema mostra il form per la ricerca di un impiegato. L'amministratore effettua una ricerca tramite i dati del impiegato. 4. Il sistema restituisce i dati del impiegato ricercato.", "dataset": "eANCI"}
{"index": 57, "ucName": "CambioDiResidenza", "steps": "1. 3. 5. 6. 7. Il Cittadino preme sul bottone Cambio di residenza. 2. Il sistema mostra al cittadino il form da compilare. Il cittadino inserisce i dati della sua nuova abitazione. 4. Il sistema notifica al cittadino il corretto invio della richiesta e viene memorizzata nel sistema. L'impiegato accede al sistema e visualizza la richiesta ricevuta. L'impiegato verifica i dati, compila il documento con il resto dei dati da inserire e conferma l'operazione. Il sistema salva il modulo e aggiorna i dati.", "dataset": "eANCI"}
{"index": 58, "ucName": "CambioDiResidenzaAltroComune", "steps": "1. 3. 5. 6. 7. 8. 9. Il Cittadino preme sul bottone Cambio di residenza. 2. Il sistema mostra al cittadino il form da compilare. Il cittadino inserisce i dati della sua nuova abitazione. 4. Il sistema notifica al cittadino il corretto invio della richiesta e questa viene memorizzata. L'impiegato accede al sistema e visualizza la richiesta ricevuta. L'impiegato verifica i dati, compila il documento con il resto dei dati da inserire e conferma l'operazione. Il sistema salva il modulo e aggiorna i dati. L'impiegato invia un documento con la richiesta effettuata dal cittadino all'impiegato dell'altro comune. L'impiegato dell'altro comune verifica il documento e invia una notifica positiva all'altro impiegato e una notifica al cittadino.", "dataset": "eANCI"}
{"index": 59, "ucName": "CambioStatoDiFamiglia", "steps": "1. 3. Il Cittadino preme sul bottone Cambio stato di famiglia. 2. Il sistema mostra al cittadino il form da compilare. Il cittadino inserisce i dati del nuovo nucleo familiare e invia la richiesta. 4. Il sistema invia la richiesta all'impiegato competente.", "dataset": "eANCI"}
{"index": 60, "ucName": "CancellaPratica", "steps": "1. 3. Il cittadino preme il pulsante di cancellazione pratica (Carta d'identità, Cambio Residenza) se la pratica non è stata inizializzata . 2. Il sistema chiede al cittadino una conferma. Il cittadino conferma l'operazione. 4. Il sistema cancella la pratica.", "dataset": "eANCI"}
{"index": 61, "ucName": "ModificaPratica", "steps": "1. Il cittadino preme il pulsante di modifica pratica (Carta d'identità, Cambio Residenza) se la pratica non è stata inizializzata. 3. 2. Il sistema mostra un form per la modifica della pratica. Il cittadino inserisce i dati. 4. Il sistema salva le modifiche apportate.", "dataset": "eANCI"}
{"index": 62, "ucName": "AutenticazioneImpiegato", "steps": "1. L'impiegato accede alla sessione di autenticazione. 2. Il sistema mostra la form di login per l'immissione dei dati (nome utente e password). 3. L'impiegato inserisci inserisce i dati e sottomette la richiesta di autenticazione. 4. Il sistema verifica l'esattezza dei dati e consente l'accesso all'impiegato.", "dataset": "eANCI"}
{"index": 63, "ucName": "RichiestaCartaDiIdentita", "steps": "1. Il Cittadino visualizza lo stato di famiglia e seleziona un componente della famiglia. 2. Il sistema mostra un form per inserimento dei dati personali(Altezza, segni particolari ecc. 3. Il cittadino inserisce i dati, seleziona la modalità di pagamento e preme il tasto conferma. 4. Il sistema mostra la schermata con la documentazione da esibire allo sportello nei giorni e orari di apertura dell'ufficio. 5. Il cittadino conferma l'operazione. 6. Il sistema notifica all'impiegato la richiesta.", "dataset": "eANCI"}
{"index": 64, "ucName": "RichiestaCartaDiIdentitàAccettata", "steps": "1. 3. 5. L'impiegato visualizza la notifica ricevuta. 2. Il sistema mostra all'impiegato la richiesta di creazione della carta d'identità da parte del cittadino. L'impiegato certifica la validità della richiesta controllando l'esattezza dei dati e abilita la procedura per la creazione della carta d'identità. 4. Il sistema invia una e-mail di conferma al cittadino che ha richiesto la creazione della carta d'identità. Il cittadino si reca allo sportello.", "dataset": "eANCI"}
{"index": 65, "ucName": "RichiestaCartaDiIdentitàRifiutata", "steps": "1. 3. L'impiegato visualizza la notifica ricevuta. 2. Il sistema mostra all'impiegato la richiesta di creazione della carta d'identità da parte del cittadino. L'impiegato rileva un errore nei dati e rifiuta la procedura di creazione della carta d'identità. 4. Il sistema invia una notifica via e-mail al cittadino che ha richiesto la creazione della carta d'identità.", "dataset": "eANCI"}
{"index": 66, "ucName": "RichiestaCertificati", "steps": "1. Il cittadino seleziona uno specifico certificato(certificati anagrafici, certificati di stato civile). 2. Il sistema visualizza il form per l'inserimento dei dati della persona interessata. 3. Il cittadino inserisce i dati della persona interessata. 4. Il sistema mostra una schermata con il certificato richiesto. 5. Il cittadino seleziona la modalità di pagamento e di spedizione. 6. Il sistema invia il certificato.", "dataset": "eANCI"}
{"index": 67, "ucName": "RichiestaCertificatiTerzi", "steps": "1. Il cittadino seleziona uno specifico certificato(certificati anagrafici, certificati di stato civile). 2. Il sistema visualizza il form per l'inserimento dei dati della persona interessata. 3. Il cittadino inserisce i dati della persona interessata (vedi nota). 4. Il sistema memorizza in un apposito modulo i dati del cittadino e dell'interessato 5. Il sistema mostra una schermata con il certificato richiesto. 6. Il cittadino seleziona la modalità di pagamento e di spedizione. 7. Il sistema invia il certificato.", "dataset": "eANCI"}
{"index": 68, "ucName": "RichiestaDiMatrimonio", "steps": "1. Il Cittadino preme sul bottone Richiesta di matrimonio. 2. Il sistema mostra al cittadino il form da compilare. 3. Il cittadino inserisce tutti i suoi dati, quelli del partner e preme il tasto di conferma. 4. Il sistema crea automaticamente il modulo da presentare con autocertificazione e stato di famiglia del cittadino richiedente e invia il modulo all'impiegato. 5. L'impiegato riceve la notifica e pubblica la richiesta di matrimonio.", "dataset": "eANCI"}
{"index": 69, "ucName": "RichiestaStatoDiFamiglia", "steps": "1. Il Cittadino preme sul bottone Stato di famiglia. 3. 2. Il sistema mostra al cittadino lo stato di famiglia. Il cittadino sceglie se stampare o inviare alla propria e-mail lo stato di famiglia. 4. Il sistema esegue la scelta effettuata dal cittadino.", "dataset": "eANCI"}
{"index": 70, "ucName": "RinnovoCardaD'identita", "steps": "1. Il Cittadino preme sul bottone Rinnovo carta d'identità. 2. Il sistema invia direttamente una richiesta di rinnovo da parte del cittadino all'impiegato competente. 3. Il cittadino si reca allo sportello per rinnovare la carta d'identità.", "dataset": "eANCI"}
{"index": 71, "ucName": "SmarrimentoCartaD'identita", "steps": "1. Il Cittadino preme sul bottone Smarrimento carta d'identità. 2. Il sistema invia direttamente una notifica di smarrimento della carta all'impiegato competente. 3. Il cittadino si reca all'ufficio dell'impiegato con una copia della denuncia di smarrimento.", "dataset": "eANCI"}
{"index": 72, "ucName": "SmarrimentoTesseraElettorale", "steps": "1. Il Cittadino preme sul bottone Smarrimento tessera elettorale. 2. Il sistema invia direttamente una notifica di smarrimento della carta all'impiegato competente. 3. Il cittadino si reca all'ufficio dell'impiegato con una copia della denuncia di smarrimento.", "dataset": "eANCI"}
{"index": 73, "ucName": "CancellazioneCittadino", "steps": "1. 3. L'impiegato preme il pulsante di cancellazione cittadino. 2. Il sistema chiede all'impiegato una conferma. L'impiegato conferma l'operazione. 4. Il sistema cancella il cittadino.", "dataset": "eANCI"}
{"index": 74, "ucName": "RichiestaTesseraElettorale", "steps": "1. Il Cittadino preme sul bottone Tessera Elettorale. 2. Il sistema mostra il form per la richiesta della tessera. 3. Il cittadino conferma l'operazione 4. Il sistema invia una notifica all'impiegato. 5. Il cittadino riceverà la tessera elettorale che verrà consegnata al proprio domicilio.", "dataset": "eANCI"}
{"index": 75, "ucName": "VisualizzazionePratica", "steps": "1. Il cittadino clicca sul bottone visualizza pratiche(Carta d'Identità, Cambio Residenza). 2. Il sistema visualizza una schermata con le pratiche che riguardano il cittadino.", "dataset": "eANCI"}
{"index": 76, "ucName": "PraticaAccettata", "steps": "1. L'Impiegato accetta la pratica. 2. Il sistema imposta la pratica come accettata. Quindi invia una notifica al Cittadino.", "dataset": "eANCI"}
{"index": 77, "ucName": "PraticaRespinta", "steps": "1. L'Impiegato respinge la pratica. 2. Il sistema imposta la pratica come respinta. Quindi invia una notifica al Cittadino.", "dataset": "eANCI"}
{"index": 78, "ucName": "VisualizzaPraticheAttesaImpiegato", "steps": "1. Impiegato seleziona “Visualizza Richieste in Attesa” 2. Il Sistema mostra la lista delle pratiche in attesa.", "dataset": "eANCI"}
{"index": 79, "ucName": "AccoglienzaNotturna", "steps": "1. L'utente seleziona la funzionalità Assistenza Sociale selezionando “Richiesta Accoglienza Notturna” 2. Il sistema mostra il form per l'inserimento dei dati del richiedente e del destinatario. 3. L'utente inserisce i propri dati e se necessario inserisce i dati di una terza persona specificando il rapporto con tale persona. Inoltre specifica un domicilio o recapito alternativo ed una eventuale data di appuntamento con gli assistenti sociali. Quindi sottomette il form. 4. Il sistema preleva i dati anagrafici del cittadino richiedente e del cittadino destinatario (se diverso dal richiedente), e i dati riguardanti il nucleo familiare del Cittadino destinatario. La richiesta viene inviata all'ufficio dei Servizi Sociali ed all'utente viene notificato l'invio.", "dataset": "eANCI"}
{"index": 80, "ucName": "AssegnoMalattia", "steps": "1. L'utente seleziona “Richiesta assegno malattia”. 2. Il sistema mostra la pagina con le informazioni per la richiesta all'ufficio INPS dell'assegno di malattia, permettendo inoltre di stampare il tutto.", "dataset": "eANCI"}
{"index": 81, "ucName": "AssistenzaAlloggiativi", "steps": "1. L'utente seleziona la funzionalità Assistenza Sociale selezionando “Richiesta assistenza alloggiativi (sfratti)” 2. Il sistema mostra il form per l'inserimento dei dati del richiedente e del destinatario (se diversi). 3. L'utente inserisce i propri dati e quelli del destinatario (se il destinatario è una terza persona)se necessario specificando il rapporto con tale persona, inoltre specifica il nuovo domicilio. L'utente seleziona la documentazione allegata (verbale di sfratto esecutivo, il nuovo contratto di locazione registrato e il modello ISEE). Quindi sottomette il form. 4. Il sistema preleva i dati anagrafici del cittadino destinatario, e i dati riguardanti il nucleo familiare del Cittadino destinatario. La richiesta viene inviata all'ufficio dei Servizi Sociali ed all'utente viene notificato l'invio.", "dataset": "eANCI"}
{"index": 82, "ucName": "AssistenzaDomiciliare", "steps": "1. L'utente seleziona “Richiesta assistenza domiciliare anziani, minori, portatori di handicap”. 2. Il sistema mostra il form per l'inserimento dei dati del richiedente e del destinatario. 3. L'utente inserisce i dati anagrafici del richiedente e se necessario inserisce i dati di una terza persona specificando il rapporto con tale persona. 4. Il sistema preleva i dati del cittadino richiedente , i dati anagrafici del cittadino destinatario (nel caso in cui il richiedente e il destinatario non fossero la stessa persona), e i dati riguardanti il nucleo familiare del Cittadino destinatario. 5. L'utente specifica le condizioni psico- fisiche del destinatario specificando i documenti allegati (certificato invalidità rilasciato dalla commissione ASL e/o scheda sanitaria del medico curante e/o certificato dell'ente erogatore della pensione,modello ISEE) specificando in ultimo una eventuale data di appuntamento con gli assistenti sociali. Quindi sottomette il form. 6. Il sistema preleva i dati riguardanti eventuali servizi socio-assistenziali di cui il destinatario già usufruisce. Quindi inoltra la richiesta all'ufficio dei Servizi Sociali e avvisa il Cittadino della avvenuta richiesta.", "dataset": "eANCI"}
{"index": 83, "ucName": "AssistenzaEconomica", "steps": "1. L'utente seleziona “Richiesta assistenza economica anziani, orfani minori, malati di AIDS, detenuti, adulti in condizioni disagiate”. 2. Il sistema mostra il form per l'inserimento dei dati del richiedente e del destinatario. 3. L'utente inserisce i propri dati e se necessario inserisce i dati di una terza persona specificando il rapporto con tale persona. 4. Il sistema preleva i dati del cittadino richiedente , i dati anagrafici del cittadino destinatario (nel caso in cui il richiedente e il destinatario non fossero la stessa persona), e i dati riguardanti il nucleo familiare del Cittadino destinatario. 5. L'utente specifica le condizioni psico- fisiche del destinatario specificando i documenti allegati (certificato invalidità rilasciato dalla commissione ASL e/o scheda sanitaria del medico curante e/o certificato dell'ente erogatore della pensione,modello ISEE) specificando in ultimo una eventuale data di appuntamento con gli assistenti sociali. Quindi sottomette il form. 6. Il sistema preleva i dati riguardanti eventuali servizi socio-assistenziali di cui il destinatario già usufruisce. Quindi inoltra la richiesta all'ufficio dei Servizi Sociali e avvisa l'utente della avvenuta richiesta.", "dataset": "eANCI"}
{"index": 84, "ucName": "CancellazioneImpiegato", "steps": "1. L'amministratore preme il pulsante di cancellazione impiegato. 2. Il sistema chiede all'amministratore una conferma. 3. L'amministratore conferma l'operazione. 4. Il sistema cancella l' impiegato.", "dataset": "eANCI"}
{"index": 85, "ucName": "AssistenzaRagazzeMadriMinori", "steps": "1. L'utente seleziona la funzionalità Assistenza Sociale selezionando “Richiesta assistenza a ragazze madri e minori in difficoltà” 2. Il sistema mostra il form per l'inserimento dei dati del richiedente e del destinatario. 3. L'utente inserisce i propri dati e quelli del destinatario della richiesta (se stesso, altra persona) se necessario specificando il rapporto con tale persona. Inoltre specifica una eventuale data di appuntamento con gli Assistenti Sociali. Quindi sottomette il form. 4. Il sistema preleva dal sistema i dati anagrafici del cittadino destinatario, e i dati riguardanti il nucleo familiare del Cittadino destinatario. La richiesta viene inviata all'ufficio dei Servizi Sociali ed al l'utente viene notificato l'invio.", "dataset": "eANCI"}
{"index": 86, "ucName": "AssistenzaResidenziale", "steps": "1. L'utente seleziona “Richiesta assistenza residenziale e semi-residenziale”. 2. Il sistema mostra il form per l'inserimento dei dati del richiedente e del destinatario. 3. L'utente inserisce i propri dati e se necessario inserisce i dati di una terza persona specificando il rapporto con tale persona. 4. Il sistema preleva i dati anagrafici del richiedente, del cittadino destinatario (se il destinatario è una terza persona) e i dati riguardanti il nucleo familiare del Cittadino destinatario. 5. L'utente specifica le condizioni psico- fisiche del destinatario, le motivazioni della richiesta, il tipo di servizio richiesto, le ore richieste. Quindi sottomette il form. 6. Il sistema inoltra la richiesta all'ASL competente e avvisa l'utente della avvenuta richiesta.", "dataset": "eANCI"}
{"index": 87, "ucName": "FondiVittimeUsura", "steps": "1. L'utente seleziona la funzionalità “Richiesta assegnazione fondi di solidarietà per vittime di usure ed estorsioni”. 2. Il sistema mostra le informazioni e i relativi moduli da scaricare e da inviare alla Prefettura, offrendo in oltre la possibilità di stampare il tutto.", "dataset": "eANCI"}
{"index": 88, "ucName": "IndennitaAccompagnamento", "steps": "1. L'utente seleziona “Richiesta indennità di accompagnamento”. 2. Il sistema mostra le informazioni relative alla pensione di invalidità e mostra il link per il download del relativo modulo da inviare all'INPS, fornendo la possibilità di stampare il tutto. Inoltre mostra i link diretti alla richiesta di stato di famiglia e di stato civile.", "dataset": "eANCI"}
{"index": 89, "ucName": "MostraPraticaAttesaImpiegato", "steps": "1. Il sistema mostra le informazioni riguardanti la pratica selezionata con le relative opzioni di accettazione o rifiuto pratica. 2. L'Impiegato può Accettare o Respingere la pratica se è già completa di tutta la documentazione, le firme necessarie e dopo averla verificata. Inoltre può stampare i dati della pratica se necessario.", "dataset": "eANCI"}
{"index": 90, "ucName": "PianoZonaAssistenza", "steps": "1. L'utente da remoto seleziona la funzionalità Assistenza Sociale selezionando “Piano di zona: servizi assistenza” 2. Il sistema mostra il piano di zona riguardante i servizi assistenziali.", "dataset": "eANCI"}
{"index": 91, "ucName": "QualificaReduceGuerra", "steps": "1. L'utente seleziona la funzionalità “Richiesta riconoscimento qualifica di reduce o orfano di lavoro”. 2. Il sistema mostra le informazioni e i relativi moduli da scaricare e da inviare alla Prefettura,offrendo la possibilità di stampare il tutto. Inoltre mostra un link diretto alla pagina per la richiesta dell'Atto di nascita, al certificato di residenza e al certificato di morte.", "dataset": "eANCI"}
{"index": 92, "ucName": "RilascioParcheggioDisabili", "steps": "1. L'utente seleziona la funzionalità Assistenza Sociale selezionando “Rilascio Parcheggio Disabili”. 2. Il sistema mostra il form per l'inserimento dei dati del richiedente e del destinatario (se diversi). 3. L'utente inserisce i dati anagrafici del richiedente e quelli del destinatario (se diverso) se necessario specificando il rapporto con tale persona. Inoltre viene specificato il tipo di documentazione allegata al comando dei vigili urbani (certificato medico-legale rilasciato dalla commissione ASL). Quindi sottomette il form. 4. Il sistema preleva i dati anagrafici del cittadino destinatario. La richiesta viene inviata al comando dei vigili urbani ed all'utente viene notificato l'invio.", "dataset": "eANCI"}
{"index": 93, "ucName": "ServizioMobilitaDisabili", "steps": "1. L'utente seleziona “Servizio mobilità e trasporto per disabili”. 2. Il sistema mostra il form per l'inserimento dei dati del richiedente e del destinatario. 3. L'utente inserisce i propri dati e se necessario inserisce i dati di una terza persona specificando il rapporto con tale persona. 4. Il sistema preleva i dati del cittadino richiedente , i dati anagrafici del cittadino destinatario (nel caso in cui il richiedente e il destinatario non fossero la stessa persona), e i dati riguardanti il nucleo familiare del Cittadino destinatario. 5. L'utente specifica le condizioni psico- fisiche del destinatario specificando i documenti allegati (certificato invalidità rilasciato dalla commissione ASL e/o scheda sanitaria del medico curante e/o certificato dell'ente erogatore della pensione,modello ISEE) specificando in ultimo una eventuale data di appuntamento con gli assistenti sociali. Quindi sottomette il form. 6. Il sistema preleva i dati riguardanti eventuali servizi socio-assistenziali di cui il destinatario già usufruisce. Quindi inoltra la richiesta all'ufficio dei Servizi Sociali e avvisa l'utente della avvenuta richiesta.", "dataset": "eANCI"}
{"index": 94, "ucName": "CancellaIscrizioneNewsInformagiovani", "steps": "1. Il cittadino richiede la cancellazione dal servizio di advertise relativo alle news di informagiovani. 2. Il sistema visualizza un form per la conferma della richiesta. 3. Il cittadino conferma l'operazione di cancellazione inscrizione. 4. Il sistema elimina il cittadino dal servizio di advertise.", "dataset": "eANCI"}
{"index": 95, "ucName": "InserimentoCittadino", "steps": "1. L'impiegato accede al sistema, e attiva la procedura di registrazione del cittadino. 2. Il sistema visualizza il form per l'inserimento di un nuovo cittadino. 3. L'impiegato inserisce i dati del cittadino e sottomette la richiesta di registrazione. 4. Il sistema riceve il form, verifica che nel sistema non sia già presente il cittadino inserito dall'impiegato.", "dataset": "eANCI"}
{"index": 96, "ucName": "CancellazioneCardGiovani", "steps": "1. Il cittadino richiede la cancellazione della CardGiovani. 2. Il sistema visualizza un form per l'inserimento del numero della Card. 3. Il cittadino inserisce il numero. 4. Il sistema verifica l'esistenza della card e l'appartenenza al cittadino. 5. Il sistema visualizza un form per la conferma della richiesta. 6. Il cittadino conferma l'eliminazione della card. 7. Il sistema elimina la card giovani dal repository.", "dataset": "eANCI"}
{"index": 97, "ucName": "CardAnnullata", "steps": "1. Cittadino decide di voler annullare la card giovani e quindi inserisce nel form che la vuole annullare. 2. Il sistema riceve il form notifica l'avvenuto annullamento della card e ripresenta il form.", "dataset": "eANCI"}
{"index": 98, "ucName": "EliminazionePrenotazioneColloquio", "steps": "1. Il cittadino richiede la cancellazione della prenotazione del colloquio nel consultorio. 2. Il sistema visualizza un form per la conferma della richiesta. 3. Il cittadino conferma l'eliminazione della prenotazione. 4. Ilsistemaeliminalaprenotazione.", "dataset": "eANCI"}
{"index": 99, "ucName": "InformazioniConsultorioGiovani", "steps": "1. Il Cittadino richiede la visualizzazione dell'elenco dei consultori. 3. 2. Il sistema permette di visualizzare l'elenco dei consultori. Il cittadino sceglie il consultorio. 4. Il sistema restituisce le informazioni riguardanti il consultorio prescelto visualizzandone dati come: • la localizzazione; • le date e gli orari d'apertura. • l'eventuale lista dei colloqui prenotati(invocando il caso d'uso VisualizzazionePrenotazioneConsu ltorio).", "dataset": "eANCI"}
{"index": 100, "ucName": "InformazioniInformagiovani", "steps": "1. Il Cittadino richiede la visualizzazione dell'elenco delle notizie di informagiovani. 3. 2. Il sistema permette di visualizzare l'elenco delle informazioni riguardanti: • gazzetta ufficiale speciale lavoro; • informazioni bandi concorso locali, • viaggi studio. Il cittadino sceglie l'informazione desiderata. 4. Il sistema restituisce le informazioni riguardanti la notizia specificando: • data di pubblicazione del bando; • data di scadenza del bando; • descrizione", "dataset": "eANCI"}
{"index": 101, "ucName": "IscrizioneCardGiovani", "steps": "1. Il cittadino richiede l'iscrizione alla card giovani. 2. Il sistema visualizza un form per la sottomissione della richiesta. 3. Il cittadino inserisce i dati della richiesta della card in un form. 4. Il sistema riceve il form, verifica i dati e sottomette la richiesta. 5. Il sistema comunica l'avvenuto inserimento della card e visualizza in un form il numero della card e il riepilogo dei dati inseriti.", "dataset": "eANCI"}
{"index": 102, "ucName": "IscrizioneNewsInformagiovani", "steps": "1. Il cittadino richiede l'iscrizione alle news di informagiovani per ricevere advertise relative al servizio. 2. Il sistema visualizza un form per la sottomissione della richiesta. 3. Il cittadino inserisce i dati della richiesta di news in un form. 4. Il sistema riceve il form, verifica i dati e sottomette la richiesta.", "dataset": "eANCI"}
{"index": 103, "ucName": "ModificaPrenotazioneColloquio", "steps": "1. Il cittadino richiede la modifica della prenotazione del colloquio nel consultorio. 2. Il sistema visualizza un form per la modifica dei campi della prenotazione. 3. Il cittadino effettua le modifiche nel form conferma la prenotazione. 4. Ilsistemamodificalaprenotazione.", "dataset": "eANCI"}
{"index": 104, "ucName": "NewsAnnullato", "steps": "1. Cittadino decide di voler annullare le news di informagiovani e quindi inserisce nel form che la vuole annullare. 2. Il sistema riceve il form notifica l'avvenuto annullamento delle news e ripresenta il form.", "dataset": "eANCI"}
{"index": 105, "ucName": "PrenotazioneColloquio", "steps": "1. Il cittadino richiede un colloquio nel consultorio preselezionato. 2. Il sistema visualizza un form per la sottomissione della richiesta. 3. Il cittadino inserisce i dati della richiesta di colloquio in un form. 4. Il sistema riceve il form, verifica i dati per la prenotazione e sottomette la richiesta. 5. Cittadino richiede stampa la ricevuta della prenotazione del colloquio. 6. Ilsistemastampalaprenotazione.", "dataset": "eANCI"}
{"index": 106, "ucName": "InserimentoImpiegato", "steps": "1. L'amministratore accede al sistema, tramite terminale amministrativo, e attiva la procedura di registrazione dell'Impiegato. 2. Il sistema visualizza il form per l'inserimento di un nuovo impiegato. 3. L'Amministratore inserisce i dati dell'Impiegato e sottomette la richiesta di registrazione. 4. Il sistema riceve il form, verifica che nel sistema non sia già presente la matricola inserita dall'Amministratore e genera una password, salva i dati inseriti e mostra una notifica dell'avvenuta registrazione con la password assegnata all'impiegato.", "dataset": "eANCI"}
{"index": 107, "ucName": "PrenotazioneColloquioAnnullato", "steps": "1. Cittadino decide di voler annullare la prenotazione del colloquio e quindi inserisce nel form che la vuole annullare. 2. Il sistema riceve il form notifica l'avvenuto annullamento della prenotazione del colloquio e ripresenta il form.", "dataset": "eANCI"}
{"index": 108, "ucName": "VisualizzazionePrenotazioneConsultorio", "steps": "1. Il Cittadino richiede la visualizzazione della prenotazione effettuata in un consultorio. 2. Il sistema restituisce le informazioni riguardanti la prenotazione prescelta visualizzandone dati come: • Data e ora; • Consultorio.", "dataset": "eANCI"}
{"index": 109, "ucName": "CancellaInformazione", "steps": "1. L'impiegato richiede la cancellazione di una news. 2. Il sistema visualizza l'elenco delle news esistenti 3. L'impiegato sceglie una news. 4. Il sistema visualizza un form la conferma dell'operazione. 5. L'impiegato conferma l'operazione attraverso il form. 6. Il sistema riceve il form, e cancella i dati della news dal sistema", "dataset": "eANCI"}
{"index": 110, "ucName": "InformazioniBiblioteche", "steps": "1. Il Cittadino richiede la visualizzazione dell'elenco delle biblioteche. 3. 2. Il sistema permette di visualizzare l'elenco delle biblioteche. Il cittadino sceglie la biblioteca. 4. Il sistema restituisce le informazioni riguardanti la biblioteca prescelta visualizzandone dati come: • • • la localizzazione; le date e gli orari d'apertura; il link al sito della biblioteca.", "dataset": "eANCI"}
{"index": 111, "ucName": "InformazioniEventiNelTerritorio", "steps": "1. Il Cittadino richiede la visualizzazione dell'elenco degli eventi. 3. 2. Il sistema permette di visualizzare l'elenco degli eventi. Il cittadino sceglie l'evento. 4. Il sistema restituisce le informazioni riguardanti l'evento prescelto visualizzandone dati come: • • • il luogo; la data e l'ora dell'evento; sito che gestisce l'evento (Pro-loco).", "dataset": "eANCI"}
{"index": 112, "ucName": "InformazioniMusei", "steps": "1. Il Cittadino richiede la visualizzazione dell'elenco dei musei. 3. 2. Il sistema permette di visualizzare l'elenco dei musei. Il cittadino sceglie il museo. 4. Il sistema restituisce le informazioni riguardanti il museo prescelto visualizzandone dati come: • • • la localizzazione; le date e gli orari d'apertura; il link al sito del museo.", "dataset": "eANCI"}
{"index": 113, "ucName": "InformazioniPromozioneTerritoriale", "steps": "1. Il Cittadino richiede la visualizzazione dell'elenco delle promozioni territoriali. 3. 2. Il sistema permette di visualizzare l'elenco delle promozioni. Il cittadino sceglie la promozione. 4. Il sistema restituisce le informazioni riguardanti la promozione prescelta.", "dataset": "eANCI"}
{"index": 114, "ucName": "InserimentoInformazione", "steps": "1. L'impiegato richiede l'inserimento di una nuova news. 2. Il sistema visualizza un form per la sottomissione della richiesta. 3. L'impiegato inserisce i dati relativi alla nuova news in un form. 4. Il sistema riceve il form, e inserisce la news nel sistema", "dataset": "eANCI"}
{"index": 115, "ucName": "ModificaInformazione", "steps": "1. L'impiegato richiede la modifica di una news. 2. Il sistema visualizza l'elenco delle news esistenti 3. L'impiegato sceglie una news. 4. Il sistema visualizza un form per la modifica della news. 5. L'impiegato inserisce i dati relativi alla news in un form. 6. Il sistema riceve il form, e aggiorna i dati della news nel sistema", "dataset": "eANCI"}
{"index": 116, "ucName": "VisualizzaInformazioni", "steps": "1. Il Cittadino richiede la visualizzazione della informazioni presenti sul territorio. 2. Il sistema restituisce le informazioni riguardanti il territorio visualizzandone dati come: • biblioteche; • eventi; • musei; • promozioni presenti sul territorio.", "dataset": "eANCI"}
{"index": 117, "ucName": "LogoutAmministratore", "steps": "1. L'amministratore vuole terminare la sessione di lavoro e clicca sul bottone Logout. 2. Il sistema disconnette l'amministratore dal sistema e ritorna alla schermata principale.", "dataset": "eANCI"}
{"index": 118, "ucName": "Comunicazioni", "steps": "1. Il cittadino accede all'area delle comunicazioni mediante l'apposito link 2. Il sistema visualizza la form per l'inserimento dei dati necessari per la comunicazione (es. comunicazione di inizio lavori,D.I.A., comunicazione di fine lavori...) 3. Il cittadino inserisce i dati richiesti 4. Il sistema verifica correttezza e completezza dei dati quindi mostra una schermata di riepilogo oppure attiva il caso d'uso DatiErrati. 5. Il cittadino conferma l'operazione 6. Il sistema visualizza il modulo per la stampa 7. Il sistema invia all'impiegato competente un messaggio di notifica della richiesta 8. Il cittadino effettua la stampa da consegnare all'ufficio comunale con una marca da bollo", "dataset": "eANCI"}
{"index": 119, "ucName": "DefinizioneIllecitiEdilizi", "steps": "1. Il cittadino accede all'area richiesta definizione illeciti edilizi mediante l'apposito link 2. Il sistema visualizza la form per l'inserimento dei dati necessari alla richiesta 3. Il cittadino inserisce i dati richiesti 4. Il sistema verifica correttezza e completezza dei dati quindi mostra una schermata di riepilogo oppure attiva il caso d'uso DatiErrati 5. Il cittadino conferma l'operazione 6. Il sistema visualizza un messaggio di notifica della richiesta 7. Il sistema invia all'impiegato competente un messaggio di notifica della richiesta", "dataset": "eANCI"}
{"index": 120, "ucName": "DichiarazioneSostitutivaAttoNotorieta", "steps": "1. Il cittadino accede all'area Dichiarazione sostitutiva dell'atto di notorietà mediante l'apposito link 2. Il sistema visualizza la form per l'inserimento dei dati necessari alla richiesta 3. Il cittadino inserisce i dati richiesti 4. Il sistema verifica correttezza e completezza dei dati quindi mostra una schermata di riepilogo oppure attiva il caso d'uso DatiErrati 5. Il cittadino conferma l'operazione 6. Il sistema visualizza un messaggio di notifica 7. Il sistema invia all'impiegato competente un messaggio di notifica della richiesta", "dataset": "eANCI"}
{"index": 121, "ucName": "VisionePianoRegolatore", "steps": "1. Il cittadino accede all'area Piano Regolatore mediante l'apposito link 2. il sistema visualizza il documento", "dataset": "eANCI"}
{"index": 122, "ucName": "PresentareProgettoEdilizio", "steps": "1. Il cittadino accede all'area presentazione progetto edilizio mediante l'apposito link 2. Il sistema visualizza la form per l'inserimento dei dati necessari 3. Il cittadino inserisce i dati richiesti 4. Il sistema verifica correttezza e completezza dei dati quindi mostra una schermata di riepilogo oppure attiva il caso d'uso DatiErrati 5. Il cittadino conferma l'operazione 6. Il sistema visualizza il modulo per la stampa 7. Il sistema invia all'impiegato competente un messaggio di notifica della richiesta 8. Il cittadino effettua la stampa da consegnare all'ufficio comunale con allegati i documenti richiesti e una marca da bollo", "dataset": "eANCI"}
{"index": 123, "ucName": "RicercaFascicoloEdilizio", "steps": "1. 3. 5. Il cittadino accede all'area di ricerca 2. Il sistema visualizza la form per l'inserimento della chiave di ricerca Il cittadino inserisce la chiave di ricerca 4. Ilsistemamostrairisultatidellaricerca Il cittadino seleziona il fascicolo 6. Ilsistemavisualizzailfascicolo", "dataset": "eANCI"}
{"index": 124, "ucName": "RichiestaAutorizzazioni", "steps": "1. Il cittadino accede all'area rilascio certificati e autorizzazioni mediante l'apposito link 2. Il sistema visualizza la form per l'inserimento dei dati necessari alla richiesta dell'autorizzazione (es. autorizzazione allacciamento alla rete idrica, autorizzazione allacciamento alla rete fognaria ...) 3. Il cittadino inserisce i dati richiesti 4. Il sistema verifica correttezza e completezza dei dati quindi mostra una schermata di riepilogo oppure attiva il caso d'uso DatiErrati 5. Il cittadino conferma l'operazione 6. Il sistema visualizza il modulo per la stampa 7. Il sistema invia all'impiegato competente un messaggio di notifica della richiesta 8. Il cittadino effettua la stampa da consegnare presso l'ufficio comunale con la marca da bollo e gli allegati", "dataset": "eANCI"}
{"index": 125, "ucName": "RichiestaCopiaFascicoloEdilizio", "steps": "1. Il cittadino richiede la copia del fascicolo mediante apposito pulsante 2. Ilsistemainvialarichiestaall'impiegato 3. Il sistema notifica al cittadino che la richiesta è stata inoltrata e la copia gli sarà a breve inviata", "dataset": "eANCI"}
{"index": 126, "ucName": "RichiestaDefinizioneCondono", "steps": "1. Il cittadino accede all'area richiesta definizione condono mediante l'apposito link 2. Il sistema visualizza la form per l'inserimento dei dati necessari alla 3. 5. richiesta Il cittadino inserisce i dati richiesti 4. Il sistema verifica correttezza e completezza dei dati quindi mostra una schermata di riepilogo oppure attiva il caso d'uso DatiErrati Il cittadino conferma l'operazione 6. Il sistema visualizza un messaggio di notifica della richiesta 7. Il sistema invia all'impiegato competente un messaggio di notifica della richiesta", "dataset": "eANCI"}
{"index": 127, "ucName": "RichiestaNumeroCivico", "steps": "1. Il cittadino accede all'area richiesta numero civico mediante l'apposito link 3. 5. 2. Il sistema visualizza la form per l'inserimento dei dati necessari alla richiesta Il cittadino inserisce i dati richiesti 4. Il sistema verifica correttezza e completezza dei dati quindi mostra una schermata di riepilogo oppure attiva il caso d'uso DatiErrati Il cittadino conferma l'operazione 6. Il sistema visualizza un messaggio di notifica della richiesta 7. Il sistema invia all'impiegato competente un messaggio di notifica della richiesta", "dataset": "eANCI"}
{"index": 128, "ucName": "LogoutCittadino", "steps": "1. Il cittadino vuole terminare la sessione di lavoro e clicca sul bottone Logout. 2. Il sistema disconnette il cittadino dal sistema e ritorna alla schermata principale.", "dataset": "eANCI"}
{"index": 129, "ucName": "RichiestaServizioCatastale", "steps": "1. Il cittadino accede all'area servizio catasto comunale mediante l'apposito link 2. Il sistema visualizza la form per l'inserimento dei dati necessari per la richiesta 3. Il cittadino inserisce i dati richiesti 4. Il sistema verifica correttezza e completezza dei dati quindi mostra una schermata di riepilogo oppure attiva il caso d'uso DatiErrati 5. Il cittadino conferma l'operazione 6. Il sistema visualizza il metodi di pagamento 7. Il cittadino effettua la scelta 8. Il sistema invia all'impiegato competente un messaggio di notifica della richiesta 9. Il sistema notifica al cittadino che la richiesta è stata inoltrata e la copia gli sarà a breve inviata", "dataset": "eANCI"}
{"index": 130, "ucName": "RilascioCertificati", "steps": "1. Il cittadino accede all'area rilascio certificati e autorizzazioni mediante l'apposito link 2. Il sistema visualizza la form per l'inserimento dei dati necessari al rilascio del certificato (es. certificato di agibilità, certificato di abitabilità, ...) 3. Il cittadino inserisce i dati richiesti 4. Il sistema verifica correttezza e completezza dei dati quindi mostra una schermata di riepilogo oppure attiva il caso d'uso DatiErrati 5. Il cittadino conferma l'operazione 6. Il sistema visualizza il modulo per la stampa 7. Il sistema invia all'impiegato competente un messaggio di notifica della richiesta 8. Il cittadino effettua la stampa da consegnare presso l'ufficio comunale con la marca da bollo", "dataset": "eANCI"}
{"index": 131, "ucName": "VisioneCircolari", "steps": "1. 3. Il cittadino accede all'area circolari mediante l'apposito link 2. Il sistema visualizza l'elenco numerato delle circolari Il cittadino sceglie la circolare mediante link 4. Ilsistemavisualizzalacircolarescelta", "dataset": "eANCI"}
{"index": 132, "ucName": "AggiornaAnalisiAmbientali", "steps": "1. L'impiegato comunale dopo essersi autenticato nel sistema aggiorna il form che prevede semplicemente la copia del referto delle analisi effettuate sull'ambiente dalla Protezione Civile 2. Il sistema risponde mettendo a disposizione dell'impiegato un form in cui riportare le informazioni redatte dagli esperti chimici. 3. L'impiegato completa il campo del form presentato dal sistema e lo sottomette. 4. Il sistema ne aggiorna il form e permette la visualizzazione di quest'ultimo al Cittadino.", "dataset": "eANCI"}
{"index": 133, "ucName": "AggiornaBandiEConcorsi", "steps": "1. 3. L'impiegato comunale dopo essersi autenticato nel sistema aggiorna la lista delle associazioni che hanno pubblicato un nuovo bando di concorso. 2. Il sistema risponde mettendo a disposizione dell'impiegato un form da completare per aggiornare i campi: logo_associazione, descrizione, nome_associazione, bando. L'impiegato completa i campi del form presentato dal sistema e lo sottomette. 4. Il sistema ne aggiorna il form e permette la visualizzazione di quest'ultimo al Cittadino.", "dataset": "eANCI"}
{"index": 134, "ucName": "AggiornaCondizioniAtmosferiche", "steps": "1. 3. L'impiegato comunale dopo essersi autenticato nel sistema aggiorna le condizioni atmosferiche del comune e delle province regionali. 2. Il sistema risponde mettendo a disposizione dell'impiegato un form da completare per aggiornare i campi: tempMin, tempMax, statoAtmosferico, nomeCittà, data. L'impiegato completa i campi del form presentato dal sistema e lo sottomette 4. Il sistema ne aggiorna il form e permette la visualizzazione di quest'ultimo al Cittadino.", "dataset": "eANCI"}
{"index": 135, "ucName": "AttivitàUtili", "steps": "1. Selezionando questo caso d'uso, il Cittadino accede ad una schermata di scelta di due casi d'uso: Boschi, Rifiuti 2. Il sistema mette a disposizione una semplice ed intuitiva schermata che permette di scegliere quale dei due servizi visitare, per aiutare indirettamente a mantenere accettabili, le condizioni ambientali comunali. 3. Il Cittadino sceglie uno dei due casi d'uso Boschi, o Rifiuti. 4. Il sistema risponde all'esigenza del Cittadino facendogli visualizzare la pagina desiderata che aveva richiesto.", "dataset": "eANCI"}
{"index": 136, "ucName": "BandiEConcorsi", "steps": "1. Il Cittadino accede alla schermata iniziale per poter visionare la possibilità di visionare le associazioni che affiancano la Protezione Civile. 2. Il sistema risponde all'esigenza permettendo al Cittadino di visualizzare tutte le associazioni che fanno capo alla Protezione Civile e che assumono personale, con una piccola immagine dell'associazione, con accanto la possibilità di ricevere il download del bando messo a disposizione dalla associazione in questione. 3. Il Cittadino prende atto di ciò che fornisce la scheda, e sceglie da quale, tra le associazioni messe a disposizione, ricevere notizie per una eventuale assunzione o partecipazione al concorso, circa le modalità dello stesso. 4. Il sistema risponde a tale esigenza permettendogli di visualizzare il bando di concorso corrispondente.", "dataset": "eANCI"}
{"index": 137, "ucName": "Boschi", "steps": "1. Il Cittadino accede a questa schermata per poter conoscere i consigli che la Protezione Civile mette a disposizione di chiunque al fine di evitare e far evitare gli incendi boschivi. 2. Il sistema mette a disposizione una schermata con una serie di regola che il Cittadino dovrebbe seguire e far seguire se si trova con terze parti, per impedire il verificarsi di incendi dolosi, e in caso di questo, quale autorità chiamare.", "dataset": "eANCI"}
{"index": 138, "ucName": "CheTempoFa", "steps": "1. Il Cittadino accede a questa schermata per visualizzare la situazione meteorologica del comune in cui risiede. 2. Il sistema risponde all'esigenza del Cittadino permettendogli di visualizzare, oltre alla situazione tempo, del suo comune,anche quella delle provincie della regione a cui appartiene, con data di aggiornamento, temperature minime e massime, e ovviamente, condizioni atmosferiche espresse con una piccola immagine descrittiva.", "dataset": "eANCI"}
