{"index": 0, "ucName": "Login", "uctext": "Permette ad un utente di loggarsi al sistema", "steps":"1. Verifica che username e password abbiano lunghezza >=5. Se la condizione è rispettata passa al punto due, altrimenti notifica l'errore all'utente. 2. Cerca nell’archivio se username e password inseriti dall’utente sono presenti tra gli utenti loggabili 3. Se la ricerca ha avuto successo l’utente viene loggato al sistema", "dataset": "SMOS"}
{"index": 1, "ucName": "Assegna/RimuoviRuoliAdUnUtente", "uctext": "Consente di assegnare o rimuovere ruoli ad un utente", "steps":"2. Seleziona i ruoli da assegnare o rimuovere all’utente 3. Clicca sul pulsante “Invia” Sistema 1. Visualizza il form di gestione dei ruoli 4. Assegna o rimuove i ruoli dell’utente come indicato dall’Amministratore", "dataset": "SMOS"}
{"index": 2, "ucName": "Assegna/RimuoviInsegnamentiAdUnDocente", "uctext": "Consente di assegnare o rimuovere insegnamenti ad un docente", "steps":"2. Seleziona l'anno accademico 4. Seleziona la classe desiderata 6. Seleziona gli insegnamenti da associare o rimuovere al docente Sistema 1. Visualizza il form di gestione degli insegnamenti per il docente in oggetto 3. Visualizza l'elenco delle classi disponibili per l'anno selezionato 5. Visualizza l'elenco degli insegnamenti associati a quella classe 7. Assegna o rimuove gli insegnamenti del docente come indicato dall’Amministratore", "dataset": "SMOS"}
{"index": 3, "ucName": "Assegna/RimuoviStudentiAdUnGenitore", "uctext": "Consente di associare nuovi studenti ad un genitore o di rimuovere le associazioni precedentemente inserite", "steps":"2. Selezione gli studenti da assegnare o rimuovere al genitore 3. Clicca sul pulsante “Invia” Sistema 1. Visualizza il form di gestione dei figli per il genitore in oggetto 4. Assegna/Rimuove gli studenti associati ad un Genitore", "dataset": "SMOS"}
{"index": 4, "ucName": "VisualizzaElencoClassi", "uctext": "Permette di visualizzare l’elenco delle classi", "steps":"2. Seleziona l’anno accademico di interesse. Sistema 1. Permette di selezionare l’anno accademico di cui si vuole visualizzare l’elenco delle classi. 3. Cerca le classi nell’archivio e visualizza la schermata di gestione delle classi 4. Visualizza l’elenco delle classi dell’anno accademico selezionato.", "dataset": "SMOS"}
{"index": 5, "ucName": "InserisciNuovaClasse", "uctext": "Inserisce una nuova classe nell’archivio", "steps":"2. Compila il form 3. Clicca sul pulsante “Salva” Sistema 1. Il sistema mostra il form da compilare con: nome, indirizzo, anno accademico. 4. Effettua dei controlli sulla validità dei dati immessi e inserisce la nuova classe nell’archivio; nel caso in cui i dati inseriti non sono validi, attiva il caso d’uso “ErroreDati”.", "dataset": "SMOS"}
{"index": 6, "ucName": "VisualizzaDettagliClasse", "uctext": "Permette di visualizzare i dettagli di una classe", "steps":"1. Visualizza la scherma con i dettagli di una singola classe: nome, indirizzo, anno scolastico.", "dataset": "SMOS"}
{"index": 7, "ucName": "EliminaClasse", "uctext": "Elimina una classe dall’archivio", "steps":"1. Elimina la classe dall’archivio 2. Visualizza l’elenco delle classi aggiornato", "dataset": "SMOS"}
{"index": 8, "ucName": "VisualizzaElencoIndirizzi", "uctext": "Permette di visualizzare l’elenco degli Indirizzi", "steps":"1. Visualizza l’elenco degli indirizzi.", "dataset": "SMOS"}
{"index": 9, "ucName": "InserisciNuovoIndirizzo", "uctext": "Inserisce un nuovo indirizzo nell’archivio", "steps":"2. Compila il form 3. Clicca sul pulsante “Salva” Sistema 1. Il sistema mostra il form da compilare con: nome indirizzo. 4. Effettua dei controlli sulla validità dei dati immessi e inserisce un nuovo indirizzo nell’archivio; nel caso in cui i dati inseriti non sono validi, attiva il caso d’uso “ErroreDati”.", "dataset": "SMOS"}
{"index": 10, "ucName": "VisualizzaDettagliIndirizzo", "uctext": "Permette di visualizzare i dettagli di un indirizzo", "steps":"1. Visualizza la schermata con i dettagli di un singolo indirizzo; in particolare :nome indirizzo.", "dataset": "SMOS"}
{"index": 11, "ucName": "LoginErrato", "uctext": "Si verifica quando l’utente ha inserito dati di autenticazione errati.", "steps":"1. Visualizza il form di login", "dataset": "SMOS"}
{"index": 12, "ucName": "EliminaIndirizzo", "uctext": "Elimina un indirizzo dall’archivio", "steps":"1. Verifica se l'indirizzo ha classi associate; in caso affermativo mostra un messaggio di errore “Impossibile eliminare l'indirizzo, cancellare le classi associate e riprovare”, altrimenti elimina l'indirizzo. 2. Visualizza l’elenco degli indirizzi aggiornato", "dataset": "SMOS"}
{"index": 13, "ucName": "AssegnaRimuoviInsegnamenti", "uctext": "Assegna o rimuove uno o più insegnamenti da un indirizzo", "steps":"2. Seleziona gli insegnamenti da assegnare o rimuovere all’indirizzo 3. Clicca sul pulsante “Invia” Sistema 1. Visualizza un form da cui è possibile aggiungere e/o rimuovere insegnamenti all’indirizzo. 4. Associa o rimuove gli insegnamenti selezionati all’indirizzo. 5. Torna alla visualizzazione dei dettagli dell’indirizzo.", "dataset": "SMOS"}
{"index": 14, "ucName": "VisualizzaElencoInsegnamenti", "uctext": "Permette di visualizzare l’elenco degli insegnamenti", "steps":"1. 2. Cerca gli nell’archivio e schermata di insegnamenti Visualizza insegnamenti insegnamenti visualizza la gestione degli l’elenco degli", "dataset": "SMOS"}
{"index": 15, "ucName": "InserisciNuovoInsegnamento", "uctext": "Inserisce un nuovo insegnamento nell’archivio", "steps":"2. Compila il form 3. Clicca sul pulsante “Salva” Sistema 1. Il sistema mostra il form da compilare con: nome insegnamento. 4. Effettua dei controlli sulla validità dei dati immessi e inserisce il nuovo insegnamento nell’archivio; nel caso in cui i dati inseriti non sono validi, attiva il caso d’uso “ErroreDati”.", "dataset": "SMOS"}
{"index": 16, "ucName": "VisualizzaDettagliInsegnamento", "uctext": "Permette di visualizzare i dettagli di un insegnamento", "steps":"1. Visualizza la schermata con i dettagli di un singolo insegnamento.", "dataset": "SMOS"}
{"index": 17, "ucName": "ModificaInsegnamento", "uctext": "Modifica dettagli di un insegnamento", "steps":"1. Clicca sul pulsante “Salva” 2. Effettua dei controlli sulla validità dei dati immessi e modifica l’insegnamento nell’archivio; nel caso in cui i dati inseriti non sono validi, attiva il caso d’uso “ErroreDati”. 3. Visualizza l’elenco degli insegnamenti aggiornato", "dataset": "SMOS"}
{"index": 18, "ucName": "EliminaInsegnamento", "uctext": "Elimina un insegnamento dall’archivio", "steps":"1. Elimina l’insegnamento dall’archivio 2. Visualizza l’elenco degli insegnamenti aggiornato", "dataset": "SMOS"}
{"index": 19, "ucName": "VisualizzaElencoRegistri", "uctext": "Visualizza l’elenco dei registri per un anno accademico", "steps":"2. Seleziona l’anno scolastico 1. Mostra una schermata per la selezione dell’anno accademico di interesse. 3. Cerca nell’archivio tutti i registri digitali di quell’anno e li visualizza associati alla classe cui appartengono.", "dataset": "SMOS"}
{"index": 20, "ucName": "VisualizzaDettagliSingoloRegistro", "uctext": "Visualizza i dettagli di uno dei registri di classe", "steps":"1. Visualizza a video le informazioni contenute nel registro organizzate per data. In particolare mostra, per la data odierna, l’elenco degli alunni, specificando: assenti/presenti, entrate in ritardo ed un form dal quale è possibile gestire giustifiche e note disciplinari.", "dataset": "SMOS"}
{"index": 21, "ucName": "InserisciAssenzeAdmin", "uctext": "Digitalizzazione del Registro, inserimento dati da parte dell’Amministratore", "steps":"2. Compila il form inserendo studenti assenti/presenti e clicca “Salva” 1. Aggiorna la schermata visualizzata in base alla data 3. Invia i dati al server. Il server per ogni assenza invia una e-mail di notifica al genitore dell'alunno. 4. Visualizza i dati del registro aggiornati.", "dataset": "SMOS"}
{"index": 22, "ucName": "Logout", "uctext": "Permette ad un utente di uscire dal sistema", "steps":"1. Visualizza il form di login", "dataset": "SMOS"}
{"index": 23, "ucName": "InserisciRitardiAdmin", "uctext": "Digitalizzazione del Registro, inserimento dati da parte dell’Amministratore", "steps":"2. Compila il form inserendo studenti con ritardo e clicca “Salva” 1. Aggiorna la schermata visualizzata in base alla data 3. Invia i dati al server. 4. Visualizza i dati del registro aggiornati.", "dataset": "SMOS"}
{"index": 24, "ucName": "ModificaAssenza", "uctext": "Modifica delle assenze da parte dell'Amministratore. La modifica è da intendersi come inserimento/cancellazione dell’assenza.", "steps":"2. Modifica l'assenza (Inserisce o Elimina) e clicca “Salva” 1. Aggiorna la schermata in base alla data selezionata 3. Invia i dati modificati al server. Il sistema invia una e-mail di rettifica al genitore dell'alunno.", "dataset": "SMOS"}
{"index": 25, "ucName": "ModificaRitardo", "uctext": "modifica di un ritardo da parte dell'Amministratore", "steps":"2. L'utente modifica il ritardo e clicca su “Salva” 1. Aggiorna la schermata in base alla data selezionata 3. Il sistema invia i dati modificati al server .", "dataset": "SMOS"}
{"index": 26, "ucName": "EliminaRitardo", "uctext": "Eliminazione di un ritardo da parte dell'Amministratore", "steps":"2. Elimina l’entrata in ritardo di uno studente e clicca “Salva” 1. Aggiorna la schermata in base alla data selezionata 3. Elimina l’entrata in ritardo dall’archivio.", "dataset": "SMOS"}
{"index": 27, "ucName": "VisualizzaElencoGiustifiche", "uctext": "Visualizza i l'elenco delle giustifiche", "steps":"1. Mostra tutte le assenze dell'alunno registrate scolastico selezionato Le assenze già giustificate vengono visualizzate in verde, quelle da giustificare in rosso durante l'anno", "dataset": "SMOS"}
{"index": 28, "ucName": "VisualizzaElencoNote", "uctext": "Visualizza l'elenco delle note inerente allo studente", "steps":"1. Mostra tutte le note dell'alunno registrate durante l'anno scolastico", "dataset": "SMOS"}
{"index": 29, "ucName": "InserisciGiustifica", "uctext": "Inserimento Giustifica", "steps":"2. Compila il form 3. Clicca su “Salva” 1. Mostra un form in cui inserire i campi della giustifica (data giustifica). 4. Salva la giustifica.", "dataset": "SMOS"}
{"index": 30, "ucName": "InserisciNota", "uctext": "Inserimento Note Disciplinari", "steps":"2. Compila il form 3. Clicca su “Salva” 1. Mostra un form con i campi della nota (studente, data, docente , descrizione). 4. Salva la nota e invia una notifica via e-mail al genitore", "dataset": "SMOS"}
{"index": 31, "ucName": "VisualizzaDettagliGiustifica", "uctext": "Visualizza i dettagli di una giustifica", "steps":"1. Mostra un form con i dettagli della giustifica e la possibilità di modificare o eliminare la giustifica.", "dataset": "SMOS"}
{"index": 32, "ucName": "VisualizzaDettagliNota", "uctext": "Visualizza i dettagli di una nota", "steps":"1. Mostra un form con i dettagli della nota: alunno, descrizione, docente, data.", "dataset": "SMOS"}
{"index": 33, "ucName": "ModificaPassword", "uctext": "Permette ad un utente di modificare la propria password", "steps":"2. Compila il form e sottomette; Sistema 1. Visualizza il form con i campi: vecchia password, nuova password, conferma nuova password. 3. Conferma l’avvenuta modifica della password", "dataset": "SMOS"}
{"index": 34, "ucName": "ModificaGiustifica", "uctext": "Modifica di una Giustifica", "steps":"1. Modifica uno o più campi del form visualizzato: data giustifica. 2. Clicca su “Salva” 3. Modifica la giustifica.", "dataset": "SMOS"}
{"index": 35, "ucName": "ModificaNota", "uctext": "Modifica di una Nota Disciplinare", "steps":"1. L'utente modifica uno o più campi del form visualizzato: Studente, descrizione, docente, data. 2. L'utente clicca su “Salva” 3. Il sistema salva le modifiche", "dataset": "SMOS"}
{"index": 36, "ucName": "EliminaGiustifica", "uctext": "Elimina Giustifica", "steps":"1. Elimina la giustifica.", "dataset": "SMOS"}
{"index": 37, "ucName": "EliminaNota", "uctext": "Eliminazione Note Disciplinari", "steps":"1. Il sistema invia una notifica di errata corrige ai genitori dello studente, poi elimina i dati della nota dall’archivio.", "dataset": "SMOS"}
{"index": 38, "ucName": "EffettuaMonitoraggioStudenti", "uctext": "Consente di interrogare il sistema circa il numero di assenze e note associate agli studenti", "steps":"1. Cerca nell'archivio gli studenti che abbiano, per l'anno scolastico in corso un numero di assenze e note superiori ad una soglia prestabilita. 2. Visualizza una schermata di presentazione dei dati ottenuti.", "dataset": "SMOS"}
{"index": 39, "ucName": "VisualizzazioneDiUnaPagella", "uctext": "Visualizzazione di una pagella", "steps":"1. Seleziona l’anno accademico 3. Sceglie la classe dell'alunno di cui vuole visualizzare la pagella 5. Seleziona l'alunno e il quadrimestre di cui visualizzare la pagella cliccando sul relativo pulsante. Sistema 2. Visualizza l’elenco delle classi presenti nel sistema con accanto un pulsante “Pagelle” associato ad ogni classe 4. Visualizza l'elenco degli alunni della classe scelta dall'utente 6. Visualizza la pagella dell'alunno scelto riferita al quadrimestre selezionato.", "dataset": "SMOS"}
{"index": 40, "ucName": "InserimentoPagella", "uctext": "Inserimento di una pagella di uno studente eseguito dall’Amministratore", "steps":"2. Sceglie la classe dell'alunno di cui inserire la pagella 4. Seleziona l'alunno a cui inserire la pagella cliccando sul relativo tasto 6. Inserisce i voti della pagella, tutti o in parte, e clicca sul tasto “salva” Sistema 1. Visualizza l’elenco delle classi presenti nel sistema riferito all’anno accademico in corso con accanto un pulsante “Pagelle” associato ad ogni classe 3. Visualizza l'elenco degli alunni della classe scelta dall'utente 5. Visualizza il form per l'inserimento di una pagella 7. Inserisce i voti inseriti nell'archivio e riporta l'utente alla pagina di visualizzazione degli studenti della classe.", "dataset": "SMOS"}
{"index": 41, "ucName": "ModificaDiUnaPagella", "uctext": "Caso d’uso per modificare la pagella di un alunno", "steps":"2. Inserisce i nuovi dati e clicca il tasto di conferma Sistema 1. Visualizza il form con i campi da poter modificare tra cui i voti delle diverse materie 3. Il sistema visualizza un messaggio di conferma e visualizza il form con l'elenco degli alunni", "dataset": "SMOS"}
{"index": 42, "ucName": "CancellazioneDiUnaPagella", "uctext": "L’Amministratore elimina una pagella dal sistema", "steps":"2. L'utente accetta la cancellazione premendo il tasto di conferma Sistema 1. Il sistema visualizza un form per confermare la cancellazione 3. Visualizza un messaggio di corretta cancellazione e visualizza il form con l'elenco delle classi", "dataset": "SMOS"}
{"index": 43, "ucName": "VisualizzaRichiesteDiIscrizione", "uctext": "Consente all'amministratore di visualizzare l'elenco delle richieste di iscrizione giunte al sistema", "steps":"1 . Visualizza l'elenco delle iscrizioni ancora da attivare.", "dataset": "SMOS"}
{"index": 44, "ucName": "VisualizzaElencoUtenti", "uctext": "Visualizza l’elenco degli utenti presenti nel sistema", "steps":"1. Cerca gli utenti nell’archivio e ne visualizza l’elenco", "dataset": "SMOS"}
{"index": 45, "ucName": "AccettaIscrizioneStudente", "uctext": "Consente all'amministratore di accettare l'iscrizione al sistema di uno studente", "steps":"1 . Attiva il nuovo utente nel sistema. 2. Visualizza l'elenco delle iscrizioni ancora da attivare", "dataset": "SMOS"}
{"index": 46, "ucName": "RifiutaIscrizioneStudente", "uctext": "Consente all'amministratore di rifiutare l'iscrizione al sistema di uno studente", "steps":"1. Elimina la richiesta di iscrizione al sistema. 2. Visualizza l'elenco delle iscrizioni ancora da attivare", "dataset": "SMOS"}
{"index": 47, "ucName": "Ricerca Entita", "uctext": "Consente all'amministratore di ricercare nel sistema tutte le entità caratterizzate dalle keywords inserite", "steps":"1 . Visualizza l'elenco delle entità correlate alla keywords ricercate; in particolare vengono mostrate in una lista attiva: Classi, Insegnamenti, Indirizzi, Utenti trovati.", "dataset": "SMOS"}
{"index": 48, "ucName": "VisualizzaElencoClassi", "uctext": "Visualizzazione delle classi", "steps":"1. Il sistema mostra all'utente una schermata con tutte le classi presenti nel database, con un tasto per accedere al registro di ogni classe.", "dataset": "SMOS"}
{"index": 49, "ucName": "InserisciAssenze", "uctext": "Digitalizzazione del Registro, raccolta dati dal personale ATA classe per classe", "steps":"2. L'utente seleziona gli studenti assenti 3. Clicca su salva 1. Mostra all'utente una schermata con gli alunni e dei radio button per selezionare se un alunno è assente o presente. Di default l'alunno è presente. 4. Il sistema invia i dati al server. Il server per ogni assenza invia una e- mail di notifica al genitore dell'alunno.", "dataset": "SMOS"}
{"index": 50, "ucName": "InserisciRitardiAta", "uctext": "Digitalizzazione del Registro, raccolta dati dal personale ATA classe per classe", "steps":"2. L'utente seleziona i ritardi 3. L'utente clicca “Conferma” 1. Il sistema mostra all'utente una schermata con tutti gli alunni presenti, con a fianco una checkbox “ritardo”. Se selezionata si attivano dei campi di select a lato per selezionare l'ora del ritardo 4. Il sistema invia i dati al server.", "dataset": "SMOS"}
{"index": 51, "ucName": "VisualizzaElencoClassiDocente", "uctext": "Il presente caso d'uso consente ad un docente di visualizzare l'elenco delle classi in cui insegna", "steps":"2. Seleziona l'anno accademico di interesse. 1. Visualizza l'elenco degli anni accademici in cui è presente almeno una classe in cui il docente insegna. 3. Visualizza le classi associate all'anno scolastico selezionato.", "dataset": "SMOS"}
{"index": 52, "ucName": "VisualizzaRegistro", "uctext": "Visualizzazione del registro di classe", "steps":"1. Visualizza le informazioni relative al registro di classe ed in particolare:Data, Assenze, Note disciplinari, Ritardi e Giustifiche.", "dataset": "SMOS"}
{"index": 53, "ucName": "VisualizzazioneDiUnaPagellaDocente", "uctext": "Visualizzazione di una pagella", "steps":"2. Seleziona l'anno accademico di interesse. 4. Seleziona una delle classi visualizzate. 6. Seleziona l'alunno di cui visualizzare la pagella e il quadrimestre di riferimento cliccando sull'apposito pulsante. 1 . Visualizza l'elenco degli anni accademici in cui è presente almeno una classe in cui il docente insegna. 3. Visualizza le classi associate all'anno scolastico selezionato. 5. Visualizza l'elenco degli alunni della classe scelta dall'utente 7. Visualizza la pagella dell'alunno scelto riferita al quadrimestre specificato.", "dataset": "SMOS"}
{"index": 54, "ucName": "VisualizzazioneDiUnaPagellaStudente", "uctext": "Viene visualizzata la pagella dell’alunno che lo richiede", "steps":"2. Seleziona la pagella di interesse 1. Il sistema visualizza le pagelle dello studente loggato presenti in archivio 3. Visualizza i dettagli della pagella selezionata", "dataset": "SMOS"}
{"index": 55, "ucName": "NuovoUtente", "uctext": "Inserimento di un nuovo utente nel sistema", "steps":"2. Riempie i campi del form 3. Clicca sul pulsante “Salva” Sistema 1. Visualizza il form di inserimento degli utenti costituito dai seguenti campi: Nome, Cognome, e-mail, cell, login, password, conferma password. 4. Effettua dei controlli sulla validità dei dati immessi e inserisce il nuovo utente nell’archivio; nel caso in cui i dati inseriti non sono validi, attiva il caso d’uso “ErroreDati”", "dataset": "SMOS"}
{"index": 56, "ucName": "VisualizzaDatiScolasticiStudente", "uctext": "Visualizzazione delle informazioni scolastiche riguardanti l’ utente", "steps":"1. 2. Cerca nell’ archivio i dati relativi al registro della classe a cui appartiene lo studente Visualizza i dati relativi allo studente ed in particolare: Data, Assenze, Note disciplinari, Ritardi e Giustifiche.", "dataset": "SMOS"}
{"index": 57, "ucName": "VisualizzaDatiStudenti", "uctext": "Il presente caso d'uso consente ad un genitore di visualizzare le informazioni relative ai propri figli", "steps":"1. Visualizza una tabella riassuntiva con le informazioni relative ai figli ed in particolare:Data, Assenze, Note disciplinari, Ritardi e Giustifiche.", "dataset": "SMOS"}
{"index": 58, "ucName": "VisualizzazioneDiUnaPagella", "uctext": "Viene visualizzata la pagella dell’alunno richiesto", "steps":"2. Seleziona la pagella di interesse 1. Visualizza le pagelle dello studente selezionato 3. Visualizza i dettagli della pagella selezionata", "dataset": "SMOS"}
{"index": 59, "ucName": "EffettuaMonitoraggioStudenti", "uctext": "Consente di visualizzare gli studenti con un numero di note e assenze superiore ad una soglia indicata dall'utente", "steps":"1. Cerca gli studenti con un numero di assenze e note superiori alla soglia stabilita. 2. Visualizza le informazioni recuperate.", "dataset": "SMOS"}
{"index": 60, "ucName": "VisualizzaElencoRegistri", "uctext": "Visualizza l’elenco dei registri per un anno accademico", "steps":"2. Seleziona l’anno accademico 1.Mostra una schermata per la selezione dell’anno accademico di interesse. 3. Cerca nell’archivio tutti i registri digitali di quell’anno e li visualizza associati alla classe cui appartengono", "dataset": "SMOS"}
{"index": 61, "ucName": "VisualizzaRegistro", "uctext": "Dettagli relativi al registro di una classe", "steps":"1. Visualizza a video le informazioni contenute nel registro organizzate per data. In particolare mostra, per la data selezionata l’elenco degli alunni, specificando: assenti/presenti, entrate in ritardo ed un form dal quale è possibile gestire giustifiche e note disciplinari.", "dataset": "SMOS"}
{"index": 62, "ucName": "VisualizzazioneDiUnaPagella", "uctext": "Visualizzazione di una pagella", "steps":"1. Seleziona l’anno accademico 3 . Sceglie la classe dell'alunno di cui vuole visualizzare la pagella 5. Seleziona l'alunno di cui visualizzare la pagella e il quadrimestre di interesse cliccando sul relativo tasto 2. Visualizza l’elenco delle classi presenti nel sistema con accanto un pulsante “Pagelle” associato ad ogni classe 4. Visualizza l'elenco degli alunni della classe scelta dall'utente 6. Visualizza la pagella dell'alunno scelto riferita al semestre selezionato.", "dataset": "SMOS"}
{"index": 63, "ucName": "RegistrazioneAlSito", "uctext": "Consente ad uno studente di registrarsi al sistema", "steps":"2. Riempie i campi del form 3. Sottomette il form 1 . Visualizza il form di registrazione contenente: Nome, Cognome, Cellulare, e-mail, username, password, conferma password. 4. Inserisce la richiesta di iscrizione nel sistema", "dataset": "SMOS"}
{"index": 64, "ucName": "VisualizzaDettagliUtente", "uctext": "Visualizza i dettagli di un utente", "steps":"1. Visualizza le informazioni dettagliate dell’utente ed in particolare: Nome, Cognome, e-mail, cell, login, password.", "dataset": "SMOS"}
{"index": 65, "ucName": "ModificaUtente", "uctext": "Modifica di uno o più dati riguardanti un utente presente nel sistema", "steps":"1. Clicca sul pulsante “modifica” Sistema 2. Effettua dei controlli sulla validità dei dati immessi e modifica l’utente; nel caso in cui i dati inseriti non sono validi, attiva il caso d’uso “ErroreDati”", "dataset": "SMOS"}
{"index": 66, "ucName": "EliminaUtente", "uctext": "Elimina un utente dal sistema", "steps":"1. Elimina l’utente dall’archivio 2. Visualizza l’elenco degli utenti aggiornato", "dataset": "SMOS"}
