{"index": 0, "ucName": "Login", "uctext": "Allow a user to log in to the system", "steps": "1. Verify that username and password have length >=5. If the condition is met go to step two, otherwise notify the user of the error. Search the archive to see if the username and password entered by the user are among the loggable users 3. If the search is successful, the user is logged in to the system.", "dataset": "SMOS"}
{"index": 1, "ucName": "Assign/RemoveRolesToA User", "uctext": "Allows you to assign or remove roles to a user", "steps": "2. Select the roles to assign or remove to the user 3. Click the 'Submit' button System 1. Displays the role management form 4. Assigns or removes the user's roles as instructed by the Administrator", "dataset": "SMOS"}
{"index": 2, "ucName": "Assign/RemoveTeachingsToA Lecturer", "uctext": "Allows assigning or removing teachings to a lecturer", "steps": "2. Select the academic year 4. Select the desired class 6. Select the teachings to be associated with or removed from the teacher System 1. Displays the teaching management form for the teacher in question 3. Displays the list of available classes for the selected year 5. Displays the list of teachings associated with that class 7. Assigns or removes the teacher's teachings as directed by the Administrator.", "dataset": "SMOS"}
{"index": 3, "ucName": "Assign/RemoveStudentsToA Parent", "uctext": "Allows you to associate new students to a parent or remove previously entered associations", "steps": "2. Select the students to be assigned or removed to the parent 3. Click the 'Submit' button System 1. Displays the child management form for the parent in question 4. Assign/Remove students associated with a Parent", "dataset": "SMOS"}
{"index": 4, "ucName": "ViewListClasses", "uctext": "Allows you to view the list of classes", "steps": "2. Select the academic year of interest. System 1. Allows you to select the academic year whose class list you want to view. 3. Searches the classes in the archive and displays the class management screen 4. Displays the list of classes for the selected academic year.", "dataset": "SMOS"}
{"index": 5, "ucName": "InsertNewClass", "uctext": "Insert a new class into the archive", "steps": "2. Fill out the form 3. Click the 'Save' button System 1. The system shows the form to fill out with: name, address, academic year. It performs checks on the validity of the data entered and inserts the new class into the archive; in case the data entered is invalid, it activates the 'ErrorData' use case.", "dataset": "SMOS"}
{"index": 6, "ucName": "ViewClassDetails", "uctext": "Allows you to view the details of a class", "steps": "1. View the screen with the details of an individual class: name, address, school year.", "dataset": "SMOS"}
{"index": 7, "ucName": "DeleteClass", "uctext": "Delete a class from the archive", "steps": "1. Deletes the class from the archive 2. View updated class list", "dataset": "SMOS"}
{"index": 8, "ucName": "ViewListAddresses", "uctext": "Allows you to view the list of Addresses", "steps": "1. View list of addresses.", "dataset": "SMOS"}
{"index": 9, "ucName": "InsertNewAddress", "uctext": "Insert a new address into the archive", "steps": "2. Fill out the form 3. Click the 'Save' button System 1. The system shows the form to fill out with: address name. It performs checks on the validity of the entered data and inserts a new address into the archive; in case the entered data is invalid, it activates the use case 'ErrorData'.", "dataset": "SMOS"}
{"index": 10, "ucName": "ViewAddressDetails", "uctext": "Allows you to view the details of an address", "steps": "1. Displays the screen with the details of an individual address; specifically :address name.", "dataset": "SMOS"}
{"index": 11, "ucName": "LoginError", "uctext": "Occurs when user has entered incorrect authentication data.", "steps": "1. View login form", "dataset": "SMOS"}
{"index": 12, "ucName": "DeleteAddress", "uctext": "Delete an address from the archive", "steps": "1. Checks whether the address has associated classes; if so, displays an error message 'Unable to delete the address, delete associated classes and try again', otherwise deletes the address. 2. Displays updated address list.", "dataset": "SMOS"}
{"index": 13, "ucName": "AssignRemoveTeachings", "uctext": "Assign or remove one or more teachings from an address", "steps": "2. Select the teachings to be assigned or removed to the address 3. Click the 'Submit' button System 1. Displays a form from which you can add and/or remove teachings to the address. 4. Associate or remove the selected teachings to the address. 5. Return to the address details view.", "dataset": "SMOS"}
{"index": 14, "ucName": "ViewListInsignments", "uctext": "Allows viewing the list of teachings", "steps": "1. 2. Search the in the archive and screen of teachings View teachings view the management of the the list of", "dataset": "SMOS"}
{"index": 15, "ucName": "InsertNewTeaching", "uctext": "Insert new teaching into the archive", "steps": "2. Fill out the form 3. Click the 'Save' button System 1. The system shows the form to fill out with: teaching name. It performs checks on the validity of the data entered and inserts the new teaching into the archive; in case the data entered is invalid, it activates the use case 'ErrorData'.", "dataset": "SMOS"}
{"index": 16, "ucName": "ViewTeachingDetails", "uctext": "Allows you to view the details of a teaching", "steps": "1. View the screen with the details of an individual teaching.", "dataset": "SMOS"}
{"index": 17, "ucName": "EditTeaching", "uctext": "Edit details of a teaching", "steps": "1. Click on the 'Save' button 2. Perform checks on the validity of the entered data and edit the teaching in the archive; in case the entered data is invalid, activate the 'ErrorData' use case. 3. Displays the updated teaching list.", "dataset": "SMOS"}
{"index": 18, "ucName": "DeleteTeaching", "uctext": "Delete a teaching from the archive", "steps": "1. Delete teaching from the archive 2. View updated teaching list.", "dataset": "SMOS"}
{"index": 19, "ucName": "ViewListRegisters", "uctext": "View the list of records for an academic year", "steps": "2. Select school year 1. Display a screen for selecting the academic year of interest. 3. Search the archive for all digital records for that year and display them associated with the class to which they belong.", "dataset": "SMOS"}
{"index": 20, "ucName": "ViewSingleRegisterDetails", "uctext": "View the details of one of the class registers", "steps": "1. Displays on the screen the information contained in the register organized by date. In particular, it shows, for today's date, the list of pupils, specifying: absent/attending, late entries, and a form from which you can manage justifications and disciplinary notes.", "dataset": "SMOS"}
{"index": 21, "ucName": "InsertAbsencesAdmin", "uctext": "Digitization of Registry, data entry by Administrator", "steps": "2. Fill out the form by entering absent/present students and click 'Save' 1. Refresh the screen displayed by date 3. Send the data to the server. The server for each absence sends an e-mail notification to the student's parent. 4. View the updated register data.", "dataset": "SMOS"}
{"index": 22, "ucName": "Logout", "uctext": "Allows a user to log out of the system", "steps": "1. View login form", "dataset": "SMOS"}
{"index": 23, "ucName": "InsertDelayAdmin", "uctext": "Digitization of Registry, data entry by Administrator", "steps": "2. Fill out the form by entering students with delay and click 'Save' 1. Refresh the displayed screen by date 3. Submit the data to the server. 4. Display updated log data.", "dataset": "SMOS"}
{"index": 24, "ucName": "EditAbsence", "uctext": "Edit absence by Administrator. Editing is intended as inserting/deleting the absence.", "steps": "2. Edit the absence (Insert or Delete) and click 'Save' 1. Refresh the screen according to the selected date 3. Sends the changed data to the server. The system sends a correction e-mail to the parent of the student.", "dataset": "SMOS"}
{"index": 25, "ucName": "EditDelay", "uctext": "editing a delay by Administrator", "steps": "2. User edits the delay and clicks 'Save' 1. Updates the screen based on the selected date 3. The system sends the modified data to the server .", "dataset": "SMOS"}
{"index": 26, "ucName": "DeleteDelay", "uctext": "Deleting a late entry by the Administrator", "steps": "2. Delete a student's late entry and click 'Save' 1. Refresh the screen based on the selected date 3. Delete the late entry from the archive.", "dataset": "SMOS"}
{"index": 27, "ucName": "ViewExcusedList", "uctext": "ViewExcusedList", "steps": "1. Show all absences of the student recorded school selected Absences already excused are displayed in green, those to be excused in red during the year.", "dataset": "SMOS"}
{"index": 28, "ucName": "ViewListNotes", "uctext": "View list of notes inherent to the student", "steps": "1. Show all student notes recorded during the school year", "dataset": "SMOS"}
{"index": 29, "ucName": "InsertJustification", "uctext": "Insert Justification", "steps": "2. Fill out the form 3. Click 'Save' 1. Show a form in which to enter the justification fields (justification date). 4. Save the justification.", "dataset": "SMOS"}
{"index": 30, "ucName": "InsertNote", "uctext": "Insert Disciplinary Notes", "steps": "2. Fill out the form 3. Click 'Save' 1. Show a form with note fields (student, date, teacher , description). 4. Save the note and send an e-mail notification to the parent.", "dataset": "SMOS"}
{"index": 31, "ucName": "ViewJustificationDetails", "uctext": "View the details of a justification", "steps": "1. Show a form with the details of the justification and the ability to edit or delete the justification.", "dataset": "SMOS"}
{"index": 32, "ucName": "ViewNoteDetails", "uctext": "View the details of a note", "steps": "1. Show a form with note details: student, description, teacher, date.", "dataset": "SMOS"}
{"index": 33, "ucName": "ChangePassword", "uctext": "Allows a user to change their password", "steps": "2. Fill out the form and submit; System 1. Displays the form with the fields: old password, new password, confirm new password. 3. Confirms that the password has been changed.", "dataset": "SMOS"}
{"index": 34, "ucName": "EditJustification", "uctext": "Edit a Justification", "steps": "1. Edit one or more fields in the displayed form: date justification. Click 'Save' 3. Edit the justification.", "dataset": "SMOS"}
{"index": 35, "ucName": "EditNote", "uctext": "Editing a Disciplinary Note", "steps": "1. The user edits one or more fields in the displayed form: Student, description, teacher, date. 2. User clicks on 'Save' 3. The system saves the changes.", "dataset": "SMOS"}
{"index": 36, "ucName": "DeleteJustify", "uctext": "DeleteJustify", "steps": "1. Delete justification.", "dataset": "SMOS"}
{"index": 37, "ucName": "DeleteNote", "uctext": "Delete Disciplinary Notes", "steps": "1. The system sends a notification of errata to the student's parents, then deletes the note data from the archive.", "dataset": "SMOS"}
{"index": 38, "ucName": "PerformStudentMonitoring", "uctext": "Allows you to query the system about the number of absences and notes associated with students.", "steps": "1. Search the archive for students who have, for the current school year a number of absences and notes above a predetermined threshold. 2. Displays a screen presenting the data obtained.", "dataset": "SMOS"}
{"index": 39, "ucName": "ViewingOfA Report Card", "uctext": "ViewingA Report Card", "steps": "1. Selects the academic year 3. Chooses the class of the student whose report card you want to view 5. Selects the student and the quarter whose report card you want to view by clicking on the appropriate button. System 2. Displays the list of classes in the system with a 'Report Card' button associated with each class next to it 4. Displays the list of pupils in the class chosen by the user 6. Displays the report card of the chosen pupil referring to the selected term.", "dataset": "SMOS"}
{"index": 40, "ucName": "EnterPagella", "uctext": "Entering a student's report card performed by the Administrator", "steps": "2. Selects the class of the student whose report card is to be entered 4. Selects the student whose report card is to be entered by clicking on the appropriate button 6. Enters the report card grades, all or in part, and clicks the 'save' button System 1. Displays the list of classes in the system referring to the current academic year with a 'Report Card' button associated with each class next to it 3. Displays the list of pupils in the class chosen by the user 5. Displays the form for entering a report card 7. Inserts grades entered into the archive and returns the user to the class student view page.", "dataset": "SMOS"}
{"index": 41, "ucName": "EditOfAPage", "uctext": "Use case for editing a student's report card", "steps": "2. Enters the new data and clicks the confirmation button System 1. Displays the form with the fields that can be edited including the grades of different subjects 3. The system displays a confirmation message and displays the form with the list of pupils.", "dataset": "SMOS"}
{"index": 42, "ucName": "DeletionOfAPage", "uctext": "Administrator deletes a report card from the system", "steps": "2. The user accepts the deletion by pressing the confirmation key System 1. The system displays a form to confirm the deletion 3. Displays a message of successful deletion and displays the form with the class list.", "dataset": "SMOS"}
{"index": 43, "ucName": "ViewRequestsSubscription", "uctext": "Allows the administrator to view the list of enrollment requests arrived at the system", "steps": "1 . Displays the list of enrollments yet to be activated.", "dataset": "SMOS"}
{"index": 44, "ucName": "ViewListUsers", "uctext": "View the list of users in the system", "steps": "1. Search for users in the archive and display their list", "dataset": "SMOS"}
{"index": 45, "ucName": "AcceptStudentEnrollment", "uctext": "Allows the administrator to accept a student's enrollment in the system", "steps": "1 . Activates the new user in the system. 2. Displays the list of enrollments yet to be activated.", "dataset": "SMOS"}
{"index": 46, "ucName": "RejectStudentEnrollment", "uctext": "Allows the administrator to reject a student's enrollment in the system", "steps": "1. Deletes the system enrollment request. 2. Displays the list of enrollments yet to be activated.", "dataset": "SMOS"}
{"index": 47, "ucName": "Entity Search", "uctext": "Allows the administrator to search the system for all entities characterized by the keywords entered", "steps": "1 . Displays the list of entities related to the searched keywords; in particular, the following are shown in an active list: Classes, Teachings, Addresses, Users found.", "dataset": "SMOS"}
{"index": 48, "ucName": "ViewElencoClasses", "uctext": "View Classes", "steps": "1. The system shows the user a screen with all the classes in the database, with a button to access the record of each class.", "dataset": "SMOS"}
{"index": 49, "ucName": "EnterAbsences", "uctext": "Digitizing the Register, collecting data from ATA staff class by class", "steps": "2. User selects absent students 3. Clicks save 1. Shows user a screen with pupils and radio buttons to select whether a pupil is absent or present. By default the pupil is present. 4. The system sends the data to the server. The server for each absence sends an e- mail notification to the pupil's parent.", "dataset": "SMOS"}
{"index": 50, "ucName": "InsertDelayAta", "uctext": "Digitizing the Register, collecting data from ATA staff class by class", "steps": "2. User selects tardies 3. User clicks 'Confirm' 1. The system shows the user a screen with all pupils present, with a 'tardy' checkbox next to it. If selected, select fields are activated beside it to select the time of the delay 4. The system sends the data to the server.", "dataset": "SMOS"}
{"index": 51, "ucName": "ViewListClassesDoctor", "uctext": "This use case allows a teacher to view the list of classes in which he or she teaches.", "steps": "2. Select the academic year of interest. Displays the list of academic years in which there is at least one class in which the lecturer teaches 1. 3. Displays the classes associated with the selected academic year.", "dataset": "SMOS"}
{"index": 52, "ucName": "ViewRegister", "uctext": "View Class Register", "steps": "1. View information related to the class register and in particular:Date, Absences, Disciplinary Notes, Tardiness and Excuses.", "dataset": "SMOS"}
{"index": 53, "ucName": "DisplayOfAPagellaDoctor", "uctext": "Display of a report card", "steps": "2. Select the academic year of interest. 4. Select one of the displayed classes. 6. Select the student whose report card and the relevant quarter to view by clicking on the appropriate button. 1 . View the list of academic years in which there is at least one class in which the teacher teaches. 3. Displays the classes associated with the selected academic year. 5. Displays the list of pupils in the class chosen by the user 7. Displays the report card of the chosen pupil referring to the specified term.", "dataset": "SMOS"}
{"index": 54, "ucName": "DisplayOfAStudentPage", "uctext": "The report card of the requesting student is displayed", "steps": "2. Select the report card of interest 1. The system displays the logged-in student's report cards on file 3. Displays details of the selected report card.", "dataset": "SMOS"}
{"index": 55, "ucName": "NewUser", "uctext": "Enter a new user into the system", "steps": "2. Fill in the form fields 3. Click on the 'Save' button System 1. Displays the user entry form consisting of the following fields: First Name, Last Name, e-mail, cell, login, password, password confirmation. Performs checks on the validity of the entered data and enters the new user into the archive; in case the entered data is invalid, activate the use case 'ErrorData'", "dataset": "SMOS"}
{"index": 56, "ucName": "ViewSchoolStudentData", "uctext": "View school information about the 'user", "steps": "1. 2. Search the 'archive for data related to the record of the class to which the student belongs View data about the student and in particular: Date, Absences, Disciplinary Notes, Tardies and Excuses.", "dataset": "SMOS"}
{"index": 57, "ucName": "ViewStudentData", "uctext": "This use case allows a parent to view information about their children.", "steps": "1. View a summary table with information about their children and in particular:Date, Absences, Disciplinary Notes, Tardiness and Excuses.", "dataset": "SMOS"}
{"index": 58, "ucName": "DisplayOfAPage", "uctext": "The required student's report card is displayed", "steps": "2. Select the report card of interest 1. Displays the selected student's report cards 3. Displays details of the selected report card.", "dataset": "SMOS"}
{"index": 59, "ucName": "PerformStudentMonitoring", "uctext": "Displays students with a number of notes and absences above a user-specified threshold.", "steps": "1. Search for students with a number of absences and notes above a specified threshold. 2. Displays retrieved information.", "dataset": "SMOS"}
{"index": 60, "ucName": "ViewListRecords", "uctext": "View the list of records for an academic year", "steps": "2. Select academic year 1.Display a screen for selecting the academic year of interest. 3. Search the archive for all digital records for that year and display them associated with the class to which they belong.", "dataset": "SMOS"}
{"index": 61, "ucName": "ViewRegister", "uctext": "Details about a class register", "steps": "1. Displays on the screen the information contained in the register organized by date. In particular it shows, for the selected date the list of pupils, specifying: absent/present, late entries and a form from which you can manage justifications and disciplinary notes.", "dataset": "SMOS"}
{"index": 62, "ucName": "ViewingA Report Card", "uctext": "ViewingA Report Card", "steps": "1. Selects the academic year 3 . Selects the class of the student whose report card you want to view 5. Selects the student whose report card you want to view and the quarter of interest by clicking on the relevant button 2. Displays the list of classes in the system with a 'Report Card' button associated with each class next to it 4. Displays the list of pupils in the class chosen by the user 6. Displays the report card of the chosen pupil referring to the selected semester.", "dataset": "SMOS"}
{"index": 63, "ucName": "RegistrationAlSite", "uctext": "Allows a student to register with the system", "steps": "2. Fills in the form fields 3. Submits the form 1 . Displays the registration form containing: First name, Last name, Mobile phone, e-mail, username, password, password confirmation. 4. Enters the registration request into the system.", "dataset": "SMOS"}
{"index": 64, "ucName": "ViewUserDetails", "uctext": "View a user's details", "steps": "1. View the user's detailed information and in particular: First Name, Last Name, e-mail, cell, login, password.", "dataset": "SMOS"}
{"index": 65, "ucName": "EditUser", "uctext": "Edit one or more data regarding a user in the system", "steps": "1. Click on the 'edit' button System 2. Performs checks on the validity of the entered data and edits the user; in case the entered data is invalid, activate the use case 'ErrorData'", "dataset": "SMOS"}
{"index": 66, "ucName": "DeleteUser", "uctext": "Delete a user from the system", "steps": "1. Deletes the user from the archive 2. Displays the list of updated users or", "dataset": "SMOS"}
