{"index": 0, "ucName": " Register Customer\n \n", "uctext": "  \nRegister a new customer account with the system.  \n \n", "steps": " \n1. Customer first clicks on the button or link to initiate registration process.  \n2. System prompts the customer to fill out his/her first name, last name, billing address, shipping address, email address, and their password.\n3. Customer enters fields. \n4. System validates the customer's information.  \n5. System creates a new account for the Customer.  \n6. System creates a session cookie.  \n7. System displays an account home page to Customer.   \n \n", "dataset": "gamma j"}
{"index": 1, "ucName": " Login Customer\n \n", "uctext": " \nLogin to a customer account with the system.  \n \n", "steps": "\n \n1. Customer clicks on the button or link to initiate the login process.  \n2. System prompts the customer for his/her email and password.  \n3. System verifies the information.  \n4. System creates session cookie.  \n5. System displays account home page to the Customer \n \n", "dataset": "gamma j"}
{"index": 2, "ucName": " Edit Customer Details\n \n", "uctext": " \nEdit the customer account details.  \n \n", "steps": " \n1. Customer clicks the button or link to initiate the process to edit the account.  \n2. System displays the account home page to the Customer. \n3. Customer clicks the button or link in order to edit the account details.  \n4. System verifies the changes.  \n5. System stores new account information. \n \n", "dataset": "gamma j"}
{"index": 3, "ucName": " Logout Customer\n \n", "uctext": " \nLogout the customer account on the system.  \n \n", "steps": " \n1. Customer clicks the button or link in order to initiate logout process. \n2. System terminates the session cookie. \n3. System displays the home page.  \n \n", "dataset": "gamma j"}
{"index": 4, "ucName": " Add Item To Cart\n \n", "uctext": " \nCustomer adds item(s) in the cart \n \n", "steps": " \n1. Customer clicks the button or link in order to add to the cart with specified quantity. \n2. System adds the item(s) to the cart.  \n3. System prompts the Customer to edit the quantity or remove the item from cart.  \n4. Customer confirms the items in the cart.  \n5. System stores cookie with cart details. \n6. Customer returns to product listings.  \n \n", "dataset": "gamma j"}
{"index": 5, "ucName": " Checkout An Order\n \n", "uctext": " \nCustomer places and confirms an order for the checkout process.  \n \n", "steps": " \n1. Customer clicks the button or link to initiate the checkout process. \n2. System calculates order of items in the shopping cart.  \n3. System appends cookie with flag for checkout process.  \n4. System presents the customer with the account details and payment methods. \n5. Customer confirms account details and payment methods.  \n6. Customer confirms order.  \n7. System stores order confirmation and order details.  \n8. System sends email confirmation to the Customer.  \n9. System appends cookie with flag for completed checkout process.  \n \n", "dataset": "gamma j"}
{"index": 6, "ucName": " Login Administrator\n \n", "uctext": " \nLogin to an Administrator account with the system.  \n \n", "steps": "\n1. Administrator clicks button or link to initiate login process.  \n2. System prompts the Administrator for email and password.  \n3. System verifies information.  \n4. System creates session cookie.  \n5. System displays account home page to Administrator \n \n", "dataset": "gamma j"}
{"index": 7, "ucName": " Logout Administrator\n \n", "uctext": " \nLogout the Administrator account on the system.  \n \n", "steps": " \n1. Administrator clicks button or link to initiate logout process. \n2. System terminates the session cookie. \n3. System displays home page.  \n \n", "dataset": "gamma j"}
{"index": 8, "ucName": " Add User\n \n", "uctext": "  \nRegister a new customer, sales person, or administrator account with the system.  \n \n", "steps": " \n1. Administrator clicks the button or link to initiate Add user process.  \n2. System prompts the Administrator to fill out first name, last name, username, email address, password, and privileges of the user.\n3. System validates new user information.  \n4. System creates a new account for the new user with desired privileges.  \n5. System displays account home page to Administrator.   \n \n", "dataset": "gamma j"}
{"index": 9, "ucName": " Remove User\n \n", "uctext": "  \nRemove a user from the system. \n \n", "steps": " \n1. Administrator clicks button or link to initiate the remove user process.  \n2. System prompts the Administrator to select a user by searching or viewing a list of users.  \n3. System displays user information.  \n4. System confirms deletion of selected user.  \n5. System displays account home page to Administrator.   \n \n", "dataset": "gamma j"}
{"index": 10, "ucName": " Change User Properties\n \n", "uctext": "  \nAlter properties such as passwords and privileges of the user. \n \n", "steps": " \n1. Administrator clicks the button or link to initiate change user properties process.  \n2. System prompts the Administrator to select a user by searching or viewing a list of users.  \n3. System displays the user information.  \n4. System alters the user properties.  \n5. System displays the account home page to Administrator.   \n \n", "dataset": "gamma j"}
{"index": 11, "ucName": " Install Plug-ins\n \n", "uctext": "  \nInstall a new plug-in to the application.  \n \n", "steps": " \n1. Administrator clicks the button or link to initiate Plug-in installation process.  \n2. System prompts the Administrator to upload the Plug-in module.  \n3. System installs plug-in and validates changes.  \n4. System displays plug-in options to the Administrator.  \n   \n", "dataset": "gamma j"}
{"index": 12, "ucName": " Remove Plug-ins\n \n", "uctext": "  \nRemove a plug-in from the application.  \n \n", "steps": " \n1. Administrator clicks the button or link to initiate Plug-in deletion process.  \n2. System prompts the Administrator to select the desired Plug-in module.  \n3. System removes the plug-in and validates changes.  \n   \n", "dataset": "gamma j"}
{"index": 13, "ucName": " Manage Plug-in Options\n \n", "uctext": "  \nMake changes to an installed plug-in. \n  \n", "steps": " \n1. Administrator clicks the button or link to initiate Plug-in Options process.  \n2. System prompts the Administrator to select the desired Plug-in module.  \n3. System displays all plug-in options to the Administrator.  \n4. System confirms changes with the Administrator. \n   \n", "dataset": "gamma j"}
{"index": 14, "ucName": " Install patch process\n \n", "uctext": "  \nInstall patches or software updates to the web store. \n  \n", "steps": " \n1. Administrator clicks the button or link to initiate Patching process.  \n2. System prompts the Administrator to upload the patch.  \n3. System automatically installs patches and reinitializes software.  \n4. System confirms that patch has been successfully installed. \n   \n", "dataset": "gamma j"}
{"index": 15, "ucName": " Login Sales Person\n \n", "uctext": " \nLogin to an account with the system.  \n \n", "steps": " \n1. Sales Person clicks the button or link to initiate login process.  \n2. System prompts the Sales Person for email and password.  \n3. System verifies the information.  \n4. System creates session cookie.  \n5. System displays the account home page to Sales Person \n \n", "dataset": "gamma j"}
{"index": 16, "ucName": " Logout Sales Person\n GAMMA-J Web Store  \n35\n \n", "uctext": " \nLogout the Sales Person account on the system.  \n \n", "steps": " \n1. Sales Person clicks the button or link to initiate logout process. \n2. System terminates the session cookie. \n3. System displays home page.  \n \n", "dataset": "gamma j"}
{"index": 17, "ucName": " Add Product\n \n", "uctext": "  \nAdd a product to the system. \n \n", "steps": " \n1. Sales Person clicks the button or link to initiate Add Product process.  \n2. System prompts the Sales Person to fill out product name, product id, product description, product price, upload a product image, number of items in inventory, and availability of product.\n3. System validates the new product information.  \n4. System creates a new product page for the new product.  \n5. System displays the newly created product page.   \n \n", "dataset": "gamma j"}
{"index": 18, "ucName": " Remove Product\n \n \n", "uctext": "  \nRemove a product from the system. \n \n", "steps": " \n1. Sales Person clicks the button or link to initiate Remove Product process.  \n2. System prompts the Sales Person to select a product by searching or viewing a list of products.\n3. System validates the product information.  \n4. System removes the product page and product information from the system.  \n5. System displays the newly created product page.   \n \n", "dataset": "gamma j"}
{"index": 19, "ucName": " Update Product Attributes\n \n", "uctext": "  \nUpdate Product attributes within the system. \n \n", "steps": " \n1. Sales Person clicks the button or link to initiate Update Product Attributes process.  \n2. System prompts the Sales Person to select a product by searching or viewing a list of products.\n3. System displays all of the product attributes and allows Sales Person to update the product name, product id, product description, product price, update the product image, product availability, and/or the number of items in the inventory.\n4. System validates the product information.  \n5. System updates the product page and product information within the system.  \n6. System displays the newly updated product page.   \n\n", "dataset": "gamma j"}
{"index": 20, "ucName": " Register Customer\n \n", "uctext": "  \nRegister a new customer account with the system.  \n \n", "steps": " \n1. Customer clicks the button or link to initiate registration process.  \n2. System prompts the customer to fill out first name, last name, billing address, shipping address, email address, and password.\n3. Customer enters fields. \n4. System validates customer's information.  \n5. System creates a new account for the Customer.  \n6. System creates session cookie.  \n7. System displays account home page to Customer.   \n \n", "dataset": "gamma j"}
{"index": 21, "ucName": " Login Customer\n \n", "uctext": " \nLogin to a customer account with the system.  \n \n", "steps": " \n1. Customer clicks the button or link to initiate login process.\n2. System prompts the customer for email and password.  \n3. System verifies the information.  \n4. System creates session cookie.  \n5. System displays account home page to Customer \n \n", "dataset": "gamma j"}
{"index": 22, "ucName": " Edit Customer Details\n \n", "uctext": " \nEdit the customer account details.  \n \n", "steps": " \n1. Customer clicks button or link to initiate the process to edit the account.  \n2. System displays account home page to Customer. \n3. Customer clicks button or link to edit the account details.  \n4. System verifies the changes.  \n5. System stores new account information. \n \n", "dataset": "gamma j"}
{"index": 23, "ucName": " Logout Customer\n \n", "uctext": " \nLogout the customer account on the system.  \n \n", "steps": " \n1. Customer clicks button or link to initiate logout process. \n2. System terminates the session cookie. \n3. System displays home page.  \n \n", "dataset": "gamma j"}
{"index": 24, "ucName": " Add Item To Cart\n \n", "uctext": " \nCustomer adds item(s) in the cart \n \n", "steps": " \n1. Customer clicks the button or link to add  to the cart with specified quantity. \n2. System adds the item(s) to the cart.  \n3. System prompt Customer to edit quantity or remove item from cart.  \n4. Customer confirms items in cart.  \n5. System stores cookie with cart details. \n6. Customer returns to product listings.  \n \n", "dataset": "gamma j"}
{"index": 25, "ucName": " Checkout An Order\n \n \n", "uctext": " \nCustomer places and confirms an order for the checkout process.  \n \n", "steps": " \n1. Customer clicks the button or link to initiate the checkout process. \n2. System calculates order of items in the shopping cart.  \n3. System appends cookie with flag for checkout process.  \n4. System presents customer with account details and payment methods. \n5. Customer confirms account details and payment methods.  \n6. Customer confirms order.  \n7. System stores order confirmation and order details.  \n8. System sends email confirmation to the Customer.  \n9. System appends cookie with flag for completed checkout process.  \n \n", "dataset": "gamma j"}
{"index": 0, "ucName": " Modify Use Case  \n", "uctext": "  \nThe use case describes the modification  that the Inventory Admin  can do.  \n", "steps": "   \n1. Use case begins when Inventory Admin start searching for an asset  \n2. Inventory Admin Edit the asset  \n3. Inventory Admin modify asset properties  \n \n", "dataset": "0000 - inventory"}
{"index": 1, "ucName": " Edit Use Case  \n", "uctext": "  \nThe use case describes the edit operation  that the Inventory Admin  can do.  \n", "steps": "   \n1. Use case begins when Inventory Admin start searching for an asset  \n2. Inventory Admin Edit the asset  \n \n", "dataset": "0000 - inventory"}
{"index": 2, "ucName": " Add New Asset  Use Case  \n", "uctext": "  \nThe use case describes the operation of adding a new asset to the inventory .  \n", "steps": "   \n1. Use case begins when Administrator start a new asset  \n2. Administrator  select asset type \n3. Administrator  select asset location  \n4. Administrator  select owner \n5. Administrator  fill all asset properties  \n \n", "dataset": "0000 - inventory"}
{"index": 3, "ucName": " Create request  Use Case  \n", "uctext": "  \nThe use case describes the activity of creating a new request that the User  can do.  \n", "steps": "   \n1. User select basic request form  \n2. User type a small request text specifying asset(s) location,..  \n3. User click on submit  \n \n", "dataset": "0000 - inventory"}
{"index": 4, "ucName": " Returning Asset  \n", "uctext": "  \nThe use case describes the returning asset update  that the Inventory Admin  can do.  \n", "steps": "   \n1. Use case begins when Inventory Admin start returning  \n2. Inventory Admin select asset state to available  \n \n", "dataset": "0000 - inventory"}
{"index": 5, "ucName": " Approving Request  \n", "uctext": "  \nThe use case describes the approving of requests that an  Inventory Admin  can do.  \n", "steps": "   \n1. Use case begins when Inventory Admin display pending request list  \n2. System display only requests that he has privileges to approve  \n3. Inventory Admin select request that he want to approve  \n4. Approve is confirmed  \n5. System send notes to users  \n \n", "dataset": "0000 - inventory"}
{"index": 6, "ucName": " change permissions  Use Case\n", "uctext": "  \nThe use case describes the modification  that Department, Facutly or University Administrator can do to a user permissions .  \n", "steps": "   \n1. Use case begins when Administrator  press change permission  \n2. Administrator select user  \n3. Administrator modify permissions  \n \n", "dataset": "0000 - inventory"}
{"index": 7, "ucName": " Authentication Use Case   \n", "uctext": "  \nThe use case describes the authentication .  \n", "steps": "   \n1. Use case begins user starts the application  \n2. User write user name and pas sword  \n3. User press login  \n4. User is authenticated  \n5. User log on to application main page  \n \n", "dataset": "0000 - inventory"}
{"index": 8, "ucName": " Search\n", "uctext": "  \nThe use case describes the search operation  that only authorised users can do.  \n", "steps": "   \n1. Use case begins when User  start fill searching field \n2. Press submit  \n3. Search results are displayed  \n \n", "dataset": "0000 - inventory"}
{"index": 9, "ucName": " Create Reports  Use Case\n", "uctext": "  \nThe use case describes the creation of reports  that the User  can do.  \n", "steps": "   \n1. Use case begins when User  click on a report type  \n2. General report is displayed  \n3. Report can be filtered  \n4. Fields can be sorted  \n \n", "dataset": "0000 - inventory"}
{"index": 0, "ucName": " Parse\n\n", "uctext": " The user requests the parsing of a transformation language program or a target file. The file to be parsed and the parser file are inputs to HATS-SML. HATS-SML generates an SDT. The output is saved in the application.\n\n", "steps": "\n1. User selects the option to parse a transformation language program from currently open application \n(ALT 1). \n2. User selects a transformation language program file (.tlp) to parse (Refer to Use Case 4) (ALT 2). \n3. The HATS-GUI compares the time stamps on the lexical specification and grammar files to the time stamp on the application’s parser file. The parser file is the youngest of the three files (ALT 3, ALT 6).\n4. The HATS-GUI sends a message to the Host OS to start either the ParseTarget or the ParseProgram program and sends the names of the target file or program file, the output file, and the parser file to the Host OS.\n5. HATS-SML parses the input file (ALT 7) and writes the output to the output file. \n6. End of use case. \n\n", "dataset": "hats"}
{"index": 1, "ucName": " Execute Transformation Program\n\n", "uctext": "  The user requests the application of a transformation language program to a target file. HATS-SML applies the transformation language program to the target.  Actors:  User, HATS-SML, Host OS\n\n", "steps": "\n1. User selects the option to execute a transformation language program from the currently selected application.\n2. User selects a transformation language program file (Refer to Use Case 4) (ALT 1). \n3. The HATS-GUI compares the time stamp on the lexical specification and grammar files to the time stamp on the parser file. The parser file is younger (ALT 2, ALT 3).\n4. The HATS-GUI compares the time stamp of the parsed program file and the parser, the transformation language program, and the user-defined library files. The parsed program file is younger than any of these files (ALT 4, ALT 5).\n5. The HATS-GUI clears the displays for the standard error and standard output. \n6. The HATS-GUI sends a message to the Host OS to start the ApplyTransformations  program and sends the names of the parsed program file and the user-defined library file to the Host OS. The HATS-GUI redirects the standard error and standard output streams of the ApplyTransformation  process and collects data written to these streams for later display.\n7. The HATS-SML ApplyTransformation  program writes output SDTs to files named in the transformation language program. (The transformation language program contains all references to input and output files. The HATS-GUI does not handle file input and file output for ApplyTransformaion .)\n8. End of use case. \n\n", "dataset": "hats"}
{"index": 2, "ucName": " Select Application\n\n", "uctext": "  The user selects an application.\n\n", "steps": "\n1. System requests from Host OS a list of existing applications within current directory. \n2. Host OS returns list of files within current directory.\n3. System displays list of existing applications within current directory (ALT 1, ALT 2).\n4. User selects an application within the list (ALT 2).\n5. System sets selected application as the current application.   \n6. End of use case.\n\n", "dataset": "hats"}
{"index": 3, "ucName": " Select File\n\n", "uctext": "  The user wants to perform some operation, and the system requests a filename.  A list of file names in the currently selected application is presented.  The user selects one file name in the application. Actors: User, Host OS\n\n", "steps": "\n1. System requests from Host OS a list of files in the current directory. \n2. Host OS only returns list of files in the current directory. \n3. System displays this list of files (ALT 1, ALT 2).\n4. User selects a file within the list (ALT 2, ALT 3).\n5. System sets selected file as the current file.\n6. End of use case.\n\n", "dataset": "hats"}
{"index": 4, "ucName": " Close Application\n\n", "uctext": "  The user wants to perform some operation on a selected application.  These operations include open, close, save, save as, create new, edit files within application, and configure the application.\n\n", "steps": "\n1. User selects option to close the currently selected application\n2. System asks for confirmation from user to close application.\n3. User confirms to close application (ALT 1).\n4. System checks that the changes to currently selected application’s configuration have been saved (ALT 2).\n5. System sets currently selected application to ‘none’.\n6. End of use case.\n\n", "dataset": "hats"}
{"index": 5, "ucName": " Save Application\n\n", "uctext": " None\n\n", "steps": "\n1. User selects option to save currently selected application.\n2. System requests Host OS to save configuration file for the selected application. \n3. Host OS saves the configuration file for the selected application into a non-volatile storage (ALT 1).\n4. System informs user that application has been saved.\n5. End of use case. Software Requirements Specification\n \n", "dataset": "hats"}
{"index": 6, "ucName": " Save Application As\n", "uctext": " None\n\n", "steps": "\n1. User selects to save a currently open application using a different directory name. 2. System requests user for a name to save the open application.\n3. User enters or selects a name for the application to be saved (ALT 1). \n4. System confirms that application name is unique (ALT 2).\n5. System requests Host OS to create new directory with the given name.\n6. Host OS creates new application with the entered name (ALT 3).\n7. System requests Host OS to copy core files, configuration files, and .tlp files to the new directory.\n8. Host OS copies all files from selected application to created application (ALT 3).\n9. System informs user that application has been saved with entered name. \n10. End of use case.\n\n", "dataset": "hats"}
{"index": 7, "ucName": " Edit Files in an Application\n\n", "uctext": " None\n\n", "steps": "\n1. User selects option to edit a file within the currently selected application.\n2. User selects file to edit (Use Case 4).\n3. System checks application to determine if editor is associated with this file. An editor is associated with the file if the configuration explicitly associates this file with an editor or an editor is associated with files of this type. An editor is associated with this file (ALT 1).\n4. The HATS-GUI sends message to Host OS to start the preferred editor in new process and passes file name to editor.\n5. Host OS initiates process, puts editor in process, sends the filename as argument.\n6. End of use case.\n\n", "dataset": "hats"}
{"index": 8, "ucName": " Create New Application\n\n", "uctext": " None\n\n", "steps": "\n1. User selects option to create a new application.\n2. Close existing application if one is selected  (Refer to Use Case 5 – Scenario 1).\n3. System asks user to enter a name and location for new application.\n4. User enters name and location for new application (ALT 1).\n5. System requests Host OS to create new application. \n6. Host OS creates new application  (ALT 2).\n7. System informs user that new application has been created.\n8. End of use case.\n\n", "dataset": "hats"}
{"index": 9, "ucName": "  Configure Editor List.\n\n", "uctext": "  The user selects an application.  The user configures the settings of the selected application.  The settings of an application include, available editors, SDT display colors, SDT display shapes, default number of levels to expand, file associations between files and editors, and file associations between target files and transformation language program.\n\n", "steps": "\n1. User selects option to configure editors.\n2. The system prompts for editor name and configuration information. Editor configuration information must be sufficient to start the editor on the Host OS.\n3. User enters editor name and parameters (ALT 1). \n4. System saves editor configuration in application configuration. \n5. End of use case. \n\n", "dataset": "hats"}
{"index": 10, "ucName": " Configure SDT display.\n\n", "uctext": " None\n\n", "steps": "\n1. User selects option to configure the colors and shapes of the graphical representation of an SDT. \n2. System displays a list containing types of displayed nodes and their corresponding current configured colors. The types of displayed nodes are given in Table 4.\n3. User selects a type of node from list. (ALT 1). \n4. System displays a list of supported colors and shapes. \n5. User selects a color and a shape from the list for the selected type of displayed node (ALT 2).\n6. System sets the selected values as the color and shape for the type of displayed node selected.\n7. End of use case.\n\n", "dataset": "hats"}
{"index": 11, "ucName": "  Configure Expand Levels.\n\n", "uctext": " None\n\n", "steps": "\n1. User selects option to configure the default number of levels to expand in response to a single mouse click.\n2. System asks user to select or enter a number of levels to expand.\n3. User enters or selects a number of levels to expand.   Number entered is a natural number.\n4. System sets the entered or selected number of levels as the default number of levels to expand.\n5. End of use case.\n\n", "dataset": "hats"}
{"index": 12, "ucName": "  File Associations:  Editors.\n\n", "uctext": " None\n\n", "steps": "\n1. User selects option to associate file types with editors (ALT 1). \n2. System displays a list of configured editors. (Refer to Use Case 6.)\n3. System displays a list of file types.\n4. User selects a file type from list  (ALT 2). \n5. User selects an editor from list (ALT 2).\n6. System associates the selected file type with the selected editor.  When the user tries to edit a file of the type selected, the system will request the Host OS to initiate a process with the associated editor.  (Refer to Use Case 5.)\n7. End of use case. \n\n", "dataset": "hats"}
{"index": 13, "ucName": " Save Configuration\n\n", "uctext": " None\n\n", "steps": "\n1. User selects option to save configuration. \n2. System saves configuration with the application.\n3. End of use case.\n\n", "dataset": "hats"}
{"index": 14, "ucName": "  SDT Display.\n\n", "uctext": " The user wants to display and manipulate a graphical representation of an SDT. Manipulation of a graphical representation of an SDT includes selecting and unselecting displayed nodes, navigation through the display using a navigation window and scrolling, expanding and collapsing displayed nodes, hiding displayed nodes, searching for SDT sub-trees, and finding smallest well-formed trees.\n\n", "steps": "\n1. User selects option to view and manipulate a graphical representation of an SDT. \n2. User selects SDT to view and manipulate (Refer to Use Case 4).  \n3. System displays a graphical representation of the selected SDT in an on-screen work area. The work area of the SDT display contains the following elements:\na) A window that displays the displayed graph representation of the SDT.  b) A text window that displays the labels of the leaf nodes in the currently displayed graph.   c) If either window is too small to contain all the information to be presented, the windows will have scroll bars to facilitate scrolling. The system will respond to dragging of scroll buttons\n(or pressing arrow keys) by shifting the display in the appropriate direction.\nd) If the SDT is too large for the window, a separate, small window with a compressed view of the SDT will be displayed. In this window, a displayed graph of the entire SDT will be drawn. The nodes of this displayed graph will be smaller than the displayed nodes in the SDT display work area. It is not necessary that the user be able to read node labels. It is only necessary that the user be able to see the high-level structure of the SDT. A small box named the locator box  will be displayed showing the part of the SDT currently displayed in the main SDT display window.\n4. User is able to manipulate the displayed graph representation of the SDT. (See the remaining scenarios.)\n\n", "dataset": "hats"}
{"index": 15, "ucName": "  Select nodes.\n\n", "uctext": " None\n\n", "steps": "\n1. User selects one or more displayed nodes. Displayed node selection methods are described here. \n• A single node can be selected by a right mouse click on the node. \n• A single node can be selected via the keyboard by moving the keyboard cursor to a node and pressing the enter  key. The keyboard cursor is moved between nodes using the tab key.\n• Several nodes can be selected by drawing a mouse box around the desired nodes. \n• Several nodes can be selected by holding the shift key down and selecting individual displayed nodes. When a user selects a set of nodes using these operations (and the shift key is not held down), the previously selected set of nodes (if any) is unselected.\n2. System highlights the smallest well-formed tree of the selected nodes in the displayed graph.\n3. System finds corresponding portion of leaf text of the selected nodes in the displayed graph.\n4. System highlights the corresponding portion of leaf text. \n5. If both SDT and Pretty-printed text are displayed, the system will find the corresponding pretty-printed text and highlight that text in the Pretty-print text window.\n6. End of use case.\n\n", "dataset": "hats"}
{"index": 16, "ucName": "  Navigation window navigation.\n\n", "uctext": " None\n\n", "steps": "\n1. The user clicks the mouse in the navigation window SDT display. \n2. The system determines the node in the displayed graph closest to the mouse cursor and redraws the displayed graph with this node in the center of the main display.\n3. The system updates the locator box in the navigation window display.\n4. End of use case.\n\n", "dataset": "hats"}
{"index": 17, "ucName": "  Expand\n\n", "uctext": " None\n\n", "steps": "\n1. User points the mouse cursor at a node and clicks the left mouse button (ALT 1).\n2. System displays the tree by expanding descendants of the node in the displayed graph. The number of levels to expand is given by the application configuration. If fewer than this number of levels exist, then all descendants of the chosen node are displayed\n3. System changes the shape and color of selected node as specified in the application configuration to indicate that it has become an expanded node.\n4. End of use case.\n\n", "dataset": "hats"}
{"index": 18, "ucName": "  Collapse\n\n", "uctext": " None\n\n", "steps": "\n1. User points the mouse cursor at a node and clicks the left mouse button. \n2. System removes all descendants of the selected node from the displayed graph.\n3. System changes the shape and color of selected node as specified in the application configuration to indicate that it has become a collapsed node.\n4. End of use case.\n\n", "dataset": "hats"}
{"index": 19, "ucName": "  Hide nodes\n\n", "uctext": " None\n\n", "steps": "\n1. User selects one or more displayed nodes. (Refer to Use Case 7.) \n2. User selects option to hide selected displayed nodes. \n3. System removes the selected nodes from the displayed graph. \n4. System changes the types of the displayed nodes remaining on the screen to indicate that there are hidden nodes in the displayed graph.\n5. End of use case.\n\n", "dataset": "hats"}
{"index": 20, "ucName": " Search\n\n", "uctext": " None\n\n", "steps": "\n1. User selects option to search SDT for a desired sub-tree. \n2. System asks user for the criteria to search nodes. Search criteria for SDTs are presented in Appendix E.\n3. User enters search criteria.\n4. System finds the first matching sub-tree in the SDT starting at the current keyboard cursor location (ALT 1).\n5. System creates a displayed graph for the sub-tree matching the search criteria. The displayed nodes of the matching sub-tree are highlighted. If no nodes match the search criteria, none are highlighted.\n6. If both SDT and Pretty-printed text are displayed, the pretty-printed text corresponding to the highlighted nodes of the SDT is highlighted.\n7. End of use case.\n\n", "dataset": "hats"}
{"index": 21, "ucName": "  Repeat Search\n\n", "uctext": " None\n\n", "steps": "\n1. User selects option to repeat a search SDT for a desired sub-tree. \n2. System finds the next matching sub-tree in the SDT starting at the current keyboard cursor location. Software Requirements Specification   \n3. System creates a displayed graph for the sub-tree matching the search criteria. The displayed nodes of the matching sub-tree are highlighted. If no nodes match the search criteria, none are highlighted.\n4. If both SDT and Pretty-printed text are displayed, the pretty-printed text corresponding to the highlighted nodes of the SDT is highlighted.\n5. End of use case.\n\n", "dataset": "hats"}
{"index": 22, "ucName": "  Copy Text From Text Window.\n\n", "uctext": " None\n\n", "steps": "\n1. System displays text of leaf nodes in currently displayed graph in a text window.    \n2. User selects a portion of displayed text. \n3. System highlights selected portion of text in the text window. \n4. User selects option to copy selected text. Minimally, the system will copy selected text in response to the Ctrl-Insert  key combination.\n5. System puts the selected and copied text in the Host OS copy/paste buffer.\n6. End of use case.\n\n", "dataset": "hats"}
{"index": 23, "ucName": "  Refresh Display.\n\n", "uctext": " None\n\n", "steps": "\n1. The user selects the option to refresh the display of the SDT.\n2. The system disposes of the currently displayed SDT.\n3. The system reads the SDT file and displays the newly generated SDT. The display of the SDT contains approximately the same number of nodes as the previously displayed SDT.\n4. End of use case.\n\n", "dataset": "hats"}
{"index": 24, "ucName": "  Display Pretty-Printed Text\n\n", "uctext": " The user wants to display and manipulate a text representation of the result of applying a transformation language program to a target file.  Manipulation of text includes selecting text and searching for sub-strings.\n\n", "steps": "\n1. User selects option to view and manipulate a pretty-printed text from a particular successful \ntransformation. \n2. User selects pretty-printed text to view and manipulate. (Refer to Use Case 4.)\n3. System displays the pretty-printed text in a work window.\na) The work area of the display of pretty-printed text contains a text window that displays the text.\nb) If the window is too small to contain all the information to be presented, the windows will have scroll bars to facilitate scrolling. The system will respond to dragging of scroll buttons (or pressing arrow keys) by shifting the display in the appropriate direction.\n4. User is able to manipulate the pretty-printed text. (See the remainder of the scenarios.)\n5. End of use case.\n\n", "dataset": "hats"}
{"index": 25, "ucName": "  Select text.\n\n", "uctext": " None\n\n", "steps": "\n1. User selects a portion of the displayed pretty-printed text. Text selection methods are described here. \n• Text can be selected by clicking and dragging the mouse across an area of text. \n• Text can be selected by holding the shift key and moving the keyboard cursor using the arrow keys.\nWhen a user selects text using these operations, the previously selected text (if any) is unselected. \n2. System highlights selected portion of the displayed pretty-printed text.\n3. If both pretty-printed text and graphical representation of SDT are displayed, the system finds the corresponding displayed nodes of the SDT of the selected portion of pretty-printed text and highlights the corresponding displayed nodes of the SDT.\n4. End of use case.\n\n", "dataset": "hats"}
{"index": 26, "ucName": "  Search\n", "uctext": " None\n\n", "steps": "\n1. User selects option to search pretty-printed text for desired text. \n2. System asks user for the criteria to search text. Text search criteria are given in Appendix F. 3. User enters or selects criteria to search text. \n4. System finds those portions of pretty-printed text that match the search criteria and highlights those portions of the text that match (ALT 1).\n5. If both the pretty-printed text and the graphical representation of an SDT are displayed, the system finds the corresponding nodes of the SDT of the selected portion of pretty-printed text and highlights the corresponding nodes of the SDT.\n6. End of use case.\n\n", "dataset": "hats"}
{"index": 27, "ucName": " Generate Pretty-printed Output\n\n", "uctext": " The user requests the application of a pretty-print style file to a target SDT. The necessary file names are passed to HATS-SML, HATS-SML applies the pretty-print style to the SDT, and a formatted text file is generated.\n\n", "steps": "\n1. User selects the option to pretty-print a target from the currently selected application. \n2. User selects a target SDT (Refer to Use Case 4) (ALT 1). 3. No pretty-print style file is associated with the target file. The HATS-GUI prompts the user to select a pretty-print style file.\n4. User selects a pretty-print style file (Refer to Use Case 4) (ALT 2). \n5. HATS-GUI generates a file name by appending “.txt” to the target SDT root name. \n6. The HATS-GUI verifies that no file with this name exists in the current directory. This file becomes the output file name (ALT 3).\n7. The HATS-GUI sends a message to the Host OS to start the Pretty-print program and sends the target SDT file name, the pretty-print style file name, and the output file name to Pretty-print as command line arguments.\n8. HATS-SML applies the style file to the target SDT and writes the output to the output file specified on the command line (ALT 6).\n9. HATS-SML terminates.\n10. End of use case.\n\n", "dataset": "hats"}
{"index": 0, "ucName": " Start and Stop Diagnostics Use Case", "uctext": "  \nThis use case provides the actor the means to start and stop diagnostic processing.  The actor in this case is the administrator user (see 2.5.1 ).\n", "steps": "\n1. The user launches the tool by double -clicking the icon associate d with the tool or typing the application’s name.\n2. The tool momentarily displays a splash screen identifying the tool, identifying developing and sponsoring organizations as appropriate, and listing copyright information.\n3. The tool displays the main window o f the tool.  \n4. The user starts the diagnostic processing by selecting a menu item named “Start Diagnostics” from a drop down menu named “Status”.\n5. Include (Authenticate User).  If the user has the appropriate privilege (i.e., the user is the administrator user) the tool requests a confirmatory response from the user to start the diagnostic processing.\n6. If the user confirms the desire to start diagnostic processing, the tool starts the processing and displays an animated indication that diagnostic processing is active.\n7. If the user responds negatively to the confirmation, the tool does not start the diagnostic processing but the user remains authenticated.\n8. If the user does not have the appropriate privilege, the tool does not start the diagnostic processing.\n9. The u ser secures the tool by selecting a menu item named “Logout” from the drop down menu named “File”.\n10. The tool returns the current user’s privileges to those of the general user.\n11. If a period of 15 minutes elapses whereby the user does not secure the tool, the  users privileges will automatically revert to those of a general user.\n", "dataset": "pnnl"}
{"index": 1, "ucName": " Browse Current Diagnostics  Use Case", "uctext": "  \nThis use case provides the actor the means to view current diagnostic results.  The actor in this case is the user (see 2.5.1 ).\n", "steps": "\n1. The tool displays the main (initial) window, listing buildings under diagnosis.\n2. The user selects a building of interest.  \n3. The tool displays the su bsystems window, tiled on top the main (initial) window.\n4. The user selects a subsystem of interest.  \n5. The tool displays the condition window, tiled on top the subsystems window.\n6. The user selects a diagnostic of interest.  \n7. The tool displays the diagnostic infor mation window for that diagnostic.\n", "dataset": "pnnl"}
{"index": 2, "ucName": " Browse Historical Diagnostics Use Case", "uctext": "  \nThis use case provides the actor the means to view historical  diagnostic results.  The actor in this case is the user (see 2.5.1 ).\n", "steps": "\n1. The user clicks the “History” button.  \n2. The tool displays the diagnostic history window depicting the historical results of the selected condition of interest over the default viewing period in the form  of a color map.  The window provides a scroll bar for scrolling through historical results if data are available prior to the default viewing period.  The default viewing period extends backward one week prior to the current date.  Sliding the scroll bar does not change the viewing period displayed.  The default time resolution for the window is one hour.\n3. The user slides the scroll bar backward or forward to view previous results up to the current time.\n4. The tool displays the results within a viewing period  of one week, adding results to the beginning or ending of the period while dropping results of the opposite end.  The tool does not change the viewing period.\n5. The user may close the diagnostic history window by clicking the “Close” button.\n6. The tool dismis ses the diagnostic history window and the diagnostic information window and makes the condition window the current window.\n", "dataset": "pnnl"}
{"index": 3, "ucName": " Configure Diagnostics Use Case", "uctext": "  \nThis use case provides the actor the means to configure the diagnostic tool.  This includes defining the buildings containing systems to be diagnosed, defining the systems themselves, specifying equipment setpoints, selecting diagnostic sensitivity, and modif ying fixed data.  The actor in this case is the administrator user (see 2.5.1 ).\n", "steps": "\n1. When presented with the main window, the user may select the “Configure Diagnostics” menu item from the menu entitled “File”.\n2. If the user has not already been authenticated as the administrator user, include (Authenticate User).\n3. If the user has the appropriate privilege, the tool displays the configuration window.\n4. The user may click the “Recall” button to read previously saved changes from a disk file or database.\n5. The tool populates the window with the data from t he disk file.\n6. The user makes the desired changes to the configuration and can click the button labeled “Save” to save the changes.  Otherwise, the user can click the button labeled “Close”.\n7. If the user clicks the button labeled “Save”, the tool will request confirmation to save the changes.\n8. If the user confirms, the tool will request a name for the disk file in which to save the modified data to permanent storage.\n9. The user will enter a name for the file or cancel the operation.\n10. If the user enters a name for  the file, the tool will save the changes.  If the user cancels the operation, the tool will perform no function.\n11. If the tool completes the save operation, the tool will ask the user if the changes are to be relayed to the diagnostic processing for immediate use.\n12. If the user confirms the changes are to be relayed to the diagnostic processing, the tool relays the changes if the processing is currently active.  Otherwise, the tool does not relay the changes.\n13. If the user clicks the button labeled “Close”, the tool will request confirmation for the close and the potential loss of any changes.\n14. If the user confirms, the tool will dismiss the configuration window, ignoring any changes and returns the user to the main window.  If the user rejects the initial desire to close, the tool will perform no function.\n", "dataset": "pnnl"}
{"index": 4, "ucName": " Authenticate User", "uctext": "  \nThis use case establishes the privileges of the user for certain functions of the tool.    \n", "steps": "  \n1. The tool displays a windo w for entry of authenticating information, i.e., user name and password, to validate and establish the privileges of the user.\n2. The user enters their user name and password.  \n3. The tool attempts to authenticate the user and indicates whether authentication has  succeeded or not.\n4. If authentication is unsuccessful, the user is returned to the authentication window to reenter the information.\n5. The tool permits three attempts at authentication before dismissing the authentication window and returning the user to the previous window.\n6. The user may cancel the authentication process at any time and return to the previous window.\n", "dataset": "pnnl"}
{"index": 0, "ucName": "\nManage  Requests \n", "uctext": " The main requests management page that coordinator will manage all  request from customer or to suppliers\n", "steps": "\n 1 The coordinator press “Manage  Requests”\n 2 The coordinator use any function.\n 3 The coordinator will manage all requests function. \n", "dataset": "viper"}
{"index": 1, "ucName": "\nAdd Request\n", "uctext": " Coordinator can add new request  and send it to his supplier\n", "steps": "\n 1 The coordinator press “Add Request”\n 2 The coordinator fills the request form.\n 3 The coordinator will send the request to supplier \n", "dataset": "viper"}
{"index": 2, "ucName": "\nView Requests\n", "uctext": " Coordinator issues requests , coordinator can show all  requests that sent his supplier or that came from his customer\n", "steps": "\n 1 The coordinator press “View Requests”\n 2 The coordinator view list of requests.\n", "dataset": "viper"}
{"index": 3, "ucName": "\nView Request Details\n", "uctext": " Coordinator can show the details of any request that he chose.\n", "steps": "\n 1 The coordinator press “View Request Details”\n 2 The coordinator views the details of a request.\n", "dataset": "viper"}
{"index": 4, "ucName": "\nEdit Request\n", "uctext": " The Coordinator can edit  request and notify his supplier\n", "steps": "\n 1 The coordinator press “Edit Request”\n 2 The coordinator modifies the request information.\n 3 The coordinator will send a notification to supplier \n", "dataset": "viper"}
{"index": 5, "ucName": "\nDelete Request\n", "uctext": " The Coordinator can delete  request and notify his supplier\n", "steps": "\n 1 The coordinator press “Delete Request”\n 2 The information about the request will show.\n 3 Press “Delete” to processing the deleting\n 4 The coordinator will send a notification to supplier\n", "dataset": "viper"}
{"index": 6, "ucName": "\nManage Items \n", "uctext": " The main items management page that coordinator will manage the items that he have and may supply to customer\n", "steps": "\n 1 The coordinator press “Manage Items”\n 2 The coordinator use any function.\n 3 The coordinator will manage all items function. \n", "dataset": "viper"}
{"index": 7, "ucName": "\nAdd Item\n", "uctext": " Coordinator can add new items  and may supply it to our customer \n", "steps": "\n 1 The coordinator press “Add Item”\n 2 The coordinator fills the item form.\n 3 The coordinator will save the item.\n", "dataset": "viper"}
{"index": 8, "ucName": "\nView Items\n", "uctext": " The coordinator can view all  items that he have ,that may receive from supplier and may supply it for his customers\n", "steps": "\n 1 The coordinator press “View Items”\n 2 The coordinator view list of Items\n", "dataset": "viper"}
{"index": 9, "ucName": "\nView Item Details\n", "uctext": " Coordinator can show the details of any items that he chooses.\n", "steps": "\n 1 The coordinator press “View Item Details”\n 2 The coordinator views the details of an item.\n", "dataset": "viper"}
{"index": 10, "ucName": "\nEdit Item.\n", "uctext": " The Coordinator can edit item that he want.\n", "steps": "\n 1 The coordinator press “Edit Item”\n 2 The coordinator modifies the item information.\n 3 The coordinator will send a notification to supplier or customer if need. \n", "dataset": "viper"}
{"index": 11, "ucName": "\nDelete Item\n", "uctext": " The Coordinator can delete any item from his list and his supply.\n", "steps": "\n 1 The coordinator press “Delete Item”\n 2 The information about the item will show.\n 3 Press “Delete” to processing the deleting\n", "dataset": "viper"}
{"index": 12, "ucName": "\nManage Resources Locations\n", "uctext": " The main resources locations management page that coordinator will manage the resources locations that he have and may use it to store or supplying.\n", "steps": "\n 1 The coordinator press “Manage Resources Locations”\n 2 The coordinator use any function.\n 3 The coordinator will manage all resources locations function. \n", "dataset": "viper"}
{"index": 13, "ucName": "\nAdd Location\n", "uctext": " Coordinator can add new resources locations and may start to use it in our supply and storing.\n", "steps": "\n 1 The coordinator press “Add Location”\n 2 The coordinator fills the location form.\n 3 The coordinator will save the location.\n", "dataset": "viper"}
{"index": 14, "ucName": "\nView Locations\n", "uctext": " The coordinator can view all resources locations that he have, that use to supplying our customer and store our items.\n", "steps": "\n 1 The coordinator press “View Locations”.\n 2 The coordinator view list of Locations.\n", "dataset": "viper"}
{"index": 15, "ucName": "\nView Location Details\n", "uctext": " Coordinator can show the details of resource location that he chooses.\n", "steps": "\n 1 The coordinator press “View Location Details”\n 2 The coordinator views the details of a location.\n", "dataset": "viper"}
{"index": 16, "ucName": "\nEdit Location.\n", "uctext": " The Coordinator can edit a location that he wants.\n", "steps": "\n 1 The coordinator press “Edit Location”\n 2 The coordinator modifies the location information.\n", "dataset": "viper"}
{"index": 17, "ucName": "\nDelete Location\n", "uctext": " The Coordinator can delete any location from his list.\n", "steps": "\n 1 The coordinator press “Delete Location”\n 2 The information about the location will show.\n 3 Press “Delete” to processing the deleting\n", "dataset": "viper"}
{"index": 18, "ucName": "\nEdit Profile\n", "uctext": " The supplier can edit his profile. The profile contains the name of the supplier, the address, contact person and e-mail… etc.\n", "steps": "\n 1 He clicks on the proper link to edit his profile.\n 2 Whether he make changes or not, when he clicks on the proper link to submit the profile values, the current values of the profile is saved and he is returned to the main menu.\n", "dataset": "viper"}
{"index": 19, "ucName": "\nView Supply Requests\n", "uctext": " To show a list of pending requests. \n", "steps": "\n  \n 1 He clicks on the proper link to view supply requests.\n 2 A list of pending requests is listed.\n", "dataset": "viper"}
{"index": 20, "ucName": "\nView Request Details\n", "uctext": " To view extended details of the chosen request.\n", "steps": "\n  \n 1 He clicks on the proper link to view supply requests.\n 2 A list of pending requests is listed.\n 3 He clicks on the proper link on a request to display its details.\n", "dataset": "viper"}
{"index": 21, "ucName": "\nSend Feedback on Request\n", "uctext": " The supplier states whether he can supply all the requested items or part of them and the time frame to deliver them. \n", "steps": "\n  \n 1 He input his feedback and submits.\n 2 A success (or error) message is displayed.\n", "dataset": "viper"}
{"index": 22, "ucName": "\nEdit Profile\n", "uctext": " The customer can edit his profile. The profile contains the name of the customer, his address, contact person and e-mail… etc.\n", "steps": "\n  \n 1 He clicks on the proper link to edit his profile.\n 2 Whether he makes changes or not, when he clicks on the proper link to submit the profile values, the current values of the profile is saved and he is returned to the main menu.\n", "dataset": "viper"}
{"index": 23, "ucName": "\nAdd Request\n", "uctext": " Customer can add new request.\n", "steps": "\n 1 The Customer press “Add Request”\n 2 The Customer fills the request form.\n 3 The Customer will send the request to the Coordinator.\n", "dataset": "viper"}
{"index": 24, "ucName": "\nView Requests\n", "uctext": " Customer can view all his pending requests that were sent to the Coordinator.\n", "steps": "\n 1 The Customer press “View Requests”\n 2 The Customer view list of requests.\n", "dataset": "viper"}
{"index": 25, "ucName": "\nEdit Request\n", "uctext": " The Customer can edit  request and notify the Coordinator.\n", "steps": "\n 1 The Customer press “Edit Request”\n 2 The Customer modifies the request information.\n 3 A notification will be sent to the Coordinator. \n", "dataset": "viper"}
{"index": 26, "ucName": "\nDelete Request\n", "uctext": " The Coordinator can delete  request and notify his supplier\n", "steps": "\n 1 The Customer press “Delete Request”\n 2 The information about the request will show.\n 3 Press “Delete” to processing the deleting\n 4 The Customer will send a notification to supplier\n", "dataset": "viper"}
{"index": 27, "ucName": "\nManage Customers \n", "uctext": " The main customers management page that coordinator will manage all customers information\n", "steps": "\n 1 The coordinator press “Manage  Customers”\n 2 The coordinator use any function.\n 3 The coordinator will manage all customers function. \n", "dataset": "viper"}
{"index": 28, "ucName": "\nAdd Customer\n", "uctext": " Coordinator can add new Customer.\n", "steps": "\n 1 The coordinator press “Add Customer”\n 2 The coordinator fills the new customer form.\n 3 The coordinator will send the customer to supplier \n", "dataset": "viper"}
{"index": 29, "ucName": "\nView Customers\n", "uctext": " coordinator can view a list of all customers.\n", "steps": "\n 1 The coordinator press “View Customers”\n 2 The coordinator view list of customers.\n", "dataset": "viper"}
{"index": 30, "ucName": "\nView Customer Details\n", "uctext": " Coordinator can show the details of any customer that he chose.\n", "steps": "\n 1 The coordinator press “View Customer Details”\n 2 The coordinator views the details of a customer.\n", "dataset": "viper"}
{"index": 31, "ucName": "\nEdit Customer\n", "uctext": " The Coordinator can edit  customer him.\n", "steps": "\n 1 The coordinator press “Edit Customer”\n 2 The coordinator modifies the request information.\n 3 The coordinator will send a notification to the customer.\n", "dataset": "viper"}
{"index": 32, "ucName": "\nDelete Customer\n", "uctext": " The coordinator can delete a certain customer\n", "steps": "\n 1 The coordinator press “Delete Customer”\n 2 The information about the customer will show.\n 3 Press “Delete” to processing the deleting\n 4 The coordinator will send a notification to the customer on option.\n", "dataset": "viper"}
{"index": 33, "ucName": "\nManage Suppliers\n", "uctext": " The main suppliers management page that coordinator will manage all suppliers information\n", "steps": "\n 1 The coordinator press “Manage  Suppliers”\n 2 The coordinator use any function.\n 3 The coordinator will manage all suppliers function. \n", "dataset": "viper"}
{"index": 34, "ucName": "\nAdd Supplier\n", "uctext": " Coordinator can add new Supplier\n", "steps": "\n 1 The coordinator press “Add Supplier”\n 2 The coordinator fills the new Supplier form.\n 3 The coordinator will send the Supplier to supplier \n", "dataset": "viper"}
{"index": 35, "ucName": "\nView Suppliers\n", "uctext": " coordinator can view a list of all Suppliers.\n", "steps": "\n 1 The coordinator press “View Suppliers”\n 2 The coordinator view list of Suppliers.\n", "dataset": "viper"}
{"index": 36, "ucName": "\nView Supplier Details\n", "uctext": " Coordinator can show the details of any Supplier that he chose.\n", "steps": "\n 1 The coordinator press “View Supplier Details”\n 2 The coordinator views the details of a Supplier.\n", "dataset": "viper"}
{"index": 37, "ucName": "\nEdit Supplier\n", "uctext": " The Coordinator can edit  Supplier and notify him (on option.)\n", "steps": "\n 1 The coordinator press “Edit Supplier”\n 2 The coordinator modifies the Supplier information.\n 3 The coordinator will send a notification to the Supplier.\n", "dataset": "viper"}
{"index": 38, "ucName": "\nDelete Supplier\n", "uctext": " The coordinator can delete a certain Supplier\n", "steps": "\n 1 The coordinator press “Delete Supplier”\n 2 The information about the customer will show.\n 3 Press “Delete” to processing the deleting\n 4 The coordinator will send a notification to the Supplier on option.\n", "dataset": "viper"}
{"index": 0, "ucName": " View Inventory\n", "uctext": " The system should provide a categorized view of the entire inventory to the Cons truction Junction s taff.\nStarting at the department level, users can navigate  into the inventory item categories and subcategories, all the way down to an individual inventory item.  ", "steps": "\n1. User accesses the main inventory screen\n2. The screen displays a ll inventory departments  \n3. User clicks a department  cell \n4. The screen displays all inventory categories for the selected department\n5. User clicks a category cell  that contains sub -categories  \n6. The screen displays all inventory sub -categories for the selected category\n7. User clicks a sub-category cell (leaf category)\n7.1. For a Unique Item category:  The screen displays a lis t of all inventory items for that selected category. User clicks a n item in the items list. The screen displays the details for the item\n7.2. For a Stock Item category:  The screen displays the details for th at Stock Item  category\n7.3. For a Under $5 category:  Nothing happens – The category cell is not clickable.\n", "dataset": "2009 - inventory 2.0"}
{"index": 1, "ucName": " Manage Departments and Add Department\n", "uctext": " The system should allow inventory administrators to customize the inventory structure by defining the invent ory departments (not to be con fused actual retail floor departments known later in this document as stocking locations).  ", "steps": "\n1.1. User accesses the main inventory screen  \n1.2. System displays the Add Department button\n1.3. User clicks the Add Department button\n1.4. User enters the Department data \n1.5. System validates the Department data  \n1.6. System adds the new Department to t he inventory  \n1.7. User is taken back to the main inventory screen  \n", "dataset": "2009 - inventory 2.0"}
{"index": 2, "ucName": " Manage Departments and Edit Department\n", "uctext": " The system should allow inventory administrators to customize the inventory structure by defining the invent ory departments (not to be con fused actual retail floor departments known later in this document as stocking locations).  ", "steps": "\n2.1. User navigates to a Department  (see View Inventory ) \n2.2. System displays the Edit Department button  \n2.3. User clicks the Edit Department button  \n2.4. System displays the Department data  \n2.5. User edits Department data  \n2.6. System validates the Department data  \n2.7. System updates the Department  information  \n2.8. User is taken b ack to the Department screen  \n", "dataset": "2009 - inventory 2.0"}
{"index": 3, "ucName": " Manage Departments and Delete Department\n", "uctext": " The system should allow inventory administrators to customize the inventory structure by defining the invent ory departments (not to be con fused actual retail floor departments known later in this document as stocking locations).  ", "steps": "\n3.1. User navigates to a Department (see View Inventory ) \n3.2. System displays the Edit Department button  \n3.3. User clicks the Edit Department button  \n3.4. System displays the Department data  \n3.5. User clicks the Delete Department button  \n3.6. System validates the Department deletion  \n3.7. System removes  the Depart ment  from the inventory  \n3.8. User is taken b ack to the main inventory screen\n", "dataset": "2009 - inventory 2.0"}
{"index": 4, "ucName": " Manage Categories and Add Category\n", "uctext": " The system should allow inventory administrators to customize the inventory structure by defining the inventory departments and categories.  ", "steps": "\n1.1. User navigates to a Department or Category (see View Inventory ) \n1.2. System displays the Add Category buttons: Unique Item; Stock Item.\n1.3. User clicks the desired Add Category button  \n1.4. System displays the appropriate screen for the Category type: Unique Item; Stock Item.\n1.5. User enters Catego ry data  \n1.6. System validates the Category data  \n1.7. System adds the new Category to the inventory  \n1.8. User is taken b ack to the parent Department or Category of the added Category  \n", "dataset": "2009 - inventory 2.0"}
{"index": 5, "ucName": " Manage Categories and Edit Category\n", "uctext": " The system should allow inventory administrators to customize the inventory structure by defining the inventory departments and categories.  ", "steps": "\n2.1. User navigates to a Category (see View  Inventory ) \n2.2. System displays the Edit Category button  \n2.3. User clicks the Edit Category button  \n2.4. System displays the appropriate screen for the Category type: Unique Item; Stock Item\n2.5. User edits Category data  \n2.6. System validates the Category data  \n2.7. System updates the Category  information  \n2.8. User is taken b ack to the Category screen  \n", "dataset": "2009 - inventory 2.0"}
{"index": 6, "ucName": " Manage Categories and Delete Category\n", "uctext": " The system should allow inventory administrators to customize the inventory structure by defining the inventory departments and categories.  ", "steps": "\n3.1. User navigates to a Category (see View Inventory ) \n3.2. System displays the Edit Category button  \n3.3. User clicks the Edit Category button  \n3.4. System displays the appropriate screen for the Category type: Unique Item; Stock Item\n3.5. User clicks the Delete Category button  \n3.6. System validates the Category deletion  \n3.7. System removes the Category from the inventory  \n3.8. User is taken back to the parent Department or Category of  the deleted Category  \n", "dataset": "2009 - inventory 2.0"}
{"index": 7, "ucName": " Manage Categories and Move Categories\n", "uctext": " The system should allow inventory administrators to customize the inventory structure by defining the inventory departments and categories.  ", "steps": "\n4.1. User navigates to a Department or Category (see View Inventory ) \n4.2. System displays the Move Categories button  \n4.3. User clicks the Move Categories button  \n4.4. System displays the Move Categories screen\n4.5. User selects Categories to move  \n4.6. User selects target location on categorized inventory for the moved Categories  \n4.6.1.  User may select an existing Department or Category  \n4.6.2.  User may choose to create a new Category to hold the moved Categories.\nIn this case, u ser selects the parent Department or Category of the  new Category to be created\nUser enters the new Category data\n4.7. User selects the type of move to be performed  \n4.7.1.  Move selected categories as -is and make them children of the target Department or Category\n4.7.2.  Merge  the contents (items) of the selected categories and add them to the target Department or Category\n4.8. System validates the entered data  \n4.9. System moves the selected Categories  \n4.10.  User is taken b ack to the parent Department or Category of the moved Categories  \n", "dataset": "2009 - inventory 2.0"}
{"index": 8, "ucName": " Manage Attributes and Details and View Item Attributes\n", "uctext": " The system should allow inventory administrators to customize the attributes and det ails available for each inventory item. Attributes can be defined for each department, and details can be defined for each department and/or category. ", "steps": "\n1.1. User accesses the main inventory screen  \n1.2. System displays the Edit Attributes button  \n1.3. User clicks the Edit Attributes button  \n1.4. System displays the Edit Attributes screen which displays all existing item attributes and their attribute x department assignments\n1.5. Optionally, user filters view by attribute status (active, inactive, all)  \n1.6. User clicks the Done button  \n1.7. User is taken back to the main inventory screen  \n", "dataset": "2009 - inventory 2.0"}
{"index": 9, "ucName": " Manage Attributes and Details and View Item Details\n", "uctext": " The system should allow inventory administrators to customize the attributes and det ails available for each inventory item. Attributes can be defined for each department, and details can be defined for each department and/or category. ", "steps": "\n2.1. User accesses the main inventory screen  \n2.2. System displays the Edit Details button  \n2.3. User clicks the Edit Details button\n2.4. System displays the Edit Details screen which displays all existing item details and their detail x department and category assignments\n2.5. Optionally, user filters view by detail status (active, inactive, all)  \n2.6. User clicks the Done button  \n2.7. User is taken back to the main inventory screen  \n", "dataset": "2009 - inventory 2.0"}
{"index": 10, "ucName": " Manage Attributes and Details and Edit Item Attributes\n", "uctext": " The system should allow inventory administrators to customize the attributes and det ails available for each inventory item. Attributes can be defined for each department, and details can be defined for each department and/or category. ", "steps": "\n3.1. User accesses the main inventory screen  \n3.2. System displays the Edit Attributes button  \n3.3. User clicks the Edit Attributes button  \n3.4. System displays the Edit Attributes screen which displays all existing item attributes and their attribute x department assignments\n3.5. Optionally, user filters view by attribute status (active, inactive, all)  \n3.6. User edits attributes  \n3.6.1.  User changes attribute x department assignments  \n3.6.2.  User changes attribute data  \n3.6.3.  User changes attribute active x inactive status  \n3.6.4.  User creates new attribute  \n3.6.5.  System validates the attribute data  \n3.6.6.  System updates the Item Attribute information  \n3.7. User clicks the Done button  \n3.8. User is taken back to the main inventory screen\n", "dataset": "2009 - inventory 2.0"}
{"index": 11, "ucName": " Manage Attributes and Details and Edit Item Details\n", "uctext": " The system should allow inventory administrators to customize the attributes and det ails available for each inventory item. Attributes can be defined for each department, and details can be defined for each department and/or category. ", "steps": "\n4.1. User accesses the main inventory screen  \n4.2. System displays the Edit Details button  \n4.3. User clicks the Edit Details button  \n4.4. System displays the Edit Details screen which displays al l existing item details and their detail x department and category assignments\n4.5. Optionally, user filters view by detail status (active, inactive, all)  \n4.6. User edits details  \n4.6.1.  User changes detail x department or category assignments  \n4.6.2.  User changes detail data  \n4.6.3.  User changes detail active x inactive status  \n4.6.4.  User creates new detail  \n4.6.5.  System validates the detail data  \n4.6.6.  System updates the Item detail information  \n4.7. User clicks the Done button  \n4.8. User is taken back to the main inventory screen\n", "dataset": "2009 - inventory 2.0"}
{"index": 12, "ucName": " Add Item  to Inventory\n", "uctext": " Items are typically added to the inventory as part of the donation processes. This is called adding an item in donation processing. Alternatively, items can be added during routine inventory maintena nce. This is called adding an item in inventory management mode.  ", "steps": "  \n1. User accesses the main inventory screen  \n5. The screen displays all inventory departments in matrix format  (see View Inventory ) \n2. User drills down to the appropriate category for the i tem \n2.1. If in donation processing mode, the item entry screen is presented automatically  \n2.2. If in inventory management mode, the list of existing inventory items in that category is displayed  \n2.2.1.  User clicks the Add Item button  \n3. The appropriate item entry  screen is presented\n4. User fills in item information  \n5. User confirms the addition of the new item  \n6. Inventory is updated  \n7. System gives the option of printing an item tag  \n8. User prints  item tag (s)s for unique or stock item(s)  \n9. User attaches tag (s) to the item (s)\n", "dataset": "2009 - inventory 2.0"}
{"index": 13, "ucName": " Manage Inventory Items and Modify Inventory Item\n", "uctext": " The system should allow various management actions to be performed on items existing in the inventory. These include modifying, deleting and splitting an item, and viewing the item‟s details and item history. These actions are only available for Unique and Stock items.  ", "steps": "\n1.1. User accesses the main inventory  screen\n1.2. The screen displays all inventory departments in matrix format  with option to select and/or edit items to move them to a new department/category\n1.3. User drills down to the desired existing inventory item (see View Inventory )\n1.4. The item detail screen is presented  \n1.5. User modifies item information  \n1.6. The system validates item information  \n1.7. Item information is updated in the inventory  \n1.8. System gives the option of re -printing then item tag  \n1.9. User optionally re -prints the item tag and  attaches it to the item\n", "dataset": "2009 - inventory 2.0"}
{"index": 14, "ucName": " Manage Inventory Items and Adjust Item Quantity\n", "uctext": " The system should allow various management actions to be performed on items existing in the inventory. These include modifying, deleting and splitting an item, and viewing the item‟s details and item history. These actions are only available for Unique and Stock items.  ", "steps": "\n2.1. User accesses the main inventory screen  \n2.2. The screen displays all inventory departments in matrix format  \n2.3. User drills down to the desired existing inventory item (see View Inve ntory ) \n2.4. The item detail screen is presented  \n2.5. User c hanges the item quantity  \n2.6. The system displays a confirmation screen where a  reason for the adjustment must  be specified by the user\n2.7. The sy stem validates the item change  \n2.8. Item information is updated in the inv entory  \n", "dataset": "2009 - inventory 2.0"}
{"index": 15, "ucName": " Manage Inventory Items and Split Inventory Item\n", "uctext": " The system should allow various management actions to be performed on items existing in the inventory. These include modifying, deleting and splitting an item, and viewing the item‟s details and item history. These actions are only available for Unique and Stock items.  ", "steps": "\n3.1. User accesses the main inventory screen  \n3.2. The screen displays all inventory departments in matrix format  \n3.3. User drills down to the desired existing inventory item (see View Inventory ) \n3.4. The item d etail screen is presented  \n3.5. User clicks the Split Item button  \n3.6. The system displays the Item Split screen  \n3.7. User builds  the list of items that the original item will be split into  \n3.7.1.  User can clone the original item to add new item(s) to the list that have similar attributes as the original item\n3.7.2.  User can add new items to the list by selecting Unique and Stock categories in the same way as adding a new item to the inventory (see Add Item to Inventory )\n3.8. Once the list is complete, user  confirms the split  \n3.9. The system validates the split  \n3.10.  Item information is updated in the inventory  \n3.10.1.  The original (split) item is update d in the inventory  \n3.10.2.  Any new i tems that were added to the split list are added to the inventory  maintaining parental history\n", "dataset": "2009 - inventory 2.0"}
{"index": 16, "ucName": " Manage Inventory Items and View Inventory Item History\n", "uctext": " The system should allow various management actions to be performed on items existing in the inventory. These include modifying, deleting and splitting an item, and viewing the item‟s details and item history. These actions are only available for Unique and Stock items.  ", "steps": "\n4.1. User accesses the main inventory screen  \n4.2. The screen displays all inventory departments in matrix format  \n4.3. User drills down to the desired existing inventory item (see View Inventory ) \n4.4. The item det ail screen is presented  \n4.5. User clicks the Item History button  \n4.6. The system displays the Item History screen containing current and historical information about the inventory item\n", "dataset": "2009 - inventory 2.0"}
{"index": 17, "ucName": " Suggest Item Price\n", "uctext": " The system should assist in the task of pricing a new inventory item by making  pricing suggestions to the user when adding to or modifying an  item in the inventory. The suggested price s should be calculated based on the original and sale prices of similar items that currently exist or existed in the inventory in the past. ", "steps": "  \n1. User accesses the inventory entry screen (see Add Item to Inventory , Manage Inventory Items )\n2. System shows  price recommendations based on current item data and de fault price suggestion configuration options\n3. User modifies item data \n4. System makes new price suggestions  based on new item data\n", "dataset": "2009 - inventory 2.0"}
{"index": 18, "ucName": " View Acquisi tions\n", "uctext": " Acquisition records for Drop -Off, Pickup and Decon donations are created in the CRM system. Inventory Management u sers should be able to view all past and current acquisitions . Receiving Associates use this function to locate an expected acquisition  when receiving a donation  at the loading dock.  Pickup and Decon crews may also use this function to initiate the process of receiving items while in the truck, on their way to the receiving dock.  Drop Off acquisitions are not typically pre-scheduled as Pi ck Up and Decon acquisitions  except for those submitted through the organizational website . As such, when a donor arrives with an unexpected drop off donation, a new acquisition needs to be able to be created in the CRM system first , at either the customer service desk or at the dock,  before it can be viewed in the acquisitions screen.  ", "steps": "\n1. User accesses the acquisitions  screen  \n2. The screen displays a list of all acquisitions , latest ones at the top of the list  \n3. User may optionally filter the acquisitions displayed on the screen by changing filtering options  \n4. User clicks on an acquisition record  \n5. System display the details for that acquisition, including expected items\n", "dataset": "2009 - inventory 2.0"}
{"index": 19, "ucName": " Receive Acquisition\n", "uctext": " A donor in possession of a valid acquisition number can proceed to the receiving dock where the items to be donated will be received and processed, and a donation receipt will be generated.  Alternatively, a donor may go directly to the receiving dock, in which case a new acquisition is cre ated by the Receiving Associate before items can be received and processed. The screens used for the acquisition process should simplify and expedite the data entry process, allowing the Receiving Associate to enter only the information needed to generate  the donation receipt. Additional attributes needed to complete the item information and effectively add the item to the inventory can be added at a second step , after the receipt has been printed and the donor has been served. The Receiving Associate can print temporary acquisition labels for items that require further processing.  Pick Up and Decon crews may also initiate the receiving process, entering as much detailed information about the donated items as desired, and generating a donation receipt. The y cannot, however, add items to the inventory or complete the acquisition process. A Receiving Associate is required to review all the acquisition information before those actions can take place.  ", "steps": "\n1. Donor or Primary Contact arrives at receiving dock with a valid donation number  \n2. Receiving Associate locates donation reques t in the system  (see View Acquisitions ) \n3. System displays donation request information  \n4. Receiving Associate enters information about each donated item into the donation request  (see Add Item to Inventory )\n4.1. A new item can be added to the list by cloning an existing item  \n4.2. A new item can be added by clicking the Add Item button  \n4.3. An item can be removed by setting the received quantity to zero  \n5. Receiving Associate  prints a donation receipt  \n6. Receiving Associate optionally writes information to the receipt by hand  such as condition  \n7. Donation receipt is given to the Donor  or Primary Contact  \n8. Receiving Associate prints item tags  for unique and stock items  (see Add It em to Inventory ) \n9. Receiving Associate attaches printed tags to corresponding items  \n10. Receiving Associate closes donation request\n", "dataset": "2009 - inventory 2.0"}
{"index": 20, "ucName": " Sell Item\n", "uctext": " Any item in the inventory may be purchased by a Construction Junction customer. The sale of the item is processed by QuickBooks POS and the inventory must be updated accordingly.  ", "steps": "  \n1. Buyer arrives at the cashier or checkout desk with the items to be p urchased  \n2. Sales associate scans the item tags  \n3. Sales associate processes the sale of the items in QuickBooks POS  \n4. The system updates the inventory to reflect the sale\n", "dataset": "2009 - inventory 2.0"}
{"index": 0, "ucName": " “WeatherFDDA”:  Setting up a  real time or off-line FDDA job", "uctext": " The objective of this feature is to automate the set up of new real time and off-line FDDA jobs. This use case describes the set up of GMOD jobs, re-runs and case studies. At this point, RTFDDAensemble jobs will be submitted to the MM as 'by hand' jobs or through a job configuration file.The MM will provide a default GMOD job configuration, which can be changed by the user. It is important to note that the model manager will accept andrun “custom” GMOD jobs. These are jobs that are also set up through the Setup-module, but donot use the default GMOD configuration  For a “custom” GMOD job, e.g., the user may choose tosupply his/her own input data, own pre-processors or a customized version of a MM5 executable.MM's Job-Setup module will allow the user to substitute the default configuration, but it is theuser's responsibility to make sure that these scripts, executables, etc.  reside on the cluster orclusters where the job will be running on. Submitting a “custom” GMOD job thought the Job-Setupmodule will allow the user to save the job's configuration with the MM.\n\n     ", "steps": " \n1.User chooses to “Set up  a Weather FDDA Job”.\n2.User may choose a cluster where the job should run on. \n3.User decides what model should be used: MM5 or WRF.\n4.User defines a JOBID.\n5.User determines domains: creates own domains (Note: This may only apply to MM5 jobs. From earlier discussions: creating domain files for WRF takes a long time.) or chooses between a number of pre-defined domains or submits own TERRAIN files\n6.User defines when a job is to be run and/or what cycle to run. If the cycle time is in the past, then the user is prompted to specify whether the job is a “case study” or “re-run”.\n7.User supplies other job specific information, such as, cycle interval, forecast length and other applicable information.\n8.User can specify whether to write restart files and the frequency of how often they are to be written.\n9.User can choose between predefined sigma-level configurations or supply own sigma-level configuration\n10.User has the option to specify the number of nodes to use. \n11.User can choose to receive email notification upon start, end and termination of the job.\n12.User chooses between standard or custom IC/BC data sources:•standard: ETA, AVNFTP (GFS), GFS004\nor •custom: provide data source (e.g., host:Full_Path_to_Dir)\nor •For off-line jobs, the user must specify the data source, i.e., location (MetVault ora directory) and time period. Important note for re-runs, if the input data is to obtain from the MetVault, then MetVault returns the data that was available andused in that cycle.\n11.Depending on the choice above, user can provide custom IC/BC pre-processor or choose the standard:•standard processing\nor •provide own pre-processing script\n12.User is given the option to run additional pre-processors for the IC/BC data, such as, LDAS or supply own custom pre-processor or skip this option.\n13.User chooses between standard and/or custom obs data sources and processing:•Standard: WMO, SAMS, MADIS, GTS, RAWS, okmeso, SatWinds, ACARS, etc.\nand/or •provide custom obs source1 and custom obs processor1\n•provide custom obs source2 and custom obs processor2\n•etc.\nor •For off-line jobs, the user must specify the data source, i.e., location (MetVault or a directory) and time period. Important note for re-runs, if the input data is to obtain from the MetVault, then MetVault returns the data that was available and used in that cycle.\n14.Depending on the choice of the model different options are given to the user:\n•MM5: The domain size and number of nodes for this job was determined earlier.Based on both choices, the user is presented with different MM5-executables to choose from. These executables have been compiled in advanced. The MM will be able to retrieve the compile info about the executables, e.g., domain size,number of nodes, number of sigma levels, etc. These few executables are standard executables. Or, the user can also supply own executable, e.g., its location on the cluster\n•WRF: User defines model options\n15.User chooses whether or not to run Final Analysis. This may only apply to re-runs and case studies.\n16.User chooses whether or not to run Prelim. Analysis. This may only apply to re-runs and case studies.\n17.User chooses whether or not run additional processing on the model output.\n18.User can choose to save the model output in MetVault. If 'yes', user must specify what output file is to be sent to the MetVault.\n19.User is given the option to save and submit the job now. Submitting now, would run IC/BC-data and obs processing and the model, no post-processing.\n20.User chooses whether or not to run post-processing. If ‘yes', then s/he will go through the action sequence in 3.4.\n21.User can save the above job configuration. Job configurations can be saved to a file.\n22.User submits the job.\n", "dataset": "model manager"}
{"index": 1, "ucName": " “ClimoFDDA”:  Setting up a  ClimoFDDA job\n", "uctext": " The objective of this feature is to integrate the GCAT functionalities within the MM. Suppose the user is logged on to the system and has made the following choices “Submit a newjob” -> “Set up a new model job”. S/he is then presented with two more options: “ Weather FDDA” and “Climo”.\n     ", "steps": " \n1.Chooses to  “Set up a Climo Job”.\n2.User defines a JOBID.\n3.User supplies other job parameters. For details, see GCAT tool\n4.User determines the domain location.\n5.User can specify locations for pseudo-obs and custom cross sections.\n6.User picks a pre-configured MM5 setup\n7.User sets the time line for the job: start time, end time and what years\n8.User sets the ensemble options: •hourly •min, max, mean, standard deviation,.... •diurnal cycle •typical moment\n9.User can request the number of nodes this job should run on.\n10.User chooses whether or not run additional processing on the model output.\n11.User can choose to save the model output in MetVault. If 'yes', user must specify what output, e.g., member and/or ensemble output is to be send to the MetVault.\n12.User is given the option to save and submit the job now. Submitting now, would run the member models, the ensemble, and possible model output processing, no post-processing.\n13.User chooses whether or not to run post-processing on the ensemble output. If “yes',then s/he will be presented with the following options:•Plots (NCL or RIP) •NAPS •MDV •Sites •MEDOC (1 – 4) •Raster •PRF •Wind Roses •...For each output product, the user is prompted to supply a destination host and location,where the output files should be copied.\n14.The user can also specify whether the members' output should be post-processed. S/he can specify which year-output to post-process and what post-processor(s) to use and where the output files should be copied.\n15. The user can specify whether another process (coupled app) should be run on the post-process output products. This needs further clarification.\n16.User can save the above job configuration. Job configurations can be saved to a file.\n17.User submits the job.\n", "dataset": "model manager"}
{"index": 2, "ucName": " Set up and submit a “post-processing” job\n", "uctext": "The objective of this feature is to provide the ability to only run “post-processing” on an existing model output file. It will also provide the post-processing part of the use case “WeatherFDDA” in 3.1. Suppose the user is logged on to the system and has made the following choice, “Submit a new job”.\n     ", "steps": " \n1.User selects “Set up a new 'post-processing' job” .\n2.User is prompted to supply location and name of the model output file:\n•If the model output file will be produced by a running or scheduled FDDA-job,\nthen the user supplies JOBID & cycle time\n•If the model output file already exists, then the user supplies its location.\n3.User chooses the type of post-processing:•Plots (NCL or RIP)•NAPS•MDV•Sites•MEDOC (1 – 4) •Stereo•Verification\n4.For each of the options chosen in 3., the user can supply a custom configuration file (ifthis is applicable) or use the default configuration file.\n5.User must supply destination location for the output products.\n6.User can specify the number of nodes this job should run on\n7.User can save this job's setting. Job configurations can be saved to a file.\n8.User submits job.\n", "dataset": "model manager"}
{"index": 3, "ucName": " Submit a 'By-hand' job\n", "uctext": " The objective of this feature is to accommodate the current GMOD-framework. It will also give the user the ability to run customized jobs. In order to submit a custom job to the MM, the user must first identify the cluster(s), where his/her job should run on. Then, log on to this machine, perform operations that are necessary for setting up the job and then register the job with the MM (see Action Sequence below). It is important to note that since a 'by-hand' job wasn't set up through MM's Job-Setup module, the MM doesn't know what the job is actually doing. In order for the MM to accept the job, the user will have to provide certain mandatory information about the job. Suppose the user is logged on to the system and has made the following choice, “Submit a new job”.\n     ", "steps": " \n1.User selects “Submit a 'By Hand' Job”\n2.User supplies:Mandatory:•job id (GMUAE, GWDPG,...)•location of the script (host:/full_path_to_script)•time when to run the script•estimated time of how long the script will run•name(s) of executable(s)•max. runtime for the executable(s)•number of nodes •location of output products (such as: host:/dir_path) Optional:•frequency of how often the script should run•job type•any additional information\n3.User can save the job's settings. Job configurations can be saved to a file.\n4.User submits job.\n5.User can view his/her job in the job queue (see 3.1.).\n6.User can receive an email notification when job is started, finished or killed. \n", "dataset": "model manager"}
{"index": 4, "ucName": "Load a job configuration from a file and submit the job\n", "uctext": " The objective of this feature is to provide the ability to load a job configuration into MM from a file. Suppose the user is logged on to the system and has made the following choice, “Submit a new job”.\n     ", "steps": " \n1.User selects ”Submit a job configuration file”.\n2.User supplies file name to load.\n3.User can make changes to the configuration.\n4.User can save the changed configuration.\n5.User submits the job.\n", "dataset": "model manager"}
{"index": 5, "ucName": "Retrieve and run a previously saved job configuration\n", "uctext": "The objective of this feature is to provide the ability to retrieve a previous job configuration and to re-run this job or change its settings and run it again.\n     ", "steps": " \n1.User logs on with user id/password.\n2.User chooses to look at his/her previously saved job configurations. A table of saved\njobs may include the following attributes: •Job id•Job type•Cycle time that was run last (if applicable)•time this job was run last•...\n3.User selects a job. User can change or delete this job configuration.\n4.User changes the job configuration.\n5.User can save the changed job configuration.\n6.User submits job.\n", "dataset": "model manager"}
{"index": 6, "ucName": " View scheduled, running and old jobs\n", "uctext": " The objective of this feature is to facilitate monitoring of running jobs, viewing the job queue and viewing jobs that ran in the past.\n     ", "steps": " \n1.User logs on with user id/password.\n2.User chooses to look at all running jobs, all scheduled jobs (the job queue), past jobs orall jobs (running, scheduled, old). User selects one of the four options.\n3.User is presented with a job table. Depending on the user's choice in 2, the job tablemay present the following attributes to the user:•user id – the 'owner' of the job •Job id•Job type – such as: GMOD, climoFDDA, FDDA-re-run, case study, custom,....•Job priority •start time•remaining time (estimated) or time it took to run the job•cycle (if applicable)•stage (Pre-processing, F-analysis, Prelim. Analysis,...)•status ( SCHEDULED, RUNNING, status in % - if applicable, DONE)•cluster and nodes (for a running job)•number of processors•and others\n4.User can select a job and receive more detailed information\n5.User can look at a jobs log files. \n6.User can delete his/her jobs from the job queue. A “super user” can delete any job fromthe job queue.\n7.User can stop his/her running job. A “super user” can stop any running job.\n8.User can re-start his/her job. A “super user” can re-start any job.\n9.User can resume his/her stopped job. A “super user” can resume any stopped job. \n", "dataset": "model manager"}
{"index": 0, "ucName": "DeleteCulturalHeritage", "uctext": "Delete a cultural object in the system.", "steps": "1. View the list of CulturalHeritage as a result of the use case SearchCulturalHeritage, it selects and activates a function of elimination. \n2 Asks confirmation. \n3 Confirm the operation. \n4 Delete the cultural choice.", "dataset": "eTour"}
{"index": 1, "ucName": "ViewRefreshmentPointCard", "uctext": "View the details of a selected point of rest.", "steps": "1. View the list of points of rest as a result of the use case SearchRefreshmentPoint, it selects and activates a function to view the card. \n2 Upload data to a selected restaurant.", "dataset": "eTour"}
{"index": 2, "ucName": "ViewConventionHistory", "uctext": "View the history of conventions derived from a selected point of rest.", "steps": "1. Access the features on the display of historical conventions. \n2 Upload data on conventions from the restaurant selected.", "dataset": "eTour"}
{"index": 3, "ucName": "ViewTouristCard", "uctext": "View the details of a selected account Tourist.", "steps": "1. Tourists from the list obtained by activating the use case SearchTourist will select and activate a function for displaying the card. \n2 Upload data to the selected account.", "dataset": "eTour"}
{"index": 4, "ucName": "Active / InactiveTouristAccount", "uctext": "Enable or disable the account of a tourist.", "steps": "1. Activate the feature for the activation / deactivation by a given sheet tourist. \n2 Asks for confirmation of activation / deactivation. \n3 Confirm the operation. \n4 Enable / disable the account of the visitor you selected.", "dataset": "eTour"}
{"index": 5, "ucName": "SearchTourist", "uctext": "Returns the list of tourist account in the system according to certain parameters.", "steps": "1. Access the search functionality of a tourist. \n2 Show the form. \n3 Fill out the form and submit. \n4 Processing the request.", "dataset": "eTour"}
{"index": 6, "ucName": "ModifyTouristAccountData", "uctext": "Change data of a selected account Tourist.", "steps": "1. Tourists from the list obtained by activating the use case SearchTourist it selects and activates a function to modify data. \n2 Loads the data selected and displays them in a form allowing the change. \n3 Edit the fields in the form and submit. \n4 Verify the information and asks for confirmation of the change. Where the data is invalid or insufficient, the system activates the use case Errored. \n5 Confirm the operation. \n6. Stores the modified data selected account.", "dataset": "eTour"}
{"index": 7, "ucName": "DeleteTouristAccount", "uctext": "Delete the account of a tourist from the system.", "steps": "1. Tourists from the list obtained by activating the use case SearchTourist will select and activate a feature for disposal. \n2 Asks for confirmation of the transaction. \n3 Confirm the operation. \n4 Delete the selected data.", "dataset": "eTour"}
{"index": 8, "ucName": "ModifyBanner", "uctext": "Changing the image of a banner ad.", "steps": "1. Receives a list of turning points of the rest use case SearchRefreshmentPoint and select one from accessing the function of editing a banner. \n2 View the list of banner associated with the point of rest. \n3 Select a banner from the list and enter the editing functionality. \n4 Displays a form for the selection of an image. \n5 Select a picture and send the request to change the system. \n6. Check the characteristics of the inserted and asks for confirmation of the change of the banner. In the event that the inserted image is not valid, enable the use case Errored. \n7 Confirmation of the transaction change. \n8 Bookmark this new image for the selected banner.", "dataset": "eTour"}
{"index": 9, "ucName": "CheckBannerNumber", "uctext": "Check if a point Refreshments included the maximum number of allowed banners to it.", "steps": "1. Load the data of the Convention of refreshment point and verify that the number of banners is less than the specified number of the current banner. If not checked, will end the operation input and displays a notification. \n2 Confirmation of the reading of the notification. \n3 Recovers the previous state.", "dataset": "eTour"}
{"index": 10, "ucName": "DeleteBanner", "uctext": "Delete a banner ad associated with a refreshment bar on the computer.", "steps": "1. Receives a list of turning points of the rest use case SearchRefreshmentPoint and select one from accessing the function of removal of the banner. \n2 View the list of banner associated with the point of rest. \n3 Select a banner from the list and enter the function of elimination. \n4 Displays a message confirming the deletion. \n5 Confirm the operation. \n6. Removes the banner.", "dataset": "eTour"}
{"index": 11, "ucName": "InsertCulturalHeritage", "uctext": "Inserts a new cultural object in the system.", "steps": "1. Activate the feature for the insertion of a new cultural good. \n2 Displays the corresponding form. \n3 Fill out the form with the data of the cultural and submit. \n4 Verify the data entered and asks for confirmation of the transaction. Where the data is invalid or insufficient, the system activates the use case Errored. \n5 Confirm the operation. \n6. Memorize your new cultural good.", "dataset": "eTour"}
{"index": 12, "ucName": "InsertBanner", "uctext": "Inserting a new banner associated with a point of rest.", "steps": "1. Receives a list of turning points of the rest use case SearchRefreshmentPoint and select one from the list and access to the function of inserting banners. \n2 Displays a form for the selection of an image. \n3 Select an image and sends the request for entering the system. \n4 Check the characteristics of the inserted, check that the number of banner did not exceed the maximum point of the restaurant and asks for confirmation of the insertion of the banner. In the event that the inserted image is not valid, enable the use case Errored. \n5 Confirm the operation of insertion. \n6. Remember the banners associated with the selected point of rest.", "dataset": "eTour"}
{"index": 13, "ucName": "InsertNews", "uctext": "Inserts a new news in the system.", "steps": "1. Activate the feature to insert a news. \n2 Displays the corresponding form. \n3 Fill out the form and submit. \n4 Verify the data entered and asks for confirmation of the transaction. Where the data is invalid or insufficient, the system activates the use case Errored. \n5 Confirm the operation of insertion. \n6. Stores the data of the new news.", "dataset": "eTour"}
{"index": 14, "ucName": "DeleteNews", "uctext": "Delete a news in the system.", "steps": "1. Activate the function of elimination of a news. \n2 View all news in a form. \n3 Select a news from the list and submit the form. \n4 Asks for confirmation of the transaction. \n5 Confirm the deletion of the news. \n6. Delete the data news.", "dataset": "eTour"}
{"index": 15, "ucName": "ModifyNews", "uctext": "Change data of a news on the computer.", "steps": "1. Activate the editing functionality of a news. \n2 View all news in a form. \n3 Select a news from the list and submit the form. \n4 Load the data of news and displays them in a form for editing. \n5 Change data in the form and submit. \n6. Check the modified information and asks for confirmation of the transaction. Where the data is invalid or insufficient, the system activates the use case Errored. \n7 Confirm the operation of changing the data news. \n8 Stores data modified news.", "dataset": "eTour"}
{"index": 16, "ucName": "ViewFeedback", "uctext": "View all feedback for a particular site.", "steps": "1. View the list of sites as a result of the use case SearchSite, it selects and activates a function to view the feedback. \n2 Upload Site Feedback selected.", "dataset": "eTour"}
{"index": 17, "ucName": "ViewReportStatistic", "uctext": "View statistical report relating to a selected location.", "steps": "1. Activate the feature on the statistical report. \n2 Upload the list of places in the system and displays them in a form. \n3 Select a location and submit the form. \n4 Upload midsize site feedback obtained by activating the SearchSite use case for the location selected. Prepare the statistical report.", "dataset": "eTour"}
{"index": 18, "ucName": "ModifyComment", "uctext": "Editing a comment by a feedback selected.", "steps": "1. View the list of sites as a result of the use case SearchSite, it selects and activates a function of change in the selected comment. \n2 Upload feedback issued to that site and displays them in a form. \n3 Select a feedback from the list and submit the form. \n4 Displays a form for editing the comment of feedback selected. \n5 Edit the comment and submit the form. \n6. Verify the data entered and asks for confirmation of the change. Where the data is invalid or insufficient, the system activates the use case Errored. \n7 Confirm the operation. \n8 Remember the comment changed.", "dataset": "eTour"}
{"index": 19, "ucName": "SearchSite", "uctext": "Searching for a specific site on the computer.", "steps": "1. Activate the search functionality of a site. \n2 Show the form for research \n3 Fill in the form of research and submit \n4 Processing the request", "dataset": "eTour"}
{"index": 20, "ucName": "DeleteTag", "uctext": "Removes one or more search tags in the system.", "steps": "1. Access the functionality to delete a tag. \n2 Research in the existing system, the tags and displays them in a form. \n3 Select one or more tags from the list and sends the request for deletion. \n4 Delete the selected search tag.", "dataset": "eTour"}
{"index": 21, "ucName": "ExistingErrorTag", "uctext": "He was asked to enter a search tags already in the system.", "steps": "1. Notice the error message and asks for confirmation of its reading. \n2 Confirmation of the reading of the notification. \n3 Recovers the previous state.", "dataset": "eTour"}
{"index": 22, "ucName": "ModifyCulturalHeritage", "uctext": "Change data of a cultural object in the system.", "steps": "1. View the list of cultural goods as a result of the use case SearchCulturalHeritage, it selects and activates a function of change. \n2 Load the data of the cultural and displays the form for editing. \n3 Change data in the form and submit. \n4 Verify the data entered and asks for confirmation of the transaction. Where the data is invalid or insufficient, the system activates the use case Errored. \n5 Confirm the operation. \n6. Stores the modified data of the cultural.", "dataset": "eTour"}
{"index": 23, "ucName": "InsertTag", "uctext": "Inserts a new tag search.", "steps": "1. Access the functionality of inserting new tag search. \n2 Show the form for entering a tag. \n3 Fill out the form with the required information and submit. \n4 Verify the data entered and check if the tag is already present in the system. In the latter case the active use case ExistingErrorTag. Instead, if the data is invalid or insufficient, the system activates the use case Errored.", "dataset": "eTour"}
{"index": 24, "ucName": "ModifyPassword", "uctext": "The Agency Operator chooses to change the password associated with your account", "steps": "5 Choose to change your password by pressing the appropriate \nButton \n6. Upload the form to change the password associated with that work agency \n7 Change your password by entering the new choice and confirming \n8 Save your changes", "dataset": "eTour"}
{"index": 25, "ucName": "ModifyPasswordError", "uctext": "He was asked to enter a password but is not confirmed in a correct way.", "steps": "4 Notify an error message. \n5 Confirmation of the reading of the notification. \n6. Back to change your password.", "dataset": "eTour"}
{"index": 26, "ucName": "Registration", "uctext": "Requires the creation of a new system.", "steps": "1. Enable the logging feature. \n2 View the registration form. \n3 Fill out the form and submit. \n4 Verify the data entered and asks for confirmation of the transaction. Where the data is invalid or insufficient, the system activates the use case Errored. \n5 Confirm the operation. \n6. Create a new account with the data entered.", "dataset": "eTour"}
{"index": 27, "ucName": "SEARCH", "uctext": "Research and cultural heritage for all.", "steps": "1. Activate the search functionality. \n2 Displays the corresponding form. \n3 Fill out the form and submit. \n4 Gets the position of the Guest citing the case of use location and process research.", "dataset": "eTour"}
{"index": 28, "ucName": "LOGIN", "uctext": "Ensures a registered user to access the system with the privileges that fall.", "steps": "1. Activate the login feature. \n2 Displays the corresponding form. \n3 Fill out the form with login information and submit. \n4 Check the correctness of the data, if not corrected on the use case LoginError.", "dataset": "eTour"}
{"index": 29, "ucName": "LoginError", "uctext": "The data supplied for the login is incorrect.", "steps": "1. Notice that the data entered for the login is not valid and asks for confirmation of the reading. \n2 Confirmation of the reading of the notification. \n3 Recovers the previous state.", "dataset": "eTour"}
{"index": 30, "ucName": "Logout", "uctext": "Ends the current session.", "steps": "1. Access the functionality of disconnection from the system. \n2 Asks for confirmation of the transaction. \n3 Confirm the request for disconnection. \n4 Disconnects the Registered User.", "dataset": "eTour"}
{"index": 31, "ucName": "InsertBanner", "uctext": "Inserting a new banner associated with the point of rest.", "steps": "1. Select the feature for the insertion of a new banner. \n2 Displays a form for the selection of an image. \n3 Select an image and sends the request for entering the system. \n4 Check the characteristics of the inserted, check that the number of banner did not exceed the maximum point of the restaurant and asks for confirmation of the insertion of the banner. In the event that the inserted image is not valid, enable the use case Errored. \n5 Confirm the operation of insertion. \n6. Remember the banners associated with the point of rest.", "dataset": "eTour"}
{"index": 32, "ucName": "ModifyBanner", "uctext": "Changing the image of a banner ad.", "steps": "1. Select the editing functionality of the banner. \n2 View the list of banner associated with the point of rest. \n3 Select a banner from the list and enter the editing functionality. \n4 Displays a form for the selection of an image. \n5 Select a picture and send the request to change the system. \n6. Check the characteristics of the inserted and asks for confirmation of the change of the banner. In the event that the inserted image is not valid, enable the use case Errored. \n7 Confirmation of the transaction change. \n8 Bookmark this new image for the selected banner.", "dataset": "eTour"}
{"index": 33, "ucName": "SearchCulturalHeritage", "uctext": "Returns the list of cultural objects in the system according to certain parameters.", "steps": "1. Activate the search functionality of a cultural object. \n2 Show the form for research. \n3 Fill in the search form and submit. \n4 Processing the request.", "dataset": "eTour"}
{"index": 34, "ucName": "DeleteBanner", "uctext": "Delete a banner ad associated with the point of rest.", "steps": "1. Select the feature for removal of the banner. \n2 View the list of banner associated with the point of rest. \n3 Select a banner from the list and enter the function of elimination. \n4 Displays a message confirming the deletion. \n5 Confirm the operation. \n6. Removes the banner.", "dataset": "eTour"}
{"index": 35, "ucName": "ModifyMenu", "uctext": "Change the daily menu of a restaurant.", "steps": "1. Activate the editing functionality of the menu. \n2 Displays a form with seven days of the week. \n3 Select a day of the week and submit the form. \n4 Upload the data menu for the selected day and loads them into a form. \n5 Edit menu of the selected day and submit the form. \n6. Verify the data entered and asks for confirmation of the edit menu. Where the data are insufficient or invalid, the active use case Errored. \n7 Confirm the operation. \n8 Saves changes to the menu selected.", "dataset": "eTour"}
{"index": 36, "ucName": "DeleteMenu", "uctext": "Delete a daily menu of a restaurant.", "steps": "1. Enable the functionality of deleting a menu. \n2 Displays a form containing the seven days of the week. \n3 Select a day of the week and submit the form. \n4 Calls to confirm the deletion. \n5 Confirm the operation. \n6. Delete the daily menu selection.", "dataset": "eTour"}
{"index": 37, "ucName": "ModifyRefreshmentPoint", "uctext": "Change data point associated refreshment.", "steps": "1. Enable the functionality of the information required by the point of rest. \n2 Upload data point Refreshments and displays them in a form. \n3 Change data in the form and submit. \n4 Verify the data entered and asks for confirmation of the change. Where the data is invalid or insufficient, the system activates the use case Errored. \n5 Confirm the operation. \n6. Stores the modified data of the point of rest.", "dataset": "eTour"}
{"index": 38, "ucName": "ConventionRequest", "uctext": "Require to conclude a Convention between the points of rest and the agency involved.", "steps": "1. Enable the functionality to request the Convention to the Agency. \n2 Displays a form for entering data of the Convention. \n3 Inserts the data in the form of the agreement and submit. \n4 Verify the data entered and asks for confirmation of the request. Where the data is invalid or insufficient, the system activates the use case Errored. \n5 Confirm the operation. \n6. Send the request to the Convention.", "dataset": "eTour"}
{"index": 39, "ucName": "ViewPersonalStatistic", "uctext": "Viewing statistics for Point Of Restaurants", "steps": "1. Select the feature to display personal statistics. \n2 Displays a form that shows data for the statistics associated refreshment point.", "dataset": "eTour"}
{"index": 40, "ucName": "ModifySearchPreference", "uctext": "Edit your personal search preferences.", "steps": "1. Access to functionality for the modification of personal search preferences. \n2 Upload your search preferences and displays them in a form. \n3 Edit the fields in the form and submit. \n4 Asks confirmation. \n5 Confirmation for changing search preferences. \n6. Memorize search preferences changed.", "dataset": "eTour"}
{"index": 41, "ucName": "ModifyTouristData", "uctext": "Change data associated with your account.", "steps": "1. Access to functionality for the modification of data. \n2 Loads the data and displays them in a form. \n3 Edit the fields in the form and submit. \n4 Check the modified information and asks for confirmation of the change. Where the data is invalid or insufficient, the system activates the use case Errored. \n5 Confirmation of the transaction change. \n6. Stores the modified data.", "dataset": "eTour"}
{"index": 42, "ucName": "ModifyGenericPreference", "uctext": "Edit Preferences generic personal.", "steps": "1. Access to functionality for the modification of generic personal preferences. \n2 Upload your preferences and the general view in a form. \n3 Edit the fields in the form and submit. \n4 Asks for confirmation of the change. \n5 Confirm the operation. \n6. Stores preferences changed.", "dataset": "eTour"}
{"index": 43, "ucName": "ViewPreferredSite", "uctext": "View the list of personal favorites.", "steps": "1. Select the feature to display the list of personal favorites. \n2 Upload the list of bookmarks.", "dataset": "eTour"}
{"index": 44, "ucName": "ViewCulturalHeritageCard", "uctext": "View the details of the selected cultural.", "steps": "1. View the list of cultural goods as a result of the use case SearchCulturalHeritage, it selects and activates a function to view the card. \n2 Loads the data for the selected cultural.", "dataset": "eTour"}
{"index": 45, "ucName": "ViewVisitedSites", "uctext": "View the list of sites for which it has issued a feedback.", "steps": "1. Select the feature to display the list of sites visited personal. \n2 Upload the list of sites for which the tourist has issued a Feedback", "dataset": "eTour"}
{"index": 46, "ucName": "InsertPreferenceSite", "uctext": "Inserts a site selected in the list of bookmarks.", "steps": "1. Activate the feature for the insertion of the selected site from the bookmarks. \n2 Prompt the inclusion \n3 Confirm the input. \n4 Inserts the selected site in the list of bookmarks.", "dataset": "eTour"}
{"index": 47, "ucName": "DeleteSiteFromPreferences", "uctext": "Tourism delete a site from the list of bookmarks.", "steps": "1. Choose to remove your site from the list of bookmarks by specific features. \n2 Prompt removal \n3 Confirm the removal. \n4 Removes the selected site from the list of bookmarks.", "dataset": "eTour"}
{"index": 48, "ucName": "InsertFeedback", "uctext": "Inserts a feedback for the selected site.", "steps": "1. Activate the feature on the issue of feedback. \n2 Verify that the visitor has not already issued a feedback for the site and displays a form for entering the feedback for the selected site. In case the visitor has already issued a feedback for the site selected, activates the use case FeedbackAlreadyReleased. \n3 Fill out the form, selecting one vote and inserting a comment, then submit. \n4 Verify the data entered and confirm the cheide. Where the data is invalid or insufficient, the system activates the use case Errored. \n5 Confirming the issue of feedback. \n6. Remember feedback and inserts the selected site in the list of sites visited.", "dataset": "eTour"}
{"index": 49, "ucName": "ModifyComment", "uctext": "Edit the comment previously issued.", "steps": "1. Choose to change the comment on the feedback for the site issued by the appropriate functionality. \n2 Verify the data entered and asks for confirmation of the change. Where the data is invalid or insufficient, the system activates the use case Errored. \n3 Confirm the change of the comment. \n4 Edit commentary on selected feedback", "dataset": "eTour"}
{"index": 50, "ucName": "FeedbackAlreadyReleased", "uctext": "", "steps": "1. Notification that the user has already issued a feedback for the site and cancel the operation to insert a new feedback. \n2 Confirmation of the reading of the notification. \n3 Recovers the previous state.", "dataset": "eTour"}
{"index": 51, "ucName": "Localization", "uctext": "Returns the current position of the tourist.", "steps": "n \nDescription: Returns the current position of the tourist. \nParticipating Actor: System initialization \nEntry conditions: He began a search or an advanced search. \nFlow of events Gps System: \n1. The system requires the data for the position. \n2 The GPS calculates the position of the tourist. \n3 The system is on hold until the data of the position.", "dataset": "eTour"}
{"index": 52, "ucName": "AdvancedSearch", "uctext": "The tourist searching for a site using the potential offered by the Advanced Search.", "steps": "1. Enable the advanced search feature from your personal area. \n2 View the advanced search form. \n3 Fill in the form of advanced search and submit. \n4 Gets the position of relying on the tourist event of the use location and process the request.", "dataset": "eTour"}
{"index": 53, "ucName": "ViewSiteCard", "uctext": "View the details of a particular site.", "steps": "1. Select the function for displaying the card on a site chosen. \n2 Upload data from the database.", "dataset": "eTour"}
{"index": 54, "ucName": "DeleteRefreshmentPoint", "uctext": "Delete a refreshment from the system.", "steps": "1. View a list of points of rest as a result of the use case SearchCulturalHeritage, it selects and activates a function of elimination. \n2 Asks for confirmation of the transaction. \n3 Confirm the deletion. \n4 Deletes the selected point of rest.", "dataset": "eTour"}
{"index": 55, "ucName": "ActiveConvention", "uctext": "Convention active request by a refreshment point.", "steps": "1. Enable the activation function of the Convention. \n2 Load the data request of the Convention from the point of rest and displays the corresponding form. \n3 Check the data of the agreement and decide for activation. \n4 Asks for confirmation of the activation. \n5 Confirm the operation. \n6. Processing the request.", "dataset": "eTour"}
{"index": 56, "ucName": "ModifyDataRefreshmentPointAgency", "uctext": "Edit the data pertaining to a designated point of rest.", "steps": "1. View a list of points of rest as a result of the use case SearchRefreshmentPoint, it selects an active and functional data changes. \n2 Upload data from the point of rest and displays the form of change. \n3 Change data in the form and submit. \n4 Verify the data entered in form and asks for confirmation of the transaction. Where the data is invalid or insufficient, the system activates the use case Errored. \n5 Confirm the operation. \n6. Stores the modified data of the point of rest.", "dataset": "eTour"}
{"index": 57, "ucName": "SearchRefreshmentPoint", "uctext": "Returns the list of points of rest in the system according to certain parameters.", "steps": "1. Activate the search functionality of a point of rest. \n2 Show the form for research. \n3 Fill in the search form and submit. \n4 Processing the request.", "dataset": "eTour"}
