{"index": 0, "ucName": "Create and Deactivate Patients Use Case", "steps": [" The HCP enters a patient as a new user of iTrust Medical Records system. Only the name and email are provided. The patient's assigned MID and a secret key (the initial password) are personally provided to the user, with which the user can reset his/her password. The HCP can edit the patient according to data format 6.4  with all initial values (except patient MID) defaulting to null and/or 0 as appropriate. Patient MID should be the number assigned when the patient is added to the system and cannot be edited. The HCP does not have the ability to enter/edit/view the patient's security question/password.", " The HCP selects a patient to deactivate. The HCP is presented with a confirmation containing the name of the patient and determines if it is the patient they intend to deactivate . A deactivated patient can not be modified or log into the system, and can only be reactivated by the administrator.", " The HCP uploads a comma-seperated value file containing one patient per row. The fields of the CSV file must include at least the first name, last name, and e-mail address, with additional columns available for the other demographic values. The patients are created, the tables are populated, and the MIDS and temporary passwords are displayed to the HCP in a table. The event is logged."], "act": ["Enter as new user", "Deactivates", "Uploads"], "obj": [" iTrust Medical Records system", " Patient", "\n  - HCP \n  - CSV File\n  - Patient\n  - Tables\n  - MIDS \n  - Event Logger"]}
{"index": 1, "ucName": "Enter/edit personal health records Use Case", "steps": [" The health care personnel enters a MID  of a patient and confirms their selection .", " The health care personnel may enter/edit personal health information including Patient Information (Data Format 6.4.1), Insurance Information (6.4.2), Emergency Contact Information (6.4.3), and Patient’s Health Information (((requirements:df4|6.4.4(). The HCP can indicate drug allergies . The HCP can indicate the patient has passed away, providing an appropriate diagnosis code.", " The HCP can select a medication from a pull down list and add it to the list of medications the patient is allergic to. The medication is checked against the patient's current and future prescriptions. The HCP is notified of any current or future prescriptions to which the patient has a drug allergy."], "act": ["Enter", "Enter/Edit", "There is no action specified in this requirement sentence. The predicate of the sentence is \"The HCP can select a medication from a pull down list and add it to the list of medications the patient is allergic to.\""], "obj": [" MID", " Health Care Personnel", " Medication"]}
{"index": 2, "ucName": "Document office visit Use Case", "steps": [" The HCP enters a MID  or name of a patient and confirms their selection .", " The HCP documents the following information related to an office visit. All events are logged (UC5, S8). Required information is designated; all other information is optional:", "Date (required)", "Hospital location of the office visit, if any, (the default should be the HCP's home location) (required)", "Appointment type (required) (UC60)", "Notes (numbers, characters, #, ;, ?, -, ', ., :, blankspace and carriage return are all allowed input values) (required)", "Option to send patient a billing statement (UC60)", "Basic Health Metrics (UC51) (required)", "Prescribed Medications (NDC, see Data Format 6.6) ", "Lab procedures that are ordered (LOINC code, see Data Format 6.11)(UC26)", "Patient Specific Instructions (UC44)", "Diagnoses (via the ICD-9CM code)", "Medical procedures (CPT code) performed", "Immunizations given (CPT Code, see UC15, S1)", "Patient referral (UC33).", " HCPs can return to an office visit and modify or delete the fields of the office visit (notes, health metrics UC51, prescriptions, laboratory procedures (UC26), referral (UC33), diagnoses, procedures, and/or immunizations (UC15)(. The event is logged (UC 5, S8) and the HCP is returned in the specific office visit record to verify his or her changes.", " The HCP has selected a medication prescribed from a pull down list. The HCP provides the dosage in milligrams, the start and end date for the prescription, and any special instructions. The instructions can contain numbers, characters, #, ;, ?, -, ', ., :, blankspace and carriage return. The HCP must provide instructions (can neither be empty nor the default form field value), or else they cannot add the prescription. The HCP can add the prescription to the list of medications (UC37)."], "act": ["Enter", "Documents", " Date", " Hospital location of the office visit", " Appointment type ", " Notes", "Send", " Basic Health Metrics ", " Prescribed Medications", " Lab procedures that are ordered", " Patient Specific Instructions", " Diagnoses", " Medical procedures  performed", " Immunizations given", " Patient referral", " Modify or delete", "Select"], "obj": ["Selection", "Office Visit Information", "Date", " Hospital location", "Appointment type", " Notes", "Billing Statement", " Basic Health Metrics ", "Prescribed Medications", " Lab procedures", "Instructions", " ICD-9CM code", " Medical procedures", "Immunizations", " Patient referral", "“办公室就诊记录”", " Prescription"]}
{"index": 3, "ucName": "Determine operational profile Use Case", "steps": ["The software tester authenticates himself or herself in the iTrust Medical Records system (UC2)", " He or she is then presented with the actual operational profile of the operations of the iTrust Medical Records where the use percentage is the % of total transactions for each particular transaction logging type, broken-down by each of the user types (patient, LHCP, UHCP, admin, tester("], "act": ["Authenticates", "Presented"], "obj": [" iTrust Medical Records system ", " iTrust Medical Records Operational Profile"]}
{"index": 4, "ucName": "Declare/undeclare Personal Representative Use Case", "steps": ["The HCP selects a patient by typing in the MID of the patient ", " The HCP can choose to add or remove another registered user as a personal health representative to that patient"], "act": ["selects", "Add or remove"], "obj": ["MID", "Registered User"]}
{"index": 5, "ucName": "Maintain standards lists Use Case", "steps": [" The administrator will maintain (add/update( a listing of allowable immunizations that an HCP can use. The administrator will store (1) the CPT code (The CPT code set accurately describes medical, surgical, and diagnostic services and is designed to communicate uniform information about medical services and procedures among physicians, coders, patients, accreditation organizations, and payers for administrative, financial, and analytical purposes. About CPT)  and (2) up to 30 alpha characters giving the name  of the immunization.", " The administrator will maintain a listing of allowable diagnoses that an LHCP can use. The administrator will store (1) the ICD-9CM code (The International Statistical Classification of Diseases and Related Health Problems (most commonly known by the abbreviation ICD) provides codes to classify diseases and a wide variety of signs, symptoms, abnormal findings, complaints, social circumstances and external causes of injury or disease. NHCS Classification of Diseases, Functioning and Disability) for the diagnosis ; (2) a classification that the diagnosis is either chronic/long-term OR short term; and (3) up to 30 alphanumeric characters giving the name  of the diagnosis.", " The administrator will maintain (add/update( a listing of allowable drugs that an HCP can use. The administrator will store (1) the National Drug Code (The National Drug Code (NDC) is a universal product identifier used in the United States for drugs intended for human use. National Drug Code Directory)", " The administrator will maintain (add/update( a listing of allowable physical services (including laboratory procedures) that an HCP can use. The administrator will store information of a LOINC code (Logical Observation Identifiers Names and Codes (LOINC) is a database and universal standard for identifying medical laboratory observations. LOINC c/o Medical Informatics)  according to Data Format 6.11. The administrator may choose to upload a file containing LOINC code information .", " The administrator selects a file containing LOINC information and chooses to upload it. LOINC data from this file is added to a listing of allowable physical services (including laboratory procedures that an HCP can use). If the file contains more fields than are supported by Data Format 6.11, all fields in Data Format 6.11 will be updated."], "act": ["Maintain", "Maintain", "Maintain", "Maintain", "Adds"], "obj": [" CPT code", " ICD-9CM code", " Listing of Allowable Drugs", " LOINC code", " LOINC data"]}
{"index": 6, "ucName": "Identify risk of chronic disease Use Case", "steps": ["Through the Personal Health Records page, an LHCP chooses a chronic disease and a patient", " The data in the database is analyzed according to the risk factors for the disease to determine if the patient exhibits one or more risk factors", " Currently available risk factors for chronic diseases are defined for Diabetes (Type 1 and Type2) and Heart Disease", " When the chosen patient satisfies the preconditions of the chosen chronic disease , the LHCP is provided with a warning message if that patient exhibits three or more risk factors", " The message will display the risk factors that the patients exhibit"], "act": [" chooses", " Analyze", "Defined", " satisfies", " display"], "obj": [" LHCP", " Risk factors for the disease", "Risk factors", " Patient", " Risk Factors"]}
{"index": 7, "ucName": "Proactively Determine Needed Patient Care Use Case", "steps": [" An alive patient who has not had an office visit for more than one year and who has been diagnosed with", "diabetes mellitus (is diagnosed with ICD code beginning with 250:http://icd9cm.chrisendres.com/index.php?action=child&recordid=1765 (", "asthma (is diagnosed with ICD code beginning with 493:http://icd9cm.chrisendres.com/index.php?action=child&recordid=4700 (, or", "circulatory-system disease (is diagnosed with an ICD code between 390 and 459 inclusive: http://icd9cm.chrisendres.com/index.php?action=child&recordid=4025 (.", " An alive patient over 50 years old who has not had a flu shot (CPT codes 90656, 90658, 90660 per http://www.influenza.com/index.cfm?fa=ADDITIONAL_RES_HC_2 during the months Sept - Dec of the last calendar year (or during the months Sept - Dec of the current calendar year if the retrieval time is between Sept - Dec).", " An alive patient under the age of 19 who has not had proper immunizations per the immunization schedule. The “catch up schedule” is relevant when the patient did not begin the immunizations according to the recommended schedule.", "Hepatitis B (90371) three doses: at birth, at age 1 month, at age 6 months; catch up schedule: at least 4 weeks between dose 1 and dose 2 and at least 8 weeks between dose 2 and dose 3", "Rotavirus (90681) three doses: at age 6 weeks, at age 4 months, at age 6 months; catch up schedule: at least 4 weeks between dose 1 and dose 2 and at least 4 weeks between dose 2 and dose 3", "Diphtheria, Tetanus, Pertussis (90696) six doses: at age 6 weeks, at age 4 months, at age 6 months, at age 15 months, at age 4 years, at age 11 years; catch up schedule: at least 4 weeks between dose 1 and dose 2, at least 4 weeks between dose 2 and dose 3, at least 6 months between doses 3 and 4, at least 6 months between dose 4 and dose 5, at least 5 years between dose 5 and dose 6", "Haemophilus influenzae (90645) three doses: at 6 weeks, at age 4 months, at age 12 months; catch up schedule: at least 4 weeks between dose 1 and dose 2 and at least 4 weeks between dose 2 and dose 3 if first dose is administered at younger than 12 months; if first dose is administered between 12 and 14 months, at least 8 weeks between dose 1 and dose 2 and dose three is canceled; if first dose is administered at or after 15 months, only one dose is required", "Pneumococcal (90669) four doses: at age 6 weeks, at age 4 months, at age 6 months, at age 12 months; catch up schedule: at least 4 weeks between dose 1 and dose 2 and at least 4 weeks between dose 2 and dose 3 and at least 8 weeks between dose 3 and dose 4 if first dose is administered at younger than 12 months; if first dose is administered between 12 and 14 months, at least 8 weeks between dose 1 and dose 2 and dose three is canceled; if first dose is administered at or after 15 months, only one dose is required", "Poliovirus (90712) four doses: at age 6 weeks, at age 4 months, at age 6 months, 4 years; catch up schedule: at least 4 weeks between dose 1 and dose 2, at least 4 weeks between dose 2 and dose 3, at least 4 weeks between doses 3 and 4, dose 4 is not required if dose 3 was administered at the age of 4 or older", "Measles, Mumps, Rubella (90707) two doses: at age 12 months, at age 4 years; catch up schedule: at least 4 weeks between dose 1 and dose 2", "Varicella (90396) two doses: at age 12 months, at age 4 years; catch up schedule: at least 3 months between dose 1 and dose 2", "Hepatitis A (90633) two doses: at age 12 months; at age 18 months: catch up schedule: at least 6 months between dose 1 and dose 2", "Human Papillomavirus (90649) Female only, three doses; at age 9 years; at age 9 years + 2 months; at age 9 years + 6 months; catch up schedule: at least two months between dose 1 and dose 2; at least four months between dose 2 and dose 3"], "act": ["There is no action verb in the given sentence. The sentence is a descriptive statement about a patient. The predicate of the sentence is \"has been diagnosed with\".", "diagnosed with", " asthma", " circulatory-system disease", " alive patient over 50 years old who has not had a flu shot", " has not had proper immunizations per the immunization schedule", "None", "No action is mentioned in the given sentence. It is a description of the timing and schedule for receiving Rotavirus vaccine doses.\n\nThe predicate of the sentence is \"Rotavirus  three doses\".", "There is no action to be extracted from this description of vaccination schedule for Diphtheria", "No Action Found", "There is no action to be extracted from this sentence. It is a description of a vaccination schedule for pneumococcal  and the requirements for spacing between doses based on the age at which the first dose is administered.", "There is no action in this sentence. The sentence is a description of the schedule for administering the Poliovirus vaccine to patients.", " Vaccinate", " Schedule", "Vaccinate", " Vaccinate"], "obj": [" Patient", " ICD code", " Asthma", " Circulatory-System Disease", " Patient", " Patient", " Hepatitis B", " Rotavirus", " Diphtheria", " Haemophilus influenzae", " Pneumococcal Vaccination", " Poliovirus ", " Measles", " Varicella  vaccine", " Hepatitis A", " Human Papillomavirus"]}
{"index": 8, "ucName": "Maintain a hospital listing Use Case", "steps": [" The administrator will store (1) hospital Id number for the hospital , (2) up to 30 alphanumeric characters giving the name of the hospital, and (3) an address for the hospital.", ". The system shall enable the administrator to add a new entry for a hospital, or modify the hospital name in an existing entry. Note that the administrator is not allowed through the system interface to delete an existing entry or modify the hospital ID number in an existing entry."], "act": ["Store", "Add a new entry for a hospital"], "obj": [" Hospital Information", " Hospital entry"]}
{"index": 9, "ucName": "View prescription report Use Case", "steps": [" The user (patient or personal health representative) can choose to view a list of (1) their own prescriptions or (2) the prescriptions for whom the user is a person health representative by choosing one patient from a a list of these patients. A prescription list is then displayed , sorted by start date (the later date is ranked earlier).", " The user (LHCP) selects a patient from the list of requested reports. At this point, the LHCP can view a prescription list for that patient , sorted by start date (the later date is ranked earlier).", " The prescription report is titled with the patient name. The prescription list includes medication, date prescribed, start date, end date for each prescription, and the name of the doctor who prescribed the medication."], "act": ["Choose", "selects", " is titled"], "obj": [" Prescription list", " Patient", " Prescription Report"]}
{"index": 10, "ucName": "Create, Disable, and Edit Personnel Use Case", "steps": [" An administrator enters a LHCP, ER, or public health agent as a user of iTrust Medical Records system, initially only the name and email are provided. A secret key is personally provided to the user, with which the user can reset his/her password. The admin must specify a specialty for a new LHCP (one of: General Physician, Heart Surgeon, OB/GYN, Pediatrician, Surgeon) and for a new LT (one of blood, tissue, or general). The data for personnel can be edited according to Data Format 6.2 (all fields mandatory except for associated MID and Street Address 2). The administrator shall be allowed to assign a LHCP to multiple hospitals, and the administrator can choose among only the hospitals provided in the hospital list pull down menu. The hospital ID numbers for a LHCP are stored in the Medical Care Personnel Affiliation database (data format 6.8). The administrator shall be allowed to assign a LT to a single hospital, and the administrator can choose among only the hospitals provided in the hospital list pull down menu. The hospital ID numbers for a LT are stored in the Medical Care Personnel Affiliation database (data format 6.11).", " A LHCP enters an UAP as a user of iTrust Medical Records system according to data format 6.2 (all fields mandatory) ."], "act": ["There is no action in this requirement specification. The provided information is mostly about the configuration and management of the iTrust Medical Records system by the administrator", "Enter"], "obj": ["Entity extracted from the given text is User.", "User"]}
{"index": 11, "ucName": "View emergency electronic health record Use Case", "steps": [" The LHCP or ER enters a MID", " The LHCP or ER confirms the input "], "act": ["Enter MID", "Confirms"], "obj": [" MID", " Input Confirmation"]}
{"index": 12, "ucName": "View Comprehensive Patient Report Use Case", "steps": [" The LHCP enters a patient medical identification number (MID)  and confirms his/her input .", " The LHCP can view the comprehensive patient report for the specified patient, which includes the information below.", "All patient demographic information (address, phone, etc.), see (UC4) and Data Format 6.1", "The entire history of personal health records, see (UC10) and Data Format 6.4", "All diagnoses, including those not normally viewable by the requesting LHCP, see (UC11) and Data Format 6.5", "All designated HCPs (MIDs and Names), see (UC6)", "All allergies, procedures, medications, office visits, and known relatives, see (UC11) and Data Format 6.5, 6.6", "All MIDs and names of people that this person is representing, see (UC13)", "All MIDs and names of people that this person is represented by, see (UC13)", " The LHCP views a list of requests he/she has made for reports, with the status and pertinent information about the requests."], "act": ["Enter and confirm patient MID", " can view", " None", " None", "View", " see", "View", " representing", " represented by", " views"], "obj": ["Patient Medical Identification Number ", " Comprehensive Patient Report", "Data Format 6.1", "History of Personal Health Records", "Data Format", "Healthcare Professionals ", "Data Format", "Names of People", " MIDs and names of people", " LHCP Requests"]}
{"index": 13, "ucName": "Take Satisfaction Survey Use Case", "steps": ["A patient or personal health representative can answer any of the following questions relative to a previous (in UC9, S1) office visit according to Data Format 6", "13", "\\n\\nHow many minutes did you wait in the waiting room?\\nHow many minutes did you wait in the examination room before seeing your physician?\\nHow satisfied were you with your office visit?\\nHow satisfied were you with the treatment or information you received?\\nThe answers to the survey are stored"], "act": [" answer", "对不起", " are stored"], "obj": [" Question", " Representative", " Answers"]}
{"index": 14, "ucName": "View Physician Satisfaction Survey Results Use Case", "steps": ["A user chooses to view physician satisfaction survey results", " The user provides a zip code  or a hospital code and an (optional) physician type (from a pull-down list: see data format 6", "2 - general, surgeon, heart specialist, pediatrician, OB/GYN)", " The patient is provided with the following for each physician of that type that practices in a zip code (based upon the address/zipcode provided in UC2) that match the first three digits of the provided zip code:\\n\\nName\\nAddress\\nAverage number of minutes patients wait in waiting room\\nAverage number of minutes patients wait in examination room prior to seeing physician\\nAverage office visit satisfaction\\nAverage satisfaction with treatment/information\\nPercentage of office visits for which satisfaction information is available"], "act": ["View", "Provides", " None", "Provided"], "obj": ["Physician Satisfaction Survey Results", "Zip Code/Hospital Code", "Professional Title", " Physician Information"]}
{"index": 15, "ucName": "Manage Lab Procedures Use Case", "steps": [" An HCP can create a lab procedure for a given office visit. The HCP selects a procedure code, a priority from 1 to 3 (1=most important, 3=not as important), and Lab Technician (listed with his/her specialty and the number of pending lab procedures in his/her priority queue, grouped by priority). The HCP saves the new lab procedure, or cancels the lab procedure creation , . The status of the lab procedure is marked as in transit.", " An HCP can view a previously created lab procedure for a given office visit. The HCP can view patient name, lab procedure code, current lab procedure status, timestamp, and Lab Technician name.", " An HCP can reassign a previously created lab procedure to a different Lab Technician if the lab procedure is not yet in the testing state. The HCP selects a different Lab Technician from the list of available Lab Technicians (displayed with Lab Technician specialty and the number of pending lab procedures in his/her priority queue, grouped by priority). The HCP confirms the reassignment, or cancels the reassignment .", " An HCP can remove a previously created lab procedure for a given office visit. The HCP chooses to remove the lab procedure as long as the status is either in transit or received. The HCP is prompted to confirm that he/she wishes to remove the lab procedure.", " An HCP can add commentary to a pending lab procedure . The HCP enters a comment for a lab procedure with status as pending. Upon entering a comment, the lab procedure status is updated to completed.", " A patient may view his or her own lab procedure. On the associated office visit page, the patient can see the current status of the lab procedure, the HCP name, and the timestamp. If the lab procedure status is marked as completed, the patient can see the results and the HCP-provided comments.", " A Lab Technician can view his or her assigned lab procedures. The Lab Technician sees a list of all lab procedures assigned to him/her that have a status of received, followed by a list of lab procedures that remain in transit. The list of received lab procedures is sorted by priority (from most important to least important), with a secondary sort by timestamp (oldest to newest). The first lab procedure in the received list is marked with a status of testing, and all other lab procedures have a status of received. The list of in transit lab procedures is sorted by timestamp, from oldest to most recent. In both lists, the Lab Technician is provided the lab procedure ID, lab procedure code, status, priority, HCP name, and timestamp.", " A Lab Technician can record the results of a lab procedure . The Lab Technician enters the lab procedure numerical result and confidence interval for the lab procedure with the status of testing. Upon recording the results of the lab procedure, the status is updated to pending.", " A Lab Technician can update the status of a lab procedure to received. In the list of in transit lab procedures , the Lab Technician can update the status to received when the sample has been received in his/her lab."], "act": ["No action", "View", "Reassign/Confirm/Cancel", "Remove", "Enter comment", "There is no action in this requirement specification sentence. The sentence describes the information that a patient can view on an associated office visit page and the content they can access if the lab procedure status is marked as completed.\n\nThe predicate of the sentence is \"can view\" and \"can see\".", "View", " Enter the lab procedure numerical result and confidence interval for the lab procedure with the status of testing.\nPredicate", "Update"], "obj": ["Lab Procedure", " Lab Procedure", " Lab Procedure", " Lab Procedure", " Lab Procedure", " Lab Procedure", " Lab Procedure", "In the given text", " Lab Procedure Status"]}
{"index": 16, "ucName": "Alert Users by Email Use Case", "steps": [" The user has successfully changed his/her password (UC3, S2). An email informing the user of the password change is sent to the user including the MID but not the password.", " The status of a laboratory procedure has been updated (UC26, S3). The patient is notified with the following information: the LOINC number and the updated status."], "act": ["Changed", " no action specified"], "obj": [" Email", "Laboratory Procedure Status"]}
{"index": 17, "ucName": "View Patients", "steps": ["The LHCP chooses to view all patients with which he or she has ever had an office visit with", " The patient’s name (clickable to view PHR), address, and date of last office visit are displayed", " The list is sorted by the date of the last office visit (most recent first)"], "act": ["View", "There is no action in this sentence. The predicate is displayed.", " sorted by"], "obj": [" LHCP", " Patient Information", "List"]}
{"index": 18, "ucName": "Find LHCPs with experience with a diagnosis", "steps": ["A patient has just been diagnosed with a condition and wants to find the LHCPs in the area who have handled that condition", " The patient chooses 'My Diagnoses” and is presented with a listing of all their own diagnoses, sorted by diagnosis date (more recent first)", " The patient can select a diagnosis and will be presented with the LHCPs in the patient's living area (based upon the first three numbers of their zip code) who have handled this diagnosis in the last three years", " The list is ranked by the quantity of patients the LHCP has treated for that diagnosis (each patient is only counted once regardless of the number of office visits)", " For each LHCP, the following information is displayed:\\n\\nName of LHCP linked to contact information for that LHCP\\nThe quantity of unique patients treated by that LHCP for that diagnosis (each patient is only counted once regardless of the number of office visits)\\nList of all prescriptions given by that LHCP for that diagnosis\\nList of all laboratory procedures ordered by that LHCP for that diagnosis\\nThe LCHP's average visit satisfaction\\nThe LHCP's average treatment satisfaction"], "act": [" has handled", " is presented with", "There is no action in this sentence. The predicate of the sentence is \"can select\".", "ranked", " displayed"], "obj": [" LHCPs", " My Diagnoses List", " Diagnosis", " Patients", " LHCP Information"]}
{"index": 19, "ucName": "Authenticate Users Use Case", "steps": [" If the security question/answer has been set (it is not null) , present security question and obtain answer.", " If answer to security question is correct, allow user to change their password. An email notification is sent.", " Electronic sessions must terminate after ten minutes of inactivity. Ensure that authentication is reset after a period of inactivity that exceeds ten minutes."], "act": [" present security question and obtain answer", "Allow", " must terminate"], "obj": [" Security Question", " Security Question Answer", " Authentication"]}
{"index": 20, "ucName": "Messaging between LHCP and patient", "steps": [" A patient or personal representative for a patient chooses to send a message to an LHCP (no multiple recipients allowed in a single message). The patient/representative is presented with a pull down menu of his/her DLHCP. The patient/representative chooses one of these DLHCP and types the subject (up to 100 characters) and text of a message (up to 1000 characters), and clicks the send button. A row for showing the message subject, the name of the recipient, and the timestamp (which includes both date and time) is then visible in the patient/representative’s message outbox. A bolded row for showing the message subject, the name of sender, and the timestamp is then visible in the LHCP's message inbox. A fake email is sent to the LHCP alerting the user that a new message has arrived. After a message is sent, the patient or personal representative is directed to his/her message outbox.", " An LHCP chooses to send a message to a patient/representative (no multiple recipients allowed in a single message). The LHCP enters and confirms the patient/representative's MID. The LHCP types the subject (up to 100 characters) and the text of a message (up to 1000 characters), and clicks the send button. A row for showing the message subject, the name of the recipient, and the timestamp is then visible in the LHCP’s message outbox. A bolded row for showing the message subject, the name of the sender, and the timestamp is then visible in the patient/representative’s message inbox, and a fake email is sent to the patient/representative that indicates that he/she has a new message from an LHCP. After a message is sent, the LHCP is directed to to his/her message outbox.", " A patient or patient representative wishes to reply to a message. The patient/representative views his or her message inbox. The patient/representative opens the message to which he or she wishes to reply , and then clicks the reply link above the message text. The patient/representative enters the text of the response message (up to 1000 characters) he or she wishes to send, then clicks the send button. A row for showing the message subject (now preceded by “RE:”), the name of the recipient, and the timestamp is then visible in the patient/representative’s message outbox. A bolded row for showing the message subject (now preceded by “RE:”), the name of the sender, and timestamp is then visible in the LHCP’s message inbox. A fake email is sent to the LHCP alerting the LHCP that a new message reply has arrived.", " An LHCP wishes to reply to a message. The LHCP views his or her message inbox. The LHCP opens the message to which he or she wishes to reply , and then clicks the reply link above the message text. The LHCP enters the text of the response message (up to 1000 characters) he or she wishes to send, then clicks the send button. A row for showing the message subject (now preceded by “RE:”), the name of the recipient, and the timestamp are then visible in the LHCP’s message outbox. A bolded row for showing the message subject (now preceded by “RE:”), the name of sender, and timestamp are then visible in the patient/representative’s message inbox. A fake email is sent to the patient/representative alerting the patient/representative that a new message reply has arrived.", " A user (a patient, patient representative, or LHCP) wishes to read a message from the message inbox or outbox. The user chooses to open his or her message inbox/outbox. Each row in the message inbox/outbox includes the message subject, the name of either the sender (only for the case of inbox) or recipient (only for the case of outbox), and timestamp. By default, the messages in the message inbox/outbox should be ordered by timestamp, the most recent first. Each row for an unread message in the message inbox is bolded. The user selects a message from the message inbox/outbox to read by clicking the “Read” link beside the row for the message, and then the message subject, the name of the sender, the name of the the recipient, timestamp, and the message text shall be displayed in a new page. After a message in the message inbox is read (i.e., displayed in a new page), the row for the message in the message inbox is not bolded anymore.", " A user (a patient, patient representative, or LHCP) can sort messages in his or her message inbox by either the sender's last name or timestamp (but not both) in either ascending or descending order (where timestamps in descending order would have the most recent first). A user can sort messages in his or her message outbox by the recipient's last name or timestamp (but not both) in either ascending or descending order. To do so, a user selects one option out of the “Sort by” labeled drop-down box (with options of “Sender/Recipient” or “Timestamp”) and selects one option out of the “by order of” labeled drop-down box (with options of “ascending” or “descending”), and then click the “Sort” button. Note that the sorted order is not saved for later viewing after the message inbox or outbox is reopened again (where the default sorting is always used).", " A user (an LHCP or patient/representative) can modify his/her message displaying filter by modifying the following filtering criteria: (1) the sender (i.e., the sender's name is exactly the same as the specified string), (2) the subject (i.e., the subject is exactly the same as the specified string), (3) has the words (i.e., the subject or the message body has the specified substring), (4) doesn't have (i.e., neither the subject nor the message body has the specified substring), (5) time stamp falling into the period defined by the starting date and ending date (inclusive) (the user interface shall provide both the option of typing in a specific date in the date format and the option of selecting a date from a calendar for the current month). Note that a single filter includes values for these five filtering criteria (rather than five filters for these five filtering criteria) and a value could be an empty string, indicating that this criterion has no impact on filtering (i.e., imposing no constraints related to this criterion). The user interface shall be initially populated with the values of the filtering criteria from the previously saved filter. After the user modifies the criteria, the user chooses to click the “Cancel” button to cancel the modifications of the filter (i.e., repopulate the user interface with the values of the filtering criteria from the previously saved filter), to click the “Test Search” button to search (i.e., displaying the message inbox  including only the messages satisfying the specified filtering criteria), or to click the “Save” button to save the modified filter. Each user is associated with only one filter (being saved across login sessions) and applies only this saved filter. The user's associated filter initially has all empty inputs for the filtering criteria before the user modifies it."], "act": ["Chooses", " Sends", "Patient representative opens and clicks message. Views message. Patient representative enters text message and clicks send button. A fake email is sent to LHCP to alert new message reply has arrived.", " Wishes to reply to a message", " Read", "Sort", " Modify  \nPredicate"], "obj": [" Message", "Message", " Patient/Representative", "Entity extracted from the given text is Message.\n\nIn the given scenario", " Message Inbox/Outbox", "Based on the given text", "Based on the provided text"]}
{"index": 21, "ucName": "Find LHCPs for prescription renewal Use Case", "steps": [" The expired prescription report list is titled with the patient name. The expired prescription list includes medication, date prescribed (i.e., the day of the office visit), start date, end date for each prescription, and the name of the LHCP who prescribed the medication (where the name of the LHCP is linked to contact information for that LHCP). If there are no expired prescriptions, an empty expired prescription list is presented.", " The patient clicks on the name of the LHCP for an expired prescription, and is presented with the contact information for that LHCP (including First Name Last Name, LHCP Type, Street Address 1, Street Address 2, City, State, Zip Code, Phone, and Contact Email); if any type of contact information is missing or the whole contact information for the LHCP is not available in the database, the corresponding missing types of information are simply shown as blank."], "act": [" No action specified.", "is presented with"], "obj": [" Expired Prescription Report List\nSub-entities", " LHCP Contact Information"]}
{"index": 22, "ucName": "Proactively Confirm Prescription-Renewal Needs Use Case", "steps": [" A chronic special-diagnosis-history patient is an alive patient who has been diagnosed with at least one of the following:", "diabetes mellitus (is diagnosed with ICD code beginning with 250:http://icd9cm.chrisendres.com/icd9cm/index.php?action=child&recordid=1894 (,", "asthma (is diagnosed with ICD code beginning with 493:http://icd9cm.chrisendres.com/icd9cm/index.php?action=child&recordid=5000 (, or", "circulatory-system disease (is diagnosed with an ICD code between 390 and 459 inclusive: http://icd9cm.chrisendres.com/icd9cm/index.php?action=child&recordid=4314 (.", " The patient list is titled with the HCP's name. The patient list includes the patient's name (i.e., first name and last name), phone number, and contact email address  (so that confirmation calls or emails can be made or sent outside of the iTrust system). The list is sorted based on the ascending alphabetical order of the patients' last names, and then first names. When a chronic special-diagnosis-history patient satisfies all three conditions and has multiple prescriptions satisfying the third condition, the patient is listed in the list only once. The list is a static list with no link on the patient's name, phone number, or contact email address)"], "act": [" is", "diagnosed with", " has", " circulatory-system disease", " titled"], "obj": [" chronic special-diagnosis-history patient", "diabetes mellitus", " Asthma", " Circulatory System Disease", " Patient List"]}
{"index": 23, "ucName": "Manage Patient Referrals Use Case", "steps": [" An HCP chooses to refer a patient to another receiving HCP through the referral feature on a patient's office visit page (UC11). The sending HCP must select a receiving HCP by either entering the HCP's MID and confirming the selection , or by searching for the HCP by name. The sending HCP is also presented with a text box to include notes about the referral. The sending HCP then chooses a priority from 1-3 (1 is most important, 3 is least important) for the referral. The HCP may send the referral, cancel the referral, or edit the referral . Upon sending a referral, the patient, sending HCP, and receiving HCP receive a message summarizing the newly created referral information (sending HCP name & specialty, receiving HCP name & specialty, patient name, referral notes, and referral creation timestamp); additionally, the sending and receiving HCP messages include the referral priority.", " An HCP chooses to view received referrals. The receiving HCP is presented with a list of referrals sorted by priority (from most important to least important). The receiving HCP then selects a referral to view details and is presented with the name and specialty of the sending HCP, the patient's name, the referral notes, the referral priority, the office visit date with a link to the office visit, and the time the referral was created.", " A sending HCP views a list of previously sent patient referrals. The HCP may sort the list of referrals by patient name, receiving HCP name, time generated, and/or priority. The HCP chooses a specific referral from the list to view complete details about the referral: patient name, receiving HCP name and specialty, time generated, priority, office visit date, and notes.", " A patient views a list of his/her referrals. The patient may sort the list of referrals by receiving HCP name, time generated, and/or priority. The patient chooses a specific referral from the list to view complete details about the referral: sending HCP name and specialty, receiving HCP name and specialty, time generated, priority, office visit date, and notes. The patient is also provided with the option to send a message to the receiving HCP to request that an appointment be scheduled.", " A sending HCP edits a previously created patient referral as long as the referral has not been viewed by the receiving HCP. The sending HCP may edit the priority of the referral and/or the referral notes. The sending HCP then chooses to save the edits, cancel the edits, or re-enter the data .", " A sending HCP cancels a previously sent patient referral by visiting the office visit page, viewing the details of a previously sent patient referral , and choosing cancel. The HCP is asked to confirm the decision to cancel the referral. The patient and receiving HCP receive a message (UC30) indicating that the referral was canceled."], "act": [" Refers", "Receives", "Views", " Views", "Edits", "Cancels"], "obj": ["Referral", " Referral", " List of Referrals", "根据提供的软件要求描述", " Patient Referral", " Patient Referral"]}
{"index": 24, "ucName": "Report Telemedicine Monitoring Details Use Case", "steps": [" An LHCP or UAP can add and delete patients from his or her monitoring list. A patient is added to the list by the LHCP or UAP typing in the patient's MID  or name. An LHCP can delete a patient from his or her monitoring list by the LHCP typing the the patient's MID . In both cases, the LHCP is presented the name of the patient and must confirm the add/delete. For each patient from the monitoring list, the LHCP can choose to edit which types of remote monitoring information (blood pressure, glucose levels, height, weight, and pedometer readings) should be submitted by the patient. By default, all types of information are selected for monitoring.", " A patient whose at least one physiologic data type is specified to be under monitoring chooses to report their physiologic data. He or she can report his or her blood pressure (systolic and diastolic)  and/or glucose levels . The input data, a timestamp, and the fact that the status is “self-reported” are saved.", " An LHCP chooses to view the physiologic data monitoring details. The LHCP is presented with a listing of all his or her patients whose at least one physiologic data type is specified to be under monitoring with their blood pressure and glucose levels, recording timestamp, and whom reported the data (patient, UAP name, personal representative name). Patients with no information for the current day are highlighted. Patients with blood pressure or glucose level out of range are highlighted (normal blood pressure: systolic 90-140; diastolic 60-90; normal glucose 70-150). The LHCP can select a patient to obtain additional information about a patient .", " An LHCP selects to view additional information for a patient. The LHCP is presented with a screen upon which he/she can choose a date range. Once the date range is selected, the LHCP can see the patient name; patient phone number; personal representative (name and phone number), if applicable; and the blood pressure, glucose levels, height, weight, and pedometer readings as well as whom reported the data (patient, UAP name, personal representative name) for that date range.", " A UAP can select to report physiologic measurements. He/she is presented with a list of the patients whose at least one physiologic data type is specified to be under monitoring and for whom he/she is allowed to report measurements. He or she can select a patient and then enter data. He or she can report the blood pressure (systolic and diastolic)  and/or glucose levels  for the patient. The input data, a timestamp, and the fact the the status was reported by “case manager” and their MID are saved. Only the applicable input entries (those whose corresponding data types of the patient are specified to be under monitoring) are displayed to the UAP.", " A patient can select to report physiologic measurements for those whose at least one physiologic data type is specified to be under monitoring andfor whom he/she is a patient representative. He/she is presented with a list of the patients whose at least one physiologic data type is specified to be under monitoring and for which he/she is allowed to report measurements. He or she can select a patient and then enter data. He or she can report the blood pressure (systolic and diastolic)  and/or glucose levels  for the patient. The input data and a timestamp and the fact that the status was reported by “patient representative” and their MID are saved. Only the applicable input entries (those whose corresponding data types of the patient are specified to be under monitoring) are displayed to the patient.", " A patient whose height, weight, or pedometer data type is specified to be under monitoring chooses to report his/her height/weight/pedometer data. He or she can report his or her daily height (in the format of digits XXXX.X with the units of “feet”), daily weight (in the format of digits XXXX.X with units of “lbs”), and/or pedometer readings (in the format of up to 10 digits of integer with units of “footsteps”). The input data, a timestamp, and the fact that the status is “self-reported” are saved. Only the applicable input entries (those whose corresponding data types of the patient are specified to be under monitoring) are displayed to the patient.", " An LHCP chooses to view the height/weight/pedometer data monitoring details. The LHCP is presented with a listing of all his or her patients whose height, weight, or pedometer data type is specified to be under monitoring with their height, weight and pedometer reading numbers, recording timestamp, and who reported the data (patient name, UAP name, or personal representative name). Patients with no information for the current day are highlighted in red. Patients with a weight value 5% more or less than the immediate previously recorded weight value are highlighted (if the new weight value exceeds 105% of the previous weight value, the entry should be highlighted yellow; if the new weight value is below 95% of the previous weight value, the entry should be highlighted yellow). The LHCP can select a patient to obtain additional information about a patient .", " A UAP can select to report height/weight/pedometer measurements. He/she is presented with a list of the patients whose height, weight, or pedometer data type is specified to be under monitoring and for which he/she is allowed to report measurements. He or she can select a patient and then enter data. He or she can report the height, weight, and/or pedometer reading for the patient. The input data, a timestamp, and the fact that the status was reported by “case manager” and his/her MID are saved. Only the applicable input entries (those whose corresponding data types of the patient are specified to be under monitoring) are displayed to the UAP.", " A patient can select to report height, weight, and/or pedometer readings for those for whom he/she is a patient representative. He/she is presented with a list of the patients for which he/she is allowed to report measurements. He or she can select a patient and then enter data. He or she can report the height, weight, and/or pedometer readings for the patient. The input data, a timestamp, and the fact that the status was reported by “patient representative” and his/her MID are saved. Only the applicable input entries (those whose corresponding data types of the patient are specified to be under monitoring) are displayed to the patient."], "act": ["Add/Delete patients", " report", "View", "View", "Select", "\n\n1. Patient selects to report physiologic measurements.\n2. A list of patients is presented to the user", "There is no action in this sentence. The sentence describes a process where a patient reports their height", " No action specified", " Select and enter data for patients height", "Select"], "obj": ["Patient", " Physiologic Data", "LHCP", " LHCP ", " Physiologic Measurements", "\n\n1. Patient\n2. Representative\n3. List of patients\n4. Blood pressure \n5. Glucose levels\n6. Input data\n7. Timestamp", " Patient Data Report", "LHCP选择查看的数据类型是 身高/体重/计步器数据监控详情", " Patient Data", " Patient Representative"]}
{"index": 25, "ucName": "Report Adverse Event Use Case", "steps": [" A patient is presented with a listing of all prescription drugs for which he/she has been prescribed and/or has taken in the last 12 months. The patient chooses one or more drug(s) for which to report the adverse event. The patient is then able to write a textual description which describes the symptoms of the adverse event and to save the information. A fake email is sent to the LHCP who prescribed the medication indicating the patient name and MID, drug, and symptoms.", " A patient is presented with a listing of all immunizations for which he/she has been administered in the last 12 months. The patient chooses the immunization for which to report the adverse event. The patient is then able to write a textual description which describes the symptoms of the adverse event and to save the information. A fake email is sent to the LHCP who administered the immunization indicating the patient name and MID, drug, and symptoms."], "act": ["There is no action to extract from this requirement specification sentence. The sentence describes a process that involves a patient interacting with a system to report adverse events related to prescribed drugs. The process includes viewing a list of prescribed drugs", "Writes"], "obj": ["\n\n* Patient\n* Prescription Drugs\n* Adverse Event\n* Textual Description\n* LHCP \n* Medication\n* MID ", " Patient"]}
{"index": 26, "ucName": "Monitor Adverse Event Use Case", "steps": [" A public health agent is presented with a listing of prescription drug-related adverse events for the time period that do not have a status of “removed”, sorted by NDC. The public health agent can select to see the detail of a specific report. Upon reading the report, the public health agent can choose to send a “fake email” message to the adverse event reporter to gain more information about the report. The public health agent may also choose to remove an adverse event report (such as based upon communication with the reporter or because the report appears to be bogus) .", " A public health agent is presented with a listing of immunization-related adverse events for the time period that do not have a status of “removed”, sorted by CPT code . The public health agent can select to see the detail of a specific report. Upon reading the report, the public health agent can choose to send a “fake email” message to the adverse event reporter to gain more information about the report. The public health agent may also choose to remove an adverse event report (such as based upon communication with the reporter or because the report appears to be bogus) .", " The adverse event report changes to a status of “removed.” A message of the removal is sent to the adverse event reporter and to the LHCP involved in the report (because the LHCP prescribed the drug or administered the immunization)."], "act": ["View details of a specific report", " View detail of a specific report\nAction", "Changes"], "obj": [" Public Health Agent", "Public Health Agent", "Status"]}
{"index": 27, "ucName": "Safe Drug Prescription Use Case", "steps": [" The drug desired to be prescribed is checked against the patient's drug allergies. The HCP is notified of drug allergy.", " The drug desired to be prescribed is checked for interactions between other drugs currently taken by the patient. The HCP is notified of possible interactions.", " The HCP selects one or more of the override reasons available for selection . The patient is sent a “fake email” that the HCP has prescribed a medication that he/she is allergic to or that has a known interaction with a drug he/she is taking.", " The system shall enable the administrator to add a new entry for a reason or modify the reason name in an existing entry . Note that the administrator is not allowed through the system interface to delete an existing entry or modify the reason ID number in an existing entry.", " The system shall store (1) reason id number for the reason ; and (2) up to 80 alphanumeric characters giving the name of the reason ."], "act": [" is checked", " is checked for interactions between other drugs currently taken by the patient", "No action. The sentence is a description of a process or event", "Add or modify", "Store"], "obj": ["Drug", " Drug Interaction", " Override Reason", "Entry", " Reason"]}
{"index": 28, "ucName": "Maintain Drug Interaction Use Case", "steps": [" The administer is presented with two lists of NDC codes/names. The administrator chooses a drug from each list to record an interaction between the two drugs . The two drugs and a textual description of the possible effects of the interaction are stored.", " The administrator selects one drug and is presented with a listing of all drug interactions currently associated with that drug. The administrator can select a particular pair of drugs and delete the interaction between the two drugs."], "act": ["Choose and store", " Select"], "obj": [" Drug Interaction", " Drug Interaction"]}
{"index": 29, "ucName": "Enter/edit Demographics Use Case", "steps": [" A patient or personal health representative may enter or edit their own demographic information including their security question/answer according to data format 6.1. When answer to the security question is typed in, the answer should not appear on the screen (similar to how a password normally appears) and the answer should be confirmed (by the patient or personal health representative) before it is saved. .", " HCP must enter the MID of a patient and then enter or edit demographic information with the exception of the patient's security question/password according to data format 6.1 .", " An HCP may enter or edit their own demographic information according to data format 6.2 .", " An HCP may upload a photo of the patient as part of the patient's demographic records ."], "act": ["Enter", "Enter the MID of a patient and enter or edit demographic information", "Enter or edit", " may upload"], "obj": [" Patient", "Patient Demographic Information", " HCP Demographic Information", " Photo of the Patient"]}
{"index": 30, "ucName": "Log Transaction Use Case", "steps": [" For Login Failures, the IP Address of the machine, transaction type = 1, and timestamp are recorded.", " For creating, viewing, modifying, or deleting information, the following information is recorded: the MID of the logged in user, any appropriate secondary MID of the user whose information is being accessed, a transaction type corresponding to the given action, and the current timestamp."], "act": [" recorded", "Record"], "obj": [" Login Failure", " Information"]}
{"index": 31, "ucName": "View HCP; Designate/Undesignate Designated Licensed Health Care Professional Use Case", "steps": [" The LHCP's name, specialty, address, date of office visit, and whether or not the LHCP is a DLHCP for this patient is indicated. The list is sorted by the date of the last office visit (most recent first).", " The patient can choose to toggle between designating/undesignating any LHCP as being a DLHCP for them.", " The patient types a last name or partial last name, and/or providing the specialty. The patient may optionally enter a zip code (match on first three numbers of zip code), in addition to the name and/or specialty. The LHCP's name, specialty, and address are provided."], "act": [" is indicated", " toggle", "type"], "obj": ["\n- LHCPs name\n- specialty\n- address\n- date of office visit\n- LHCP ", " LHCP", "patient"]}
{"index": 32, "ucName": "View Access Log Use Case", "steps": [" By default, the patient is presented with a list sorted by dates, most recent access first.", " The patient may choose to view the list sorted by the role of the accessor relative to the patient (personal health representative, LHCP, UAP, Emergency Responder; any order is fine as long as the list is sorted by role) as well as by date for each role type, most recent access first."], "act": [" presented with", " view"], "obj": [" List", " Role of the Accessor"]}
{"index": 33, "ucName": "View records Use Case", "steps": [" The patient or personal health representative can see patient personal health information (including historical values), immunizations, and office visit information (date, diagnoses, medication, name of attending physician but not notes, laboratory procedures) for (a) their own records and (b) the records for whom the user is a personal representative. If a patient or personal health representative has not taken an office visit satisfaction survey for an office visit yet, the patient may choose to take the survey for an office visit (if the survey has already been taken, the patient or personal health representative will not have the ability to take the survey or view their previously submitted survey) (UC24).", " The patient or personal health representative can see an abbreviated health history of their siblings, parents, and both sets of grandparents for which MIDs are available in iTrust. They can see diagnoses related to the following (presented as a table with an x if the family member suffered from that diagnosis(:", "high blood pressure (Systolic blood pressure over 240 mmHg and/or a diastolic blood pressure over 120 mmHg);", "high cholesterol (HDL (“good”) cholesterol levels under 35 mg/dL (milligrams per deciliter) and/or a triglyceride level over 250 mg/dL);", "diabetes (is diagnosed with ICD-9CM code beginning with 250:http://icd9cm.chrisendres.com/index.php?action=child&recordid=1765,;", "cancer (is diagnosed with ICD-9CM code beginning with 199:http://icd9cm.chrisendres.com/index.php?action=child&recordid=1765,;", "heart disease (is diagnosed with ICD=9CM code beginning with 402:http://icd9cm.chrisendres.com/index.php?action=child&recordid=1765,;", "smoking; and", "the cause of death if the family member is deceased."], "act": [" see", " can see", " high blood pressure", " high cholesterol", " is diagnosed with", " is diagnosed with", " heart disease is diagnosed with ICD=9CM code", " smoking", " is deceased"], "obj": [" Patient", " \n\t- Family Member Diagnosis Information\n\t- MID \n\t- iTrust System", " Blood Pressure", " Cholesterol level", " diabetes", " Cancer", " \"Heart Disease\"", "smoking", " Cause of Death"]}
