{"index": 0, "ucName": "AuthenticationAdministrator", "steps": ["1. Administrator logs in to the system. ", "2. The system displays the login form for entering data (user name and password). ", "3. The administrator enters the data and submits the authentication request. ", "4. The system receives the form, verifies the data and allows the administrator access to the system with the specified access permissions."], "act": ["Logs in", " displays", "Enters and submits", " allows"], "obj": [" Administrator", " login form", " Authentication Request", " System"]}
{"index": 1, "ucName": "LogoutEmployee", "steps": ["1. The employee wants to end the work session and clicks on the Logout button. ", "2. The system disconnects the employee from the system and returns to the main screen."], "act": ["Logout", " disconnects"], "obj": [" Logout button", " Employee"]}
{"index": 2, "ucName": "HowToBecomeAVolunteer", "steps": ["1. The Citizen accesses this descriptive screen ", "2. The system responds to the need by letting him know how to become a Civil Defense volunteer, and of the requirements that the Citizen will necessarily have to meet. ", "3. The Citizen takes note of what is written and therefore wishes to access the associated form, and therefore, the use case DownloadModule will be called."], "act": ["Accesses", " \"let him know\"", " takes note of"], "obj": ["Screen", " Civil Defense volunteer", " DownloadModule"]}
{"index": 3, "ucName": "Committee", "steps": ["1. The Citizen accesses this service in order to take note of the hierarchical composition of the Civil Defense. ", "2. The system responds to the Citizen's curiosity with a screen where there is an organizational chart of the components of the Municipal Civil Defense in accordance with the other governmental institutions in the area according to the law of the Municipal Council approved by all."], "act": [" accesses", " responds"], "obj": ["Hierarchical Composition of Civil Defense", " Organizational Chart of the Municipal Civil Defense Components"]}
{"index": 4, "ucName": "DownloadIscription", "steps": ["1. The Citizen accesses this screen because he/she wants to register for Civil Service. ", "2. The system responds with a page where the requesting Citizen can download the form to fill out and submit to the Civil Defense office."], "act": [" accesses", " responds"], "obj": ["Civil Service Registration Screen", " Form"]}
{"index": 5, "ucName": "DownloadModule", "steps": ["1. The Citizen accesses the download of the form as he/she wants to join Volunteer ", "2. The system responds to this need with the ability to view the form The Citizen acknowledges the form, and decides to start downloading the file. ", "4. The system responds to the Citizen's need by saving the form to join the Volunteer Action."], "act": ["Accesses", " None", " responds"], "obj": ["Form", " Form", " Form to Join Volunteer Action"]}
{"index": 6, "ucName": "ManageModifications", "steps": ["1. The employee after authenticating in the system accesses the Civil Defense feature to edit the relevant forms. ", "2. The system responds to this need with the ability to display a screen with the use cases UpdateAtmosphericConditions, UpdateEnvironmentalAnalysis, UpdateCompetitionsBands. ", "3. The 'employee selects the feature to be modified. ", "4. The system responds to the employee's need with the requested change form."], "act": ["Accesses", "Display", " selects", " responds"], "obj": [" Civil Defense feature", "Screen", " feature", " Change Form"]}
{"index": 7, "ucName": "Fires", "steps": ["1. The Citizen can access this section if he or she has chosen to view the Risks use case, and decides to learn more about the possible causes that trigger fires. ", "2. The system responds to the Citizen's need with a detailed description of how to prevent fires, and who deals with them."], "act": [" can access", " responds"], "obj": ["Risks use case", " Citizen"]}
{"index": 8, "ucName": "MonitoringIdro-pluviometric", "steps": ["1. The Citizen accesses this screen as he wants to satisfy his curiosity in knowing the situation monitored by the Civil Defense of municipal water ", "2. The system responds with a screen where he can view information about how the municipal water is being monitored, the bacteriological situation, and an update of the latest analysis performed on the samples taken."], "act": [" accesses", " The system responds."], "obj": [" Civil Defense of Municipal Water", "Screen"]}
{"index": 9, "ucName": "MonitoringVulcanic", "steps": ["1. The Citizen accesses this screen as he or she wants to know more about how the Civil Defense actually performs monitoring of volcanoes in the municipality and nationwide territory, with a detailed description of the information technologies adopted. ", "2. The system responds to the request by displaying an information sheet describing everything the Civil Defense does to keep track of volcanic activity."], "act": [" accesses", " displays"], "obj": [" Civil Defense Monitoring of Volcanoes", " Civil Defense "]}
{"index": 10, "ucName": "UsefulNumbers", "steps": ["1. The Citizen accesses this page to take advantage of the telephone contact information to contact in case of danger of any kind. ", "2. The system responds by allowing the display of a descriptive card with the telephone numbers of the agencies concerned with the safety of the Citizen himself. ", "3. The Citizen by accessing this screen can, in addition, view advice, and standard procedures, divided into categories, about the correct communication between him and the Call Center contact person of a given municipal body. ", "4. The system responds with an emergency support screen corresponding to the service the Citizen decides to contact."], "act": [" accesses", " allows the display of a descriptive card", " view", " corresponds"], "obj": [" Telephone Contact Information", " Descriptive Card", " Call Center Contact Person", " Emergency Support Screen"]}
{"index": 11, "ucName": "CivilProtection", "steps": ["1. The citizen accesses the descriptive sheet about general information about the municipal body in question. ", "2. The system responds to the information functionality, allowing the display of a description about the active roles played by the Civil Protection."], "act": [" accesses", " allowing"], "obj": [" descriptive sheet", " Civil Protection Active Roles"]}
{"index": 12, "ucName": "EditCitizen", "steps": ["1. The employee presses the edit citizen button. ", "2. The system displays a form for editing the citizen. ", "3. The clerk enters the data. ", "4. The system saves the changes made."], "act": ["Presses", " displays", "Enter", " saves"], "obj": [" Edit Citizen Button", " Form", " Clerk", " Changes"]}
{"index": 13, "ucName": "Waste", "steps": ["1. The Citizen accesses the fact sheet because he wants to know the actual waste situation in his municipality, and whether of course, the environment is protected by the Civil Defense with the help of municipal agencies. ", " The system responds to this need with a large and descriptive screen where the goals of the Municipal Council and informative notes on the dangers of waste fires are pointed out, and what kind of waste collection is in your municipality", " In addition, you can view the use case ViewResultsToxicologicalAmbiental i"], "act": [" accesses", " points out", "ViewResultsToxicologicalAmbiental"], "obj": [" Citizen", " Screen", "ViewResultsToxicologicalAmbiental"]}
{"index": 14, "ucName": "Hazards", "steps": ["1. The Citizen accesses the screen about the meanings of the hazards Civil Defense deals with, with specific images for each category of hazard, and videos of how it operates during rescue operations. ", "2. The system responds to the Citizen's request, with a screen where there are causes, meanings, about landslides, floods, and coastal erosion phenomena, and videos of interventions. ", "3. The Citizen, after viewing the descriptive sheet may want to know the causes of other hazards that the body deals with, and therefore decides to view them by activating, the use cases Fire, Volcanic, Seismic, SanitaryAntropic,Hydrological monitoring. ", "4. The system also makes available additional fact sheets on other hazards that Civil Defense deals with."], "act": [" accesses", " responds", "View", " makes available"], "obj": [" Screen about the meanings of hazards", " Screen", " use cases", " Fact Sheets on Other Hazards"]}
{"index": 15, "ucName": "SanitaryAntropic", "steps": ["1. The Citizen accesses the desired screen from the list of environmental hazards that is next to each description of those hazards. ", "2. The system responds to the Citizen's request by providing a detailed explanation of what this use case means in practical terms, and distributing advice and standard procedures in case of hazards."], "act": ["Accesses", " responds"], "obj": [" Screen", " Citizen"]}
{"index": 16, "ucName": "Civil Service", "steps": ["1. The Citizen accesses this section to get information about his or her usefulness to others. ", "2. The system responds with a screen display where it clarifies the goals of civil service, general information, and the ability to call the DownloadIscription use case."], "act": [" accesses", " clarifies"], "obj": [" Citizen", "Screen Display"]}
{"index": 17, "ucName": "Seismic", "steps": ["1. The Citizen accesses the descriptive screen of how seismic monitoring of the territory takes place and the possibility of acquiring information about the causes of an earthquake, and the measurement and prevention technologies used by the specialists of the operational core. ", "2. The system responds by providing the Citizen with the opportunity to view in an always descriptive manner, the characteristics of the instruments, the work done by the specialists, and the national bodies with which they collaborate."], "act": [" accesses", " provides"], "obj": [" Seismic Monitoring Screen", " System"]}
{"index": 18, "ucName": "ViewEnvironmentalToxicologicalResults", "steps": ["1. The Citizen accesses this tab in order to be personally aware of the environmental situation in the municipality in which he or she resides, whether it is being kept under control, and what values are at risk and why this situation exists. ", "2. The system responds with a descriptive screen about the toxicological values received from the chemical and toxicological analyses carried out by the Civil Defense on the environment and municipal land."], "act": [" accesses", " responds"], "obj": [" Citizen", " Toxicological Values"]}
{"index": 19, "ucName": "Volunteerism", "steps": ["1. The Citizen accesses the introductory screen. ", "2. The system responds by displaying the descriptive tab about general information about this aspect of Civil Defense, and the possibility of knowing the prerequisites for participation. ", "3. The Citizen becomes aware of what is written, and therefore selects the link where the use case ComeBecomeVolunteer is called. ", "4. The system responds by allowing him to view this description."], "act": ["Accesses", " displays", " becomes aware of", " allows"], "obj": [" Citizen", " Civil Defense", " use case ComeBecomeVolunteer", " Description"]}
{"index": 20, "ucName": "Volcanic", "steps": ["1. The Citizen accesses this tab, from the Risks use case if he wants to know more, about the volcanic situation in his municipality, and the possibility of viewing the Civil Defense monitoring methods. ", "2. The system responds with the correct display of a descriptive screen about the different types of eruptions of a volcano, making available, the possibility to view the current volcanic situation of the municipality. ", "3. The Citizen wants to know how the present volcanoes are being monitored, and therefore, will invoke the MonitoraggioVulcanico use case ", "4. The system provides the Citizen with a link to the MonitoraggioVulcanico use case, so that he or she can learn about the actual situation."], "act": [" accesses", " responds with", "Invoke", " provides"], "obj": [" Citizen", " Volcano Eruption Types Screen", " MonitoraggioVulcanico use case", "Link"]}
{"index": 21, "ucName": "CalculateAmount", "steps": ["1. The Citizen presses the button related to the tax calculation function. ", "2. The System presents the list of fees and taxes for which the amount can be calculated. ", "3. The Citizen selects the tax of interest. ", "4. The System shows a form to be filled in for calculation. ", "5. The Citizen enters the necessary data. ", "6. The System verifies the correctness of the data,computes the amount and shows it to the Citizen."], "act": ["Presses", " presents", " selects", " shows", " enters", " verifies"], "obj": [" button", " list of fees and taxes", " Tax", "Form", " necessary data", " Data"]}
{"index": 22, "ucName": "CalculateImportUnful", "steps": ["1. The Citizen presses the button related to the tax calculation function. ", "2. The System presents the list of taxes and fees for which the amount can be calculated. ", "3. The Citizen selects the tax of interest. ", "4. The System shows a form to be filled in for calculation. ", "5. The Citizen enters the necessary data. ", "6. The System verifies the correctness of the data but fails to perform the calculation, notifying the user of the reason for failure."], "act": ["Presses", " presents", " selects", " shows", "Enter", " verifies"], "obj": [" button", " List of Taxes and Fees", " Tax", "Form", " necessary data", "Calculation"]}
{"index": 23, "ucName": "EditEMailAdministrator", "steps": ["1. Administrator accesses the email edit form. ", "2. The system shows the form the enter the new e-mail. ", "3. The administrator enters the new email and presses the confirmation button. ", "4. The system updates the new email."], "act": ["Accesses", " shows", "Enters", "Updates"], "obj": ["Email Edit Form", "Form", " confirmation button", " Email"]}
{"index": 24, "ucName": "Dispute Fine", "steps": ["1. The Citizen clicks on the button to access the online fine management feature. ", "2. The System redirects the Citizen to the desired section. ", "3. The Citizen clicks on the online fine payment button. ", "4. The System searches for fines against the Citizen in the database for which payment has not yet been received. ", "5. The Citizen selects the fine for which he/she wishes to make a dispute. ", "6. The System displays all available information related to the fine, as well as the form to be filled in for the dispute. ", "7. The Citizen enters the necessary information. ", "8. The System verifies that the information is correct, forwards the dispute request to the appropriate person and notifies the Citizen."], "act": ["Clicks", " redirects", "clicks", " searches", " selects", " displays", "Enter", " verifies"], "obj": [" Button", " Citizen", " online fine payment button", " Fines", " fine", " Form to be filled in for the dispute", " Information", " System"]}
{"index": 25, "ucName": "ICI", "steps": ["1. The Citizen clicks on the button to access the Online Tax Payment area. ", "2. The System displays the list of taxes that can be paid online. ", "3. The Citizen selects the section dedicated to Municipal Property Tax and its payment. ", "4. The System redirects the Citizen to the necessary section, showing the form of the relevant tax and the relevant amount to be paid. ", "5. The Citizen confirms the correctness of the information and initiates the transaction, selecting the preferred payment method. ", "6. The System performs the transaction and displays a successful payment message."], "act": ["Clicks", " displays", " selects", " redirects", "Initiates", " performs"], "obj": [" Online Tax Payment area", " List of Taxes", " Municipal Property Tax and its payment section", "Form of the Relevant Tax", "Transaction", " Transaction"]}
{"index": 26, "ucName": "IPPA", "steps": ["1. The Citizen clicks on the button to access the Online Tax Payment area. ", "2. The System displays the list of fees that can be paid online. ", "3. The Citizen selects the section dedicated to 'Advertising and Public Display Tax and its payment and enters the file code. ", "4. The System redirects the Citizen to the necessary section, showing the form of the relevant tax and the relevant amount to be paid. ", "5. The Citizen confirms that the information is correct, selects the preferred payment method and initiates the transaction. ", "6. The System performs the transaction and displays a successful payment message."], "act": ["clicks", " displays", "Enters", "Redirects", "Confirms", " performs"], "obj": [" Online Tax Payment area", " Fees", " Advertising and Public Display Tax", " Form", " transaction", " Transaction"]}
{"index": 27, "ucName": "IRPEF", "steps": ["1. The Citizen clicks on the button to access the Online Tax Payment area. ", "2. The System displays the list of taxes that can be paid online. ", "3. The Citizen selects the section dedicated to Personal Income Tax and its payment. ", "4. The System redirects the Citizen to the necessary section, showing the form of the relevant tax and the relevant amount to be paid. ", "5. The Citizen confirms the correctness of the information, selects the preferred payment method and initiates the transaction. ", "6. The System performs the transaction and displays a successful payment message."], "act": ["Clicks", " displays", " selects", "Redirects", "Confirms", " performs"], "obj": [" Online Tax Payment area", " List of Taxes", "Section", "Form of the Relevant Tax", " transaction", " Transaction"]}
{"index": 28, "ucName": "Forms", "steps": ["1. The Citizen clicks on the button to access forms section. ", " The System redirects the Citizen to the required section and displays the various forms available for download", " The Citizen selects the desired form", "4. The System starts the download."], "act": ["clicks", "Redirects and Displays", " Selects", "Starts"], "obj": [" forms section", " Forms", "Form", "Download"]}
{"index": 29, "ucName": "PaymentFines", "steps": ["1. The Citizen clicks on the button to access the online fine management feature. ", "2. The System redirects the Citizen to the desired section. ", "3. The Citizen clicks on the button to pay fines online. ", "4. The System searches for fines against the Citizen in the database for which payment has not yet been received. ", "5. The Citizen selects the fine for which he/she wishes to make payment. ", "6. The System displays the fine form and the relevant amount to be paid. ", "7. The Citizen verifies that the information is correct and initiates the transaction, selecting the preferred payment method. ", "8. The System performs the transaction and displays a successful payment message."], "act": ["clicks", " redirects", "Clicks", " searches", " selects", " displays", "Verifies", "Performs"], "obj": [" online fine management feature", " Citizen", " Button", " Citizen", " Fine", " Fine Form", " Payment Method", " Transaction"]}
{"index": 30, "ucName": "PaymentUnsuccessful", "steps": ["1. The Citizen clicks on the button to access the Online Payment area of taxes or fines. ", "2. The System displays the list of taxes/fines that can be paid online. ", "3. The Citizen selects the tax/fine of interest ", " The System redirects the Citizen to the necessary section, showing the form to the Citizen", " The Citizen initiates the transaction", "6. The System does not allow the transaction because there were problems with the selected payment method."], "act": ["clicks", " displays", " selects", "Redirects", "Initiates", " does not allow"], "obj": [" Online Payment area of taxes or fines", " Taxes/Fines", " Tax/Fine", "Form Section", " Transaction", " Payment Method"]}
{"index": 31, "ucName": "SearchVerbaliMulte", "steps": ["1. The Citizen clicks on the button to access the online fine management feature. ", " The System redirects the Citizen to the desired section", " The Citizen clicks on the button to search for fines (only charged to him/her)", "4. The System searches for the citizen's charge fines (paid and unpaid) in the database and displays them in a list in which you can browse to show all available information for a given fine."], "act": ["Clicks", "Redirects", "Clicks", " searches"], "obj": [" online fine management feature", "Section", " Button", " Citizen Charge Fines"]}
{"index": 32, "ucName": "RequestIPPA", "steps": ["1. The Citizen clicks on the button to access the municipality's service request area. ", "2. The System redirects the Citizen to the necessary section. ", "3. The Citizen selects the section dedicated to the Advertising and Public Display Tax request. ", "4. The System displays the form of the relevant request,automatically obtaining the necessary data. ", "5. The Citizen enters additional data necessary for correct completion of the form,confirms the correctness of the information and sends the request. ", "6. The System notifies the employee of the request."], "act": ["clicks", " redirects", " selects", " displays", " enters", " notifies"], "obj": [" Button", " Citizen", " Advertising and Public Display Tax request section", " form", " Citizen", " Employee"]}
{"index": 33, "ucName": "RequestIPPAAccepted", "steps": ["3. The Clerk displays the notification received. ", " The System shows the Clerk the request made by the citizen", " The Clerk certifies the validity of the request by checking the accuracy of the data and enables the bureaucratic procedure for requesting the service", "4. The System sends a confirmation e-mail to the citizen who requested the service."], "act": [" displays", " shows", "Certifies", " sends"], "obj": [" Notification", " Request made by Citizen", "Request", " Confirmation e-mail"]}
{"index": 34, "ucName": "EditEMailCitizen", "steps": ["1. Citizen accesses the edit e- mail form. ", " The system shows the form the enter the new e-mail", " The citizen enters the new email and presses the confirmation button", "4. The system updates the new e-mail."], "act": ["Accesses", " shows", "Presses", " updates"], "obj": [" Edit e-mail form", "Form", " Confirmation Button", " System"]}
{"index": 35, "ucName": "RequestIPPARified", "steps": ["3. The Clerk displays the received notification. ", " The System shows the Clerk the request made by the citizen", " The Clerk reveals an error in the request and rejects the procedure the request", "4. The System sends a notification to the citizen who requested the service."], "act": [" displays", " shows", "Rejects", " sends"], "obj": [" notification", " Request", " Request", " Notification"]}
{"index": 36, "ucName": "RequestTOSAP", "steps": ["1. The Citizen clicks on the button to access the municipality's service request area. ", "2. The System redirects the Citizen to the necessary section. ", "3. The Citizen selects the section dedicated to the request for Tax for the Occupation of Public Land and Areas. ", "4. The System displays the relevant request form,automatically obtaining the necessary data. ", "5. The Citizen enters additional data necessary for the correct completion of the form,confirms the correctness of the information and sends the request. ", "6. The System notifies the employee of the request."], "act": ["clicks", " redirects", " selects", " displays", " enters", " notifies"], "obj": [" Button", " Citizen", " Tax for the Occupation of Public Land and Areas", " Request Form", " Data", " Employee"]}
{"index": 37, "ucName": "RequestTOSAPAccepted", "steps": ["3. The Clerk displays the notification received. ", " The System shows the Clerk the request made by the citizen", " The Clerk certifies the validity of the request by checking the accuracy of the data and enables the bureaucratic procedure for requesting the service", "4. The System sends a confirmation e-mail to the citizen who requested the service."], "act": [" displays", " shows", "Enables", " sends"], "obj": [" Notification", "Request", "Request", " Confirmation e-mail"]}
{"index": 38, "ucName": "RequestTOSAPRifted", "steps": ["3. The Clerk displays the received notification. ", " The System shows the Clerk the request made by the citizen", " The Clerk reveals an error in the request and rejects the procedure the request", "4. The System sends a notification to the citizen who requested the service."], "act": [" displays", " shows", "Rejects", " sends"], "obj": ["Notification", "Request", "Request/Procedure", " Notification"]}
{"index": 39, "ucName": "TIA", "steps": ["1. The Citizen clicks on the button to access the Online Tax Payment area. ", "2. The System displays the list of taxes that can be paid online. ", "3. The Citizen selects the section dedicated to the Environmental Hygiene Fee and its payment. ", "4. The System redirects the Citizen to the necessary section, showing the form of the relevant fee and the relevant amount to be paid. ", "5. The Citizen confirms the correctness of the information,selects the preferred payment method and initiates the transaction. ", "6. The System performs the transaction and displays a successful payment message."], "act": ["clicks", " displays", " selects", " redirects", "Confirms", " performs"], "obj": [" Online Tax Payment area", "List of Taxes", " Environmental Hygiene Fee payment section", " Form", " transaction", " Transaction"]}
{"index": 40, "ucName": "TOSAP", "steps": ["1. The Citizen clicks on the button to access the Online Tax Payment area. ", "2. The System displays the list of taxes that can be paid online. ", "3. The Citizen selects the section dedicated to the Tax for the Occupation of Public Land and Areas and its payment and enters the file code. ", "4. The System redirects the Citizen to the necessary section, showing the form of the relevant fee and the relevant amount to be paid. ", "5. The Citizen confirms that the information is correct, selects the preferred payment method and initiates the transaction. ", "6. The System performs the transaction and displays a successful payment message."], "act": ["clicks", " displays", "Enters", "Redirects", "Confirms", " performs"], "obj": [" Online Tax Payment area", "List of Taxes", " Tax for the Occupation of Public Land and Areas", " Form", " transaction", " Transaction"]}
{"index": 41, "ucName": "Forms", "steps": ["1. The Citizen clicks on the button to access forms section. ", " The System redirects the Citizen to the required section and displays the various forms available for download", " The Citizen selects the desired form", "4. The System starts the download."], "act": ["clicks", "Redirects", " Selects", "Starts"], "obj": [" Button", " Forms", "Form", " Download"]}
{"index": 42, "ucName": "ConsultationHelpOn-Line", "steps": ["1. The Citizen enters the dedicated online help section. ", "2. The system presents a screen containing the list of features. ", "3. The Citizen accesses the help information by clicking on the link related to the functionality he/she wants to receive. ", "4. The system presents the help information, explaining the methods and actions to be performed for the specific functionality."], "act": ["Enters", " presents", " accesses", " presents"], "obj": [" online help section", " Screen", " Link", " System"]}
{"index": 43, "ucName": "DataErrati", "steps": ["1. System displays a message to the terminal screen indicating that the request entered was incorrect. ", "2. Citizen reads the notification message. ", "3. The system resubmits the input form."], "act": [" displays", " reads", " resubmits"], "obj": [" Request", " Notification Message", " Input Form"]}
{"index": 44, "ucName": "ServiceNotAvailable", "steps": ["1. System displays a message on the terminal screen indicating that the request cannot be made. ", "2. Citizen reads the notification message. ", "3. The system resubmits the input form."], "act": [" displays", " reads", " resubmits"], "obj": [" Request", "Notification Message", " Input Form"]}
{"index": 45, "ucName": "EditEMailEmployee", "steps": ["1. The 'employee accesses the edit e- mail form. ", "2. The system shows the form the entry of the new e-mail. ", "3. The employee enters the new email and presses the confirmation button. ", "4. The system updates the new email."], "act": ["Accesses", " shows", "Presses", "Updates"], "obj": [" Edit E-Mail Form", " Form", " confirmation button", " Email"]}
{"index": 46, "ucName": "EditEmployee", "steps": ["1. The administrator presses the EditEmployee button. ", "2. The system displays a form for editing the employee. ", "3. The administrator enters the data. ", "4. The system saves the changes made."], "act": ["Presses", " displays", "Enter", " saves"], "obj": ["EditEmployee button", " Form", " Data", " Changes"]}
{"index": 47, "ucName": "ChangePasswordAdministrator", "steps": ["1. The administrator wants to change the password and presses the change password button. ", "2. The system displays the form for entering the old password. ", "3. The administrator enters the old password, the new password and presses the confirm button. ", "4. The system notifies that the password has been changed."], "act": ["Press", " displays", "Press", " notifies"], "obj": [" Change Password Button", " Old Password Form", " confirm button", " Notification"]}
{"index": 48, "ucName": "ChangePasswordCitizen", "steps": ["1. The citizen wants to change the password and presses the change password button. ", "2. The system displays the form for entering the old password and the new one. ", "3. The citizen enters the old password, the new password and presses the confirm button. ", "4. The system notifies that the password has been changed."], "act": ["Press", " displays", "Presses", " notifies"], "obj": [" Change Password Button", "Form", " Confirm Button", " Password"]}
{"index": 49, "ucName": "ChangePasswordEmployee", "steps": ["1. The employee wants to change the password and presses the change password button. ", "2. The system displays the form for entering the old password and the new one. ", "3. The employee enters the old password, the new password and presses the confirm button. ", "4. The system notifies that the password has been changed."], "act": ["Press", " displays", "Presses", " notifies"], "obj": [" Change Password Button", "Form", " Confirm Button", " Password"]}
{"index": 50, "ucName": "RecoverPasswordCitizen", "steps": ["1. Citizen has forgotten his password and presses on the Recover Password button. ", "2. The system displays the password recovery screen that requires entering the user name and ID card code. ", "3. The citizen enters his/her data and presses the confirmation button. ", "4. The system verifies the correctness of the data and sends the password to the citizen's email address."], "act": ["Presses", " displays", "Presses", " verifies and sends"], "obj": [" Recover Password button", " Password Recovery Screen", " Confirmation Button", " Password"]}
{"index": 51, "ucName": "AuthenticationCitizen", "steps": ["1. Citizen logs in to authentication session. ", "2. The system displays the login form for entering data (username and password). ", "3. The citizen enters the data and submits the authentication request. ", "4. The system verifies the accuracy of the data and grants access to the citizen."], "act": ["Logs in", " displays", "Submit", " verifies and grants"], "obj": [" Authentication Session", " login form", " authentication request", " Data"]}
{"index": 52, "ucName": "RecoverPasswordAdministrator", "steps": ["1. The administrator has forgotten the password and presses the password recovery button. ", "2. The system shows the form for entering the freshman. ", "3. The administrator enters his/her matriculation number and presses the confirmation button. ", "4. The system verifies the data and sends the password to the administrator's email address."], "act": ["Presses", " shows", "Enters", "Sends"], "obj": ["Password Recovery Button", " form", " Confirmation Button", " Password"]}
{"index": 53, "ucName": "PasswordRecoveryEmployee", "steps": ["1. The employee has forgotten his password and presses the password recovery button. ", "2. The system shows the form for entering the matriculation number. ", "3. The employee enters his/her matriculation number and presses the confirmation button. ", "4. The system verifies the data and sends the password to the employee's email address."], "act": ["Presses", " shows", "Enters", "Verifies"], "obj": [" Password Recovery Button", " Matriculation Number Form", " Matriculation Number", " Employees Email Address"]}
{"index": 54, "ucName": "RegistrationCitizen", "steps": ["1. Citizen accesses the registration form. ", "2. The system displays the registration form. ", "3. The citizen enters his/her data and presses the confirmation button. ", "4. The system checks the data for correctness, saves it and sends an e-mail of successful registration to the citizen."], "act": ["Accesses", " displays", "Enters and presses", " Checks"], "obj": [" Registration Form", "Registration Form", " confirmation button", " Registration Data"]}
{"index": 55, "ucName": "RegistrationCitizen", "steps": ["1. Citizen accesses the registration form. ", "2. The system displays the registration form. ", "3. The citizen enters his/her data and presses the confirmation button. ", "4. The system checks the data for correctness, saves it and sends an e-mail of successful registration to the citizen."], "act": [" accesses", " displays", "Presses", "Checks"], "obj": ["Registration Form", " Registration Form", " Confirmation Button", " Registration Data"]}
{"index": 56, "ucName": "Employee Search", "steps": ["1. The administrator presses on the Employee Search button. ", " The system displays the form to search for an employee", " The administrator performs a search using the employee's data", "4. The system returns the data of the searched employee."], "act": ["Presses", " displays", "Performs search", " returns"], "obj": [" Employee Search button", "Form", " Employee Data", " Employee Data"]}
{"index": 57, "ucName": "ChangeOfResidence", "steps": ["7. The Citizen presses on the Change of Residence button. ", " The system shows the citizen the form to fill out", " The citizen enters the data of his new residence", " The system notifies the citizen that the request has been successfully submitted and is stored in the system", " The clerk logs into the system and views the request received", " The clerk verifies the data, fills in the document with the rest of the data to be entered, and confirms the operation", " The system saves the form and updates the data"], "act": ["Presses", " shows", "Enters", " notifies", "Logs into the system and views", "Verifies", "Updates"], "obj": [" Change of Residence button", "Form", " Data", " Request", "Request", "Operation", " Data"]}
{"index": 58, "ucName": "ChangeOfResidenceOtherCommunity", "steps": ["9. The Citizen presses on the Change of Residence button. ", " The system shows the citizen the form to fill out", " The citizen enters the data of his new residence", " The system notifies the citizen that the request has been successfully submitted and the request is stored", " The clerk logs into the system and views the request received", " The clerk verifies the data, fills in the document with the rest of the data to be entered, and confirms the operation", " The system saves the form and updates the data", " The clerk sends a document with the request made by the citizen to the clerk of the other municipality", " The clerk of the other municipality verifies the document and sends a positive notification to the other clerk and a notification to the citizen"], "act": ["Presses", " shows", "Enters", " notifies", "Logs into the system and views", "Verifies", "Updates", "Sends", "Verifies"], "obj": [" Change of Residence button", "Form", "Data of new residence", " Request", "Request", " Operation", " Form", "Document", " Document"]}
{"index": 59, "ucName": "ChangeFamilyState", "steps": ["3. The Citizen presses on the Change Family Status button. ", " The system shows the citizen the form to fill out", " The citizen enters the data of the new household and submits the request", "4. The system sends the request to the appropriate clerk."], "act": ["Presses", " shows", "Submit", "Sends"], "obj": [" Change Family Status button", "Form", " Request", " Request"]}
{"index": 60, "ucName": "DeletePractice", "steps": ["3. The citizen presses the delete practice button (ID Card, Change of Residence) if the practice has not been initialized . ", " The system asks the citizen for confirmation", " The citizen confirms the operation", "4. The system deletes the practice."], "act": ["Deletes", " asks", " confirms", "Deletes"], "obj": [" delete practice button", "Confirmation", " Operation Confirmation", " Practice"]}
{"index": 61, "ucName": "EditPractice", "steps": ["1. The citizen presses the practice edit button (ID Card, Change of Residence) if the practice has not been initialized. ", " The system displays a form for editing the practice", " The citizen enters the data", "4. The system saves the changes made."], "act": ["Presses", " Displays", " enters", " saves"], "obj": [" Practice Edit Button", "Form", " Data", " Changes"]}
{"index": 62, "ucName": "AuthenticationEmployee", "steps": ["1. Employee logs in to authentication session. ", "2. The system displays the login form for entering data (username and password). ", "3. The employee enters data and submits the authentication request. ", "4. The system verifies the accuracy of the data and allows the employee to log in."], "act": ["Logs in", " displays", "Submit", " verifies"], "obj": [" authentication session", " Login Form", " authentication request", " System"]}
{"index": 63, "ucName": "RequestCartaDiDentity", "steps": ["1. The Citizen displays the family status and selects a family member. ", "2. The system displays a form for entering personal data(Height, special marks, etc.) ", "3. The Citizen enters the data, selects the payment method and presses the confirm button. ", "4. The system shows the screen with documentation to be shown at the counter on the days and hours the office is open. ", "5. The citizen confirms the transaction. ", "6. The system notifies the clerk of the request."], "act": [" displays and selects", " displays", "Presses", " shows", "Confirms", " notifies"], "obj": [" Family Member", " Personal Data Form", " confirm button", " Screen", " Transaction", " Clerk"]}
{"index": 64, "ucName": "RequestAcceptedIdentityCard", "steps": ["5. The clerk displays the notification received. ", " The system shows the clerk the citizen's request for the creation of the identity card", " The clerk certifies the validity of the request by checking the accuracy of the data and enables the ID card creation procedure", " The system sends a confirmation e-mail to the citizen who requested the creation of the ID card", " The citizen goes to the counter"], "act": [" displays", " shows", "Enables", "Sends", "Goes"], "obj": ["Notification", "Request", " Request", " Email", " Counter"]}
{"index": 65, "ucName": "RequestRejectedIdentityCard", "steps": ["3. The clerk displays the notification received. ", " The system shows the clerk the citizen's request to create an identity card", " The clerk detects an error in the data and rejects the ID card creation procedure", "4. The system sends an e-mail notification to the citizen who requested the ID card creation."], "act": [" displays", " shows", "Detects", " sends"], "obj": [" Notification", "Request to Create Identity Card", " ID Card Creation Procedure", "E-mail notification"]}
{"index": 66, "ucName": "RequestCertificates", "steps": ["1. The citizen selects a specific certificate(birth certificates, marital status certificates). ", "2. The system displays the form for entering the data of the person concerned. ", "3. The citizen enters the data of the person concerned. ", "4. The system displays a screen with the requested certificate. ", "5. The citizen selects the payment and shipping method. ", "6. The system sends the certificate."], "act": [" selects", " displays", "Enters", " displays", "Selects", "Sends"], "obj": [" Certificate", " Form", " Person", " Certificate", " Payment and Shipping Method", " Certificate"]}
{"index": 67, "ucName": "RequestCertificatesThirds", "steps": ["1. The citizen selects a specific certificate(birth certificates, marital status certificates). ", "2. The system displays the form for entering the data of the person concerned. ", "3. The citizen enters the data of the person concerned (see note). ", "4. The system stores the data of the citizen and interested person in a special form ", "5. The system shows a screen with the requested certificate. ", "6. The citizen selects the mode of payment and shipping. ", "7. The system sends the certificate."], "act": [" selects", " displays", "Enter", "Stores", " shows", " selects", "Sends"], "obj": ["Certificate", " Form", " Person concerned data", " Data", "Certificate", " Mode of Payment and Shipping", " Certificate"]}
{"index": 68, "ucName": "RequestToMarry", "steps": ["1. The Citizen presses on the RequestToMarry button. ", "2. The system shows the citizen the form to fill out. ", "3. The citizen enters all his/her data, the partner's data and presses the confirmation button. ", "4. The system automatically creates the form to be submitted with self-certification and family status of the applicant citizen and sends the form to the clerk. ", "5. The clerk receives the notification and publishes the marriage application."], "act": ["Presses", " shows", "Enters and Presses", " creates and sends", "Publishes"], "obj": [" RequestToMarry button", " Form", " Confirmation Button", " Form", " Marriage Application"]}
{"index": 69, "ucName": "RequestStateOfFamily", "steps": ["1. The Citizen presses on the Family Status button. ", " The system displays the Family Status to the citizen", " The citizen chooses whether to print or send the family status to his/her e-mail", "4. The system executes the choice made by the citizen."], "act": ["Presses", " displays", "Choose", " executes"], "obj": [" Family Status button", " Family Status", " Family Status", " Choice made by the citizen"]}
{"index": 70, "ucName": "IdentityCardRenewal", "steps": ["1. The Citizen presses on the Identity Card Renewal button. ", "2. The system directly sends a renewal request from the citizen to the appropriate clerk. ", "3. The citizen goes to the counter to renew the ID card."], "act": ["Presses", " sends", " goes"], "obj": [" Identity Card Renewal button", " Renewal Request", " ID Card"]}
{"index": 71, "ucName": "LoseIdentityCard", "steps": ["1. The Citizen presses on the LoseIdentityCard button. ", "2. The system directly sends a lost card notification to the appropriate clerk. ", "3. The Citizen goes to the clerk's office with a copy of the loss report."], "act": ["Presses", " sends", " goes to"], "obj": [" LoseIdentityCard button", " Notification", " Citizen"]}
{"index": 72, "ucName": "LostElectoralCard", "steps": ["1. The Citizen presses on the Lost Electoral Card button. ", "2. The system directly sends a lost card notification to the appropriate clerk. ", "3. The Citizen goes to the clerk's office with a copy of the lost card report."], "act": ["Presses", " sends", " goes to"], "obj": [" Lost Electoral Card button", "Notification", " Clerks Office"]}
{"index": 73, "ucName": "CancellationCitizen", "steps": ["3. The clerk presses the delete-citizen button. ", " The system asks the clerk for confirmation", " The clerk confirms the operation", "4. The system deletes the citizen."], "act": ["Presses", " asks", "Confirms", "Deletes"], "obj": [" delete-citizen button", "Clerk Confirmation", " Clerk", " Citizen"]}
{"index": 74, "ucName": "ElectoralCardRequest", "steps": ["1. The Citizen presses on the Electoral Card button. ", "2. The system displays the card request form. ", "3. Citizen confirms the operation ", "4. The system sends a notification to the clerk. ", "5. The citizen will receive the voter card, which will be delivered to his/her home."], "act": ["Presses", " displays", "Confirms", " sends", " will receive"], "obj": [" Electoral Card button", " Card Request Form", "Operation", " Notification", " Voter Card"]}
{"index": 75, "ucName": "ViewPractice", "steps": ["1. Citizen clicks on the button view practices(ID Card, Change of Residence). ", "2. The system displays a screen with the practices that concern the citizen."], "act": ["Clicks", " displays"], "obj": [" Button", " Screen"]}
{"index": 76, "ucName": "Practice Accepted", "steps": ["1. The Clerk accepts the file. ", " The system sets the practice as accepted", " It then sends a notification to the Citizen"], "act": ["Accepts", "Sets", "Sends"], "obj": ["File", "Practice", "Notification"]}
{"index": 77, "ucName": "PracticeRejected", "steps": ["1. The Clerk rejects the file. ", " The system sets the practice as rejected", " It then sends a notification to the Citizen"], "act": ["Rejects", " sets", "Sends"], "obj": [" Clerk", " Practice", " Notification"]}
{"index": 78, "ucName": "ViewPracticesAwaitingEmployee", "steps": ["1. Employee selects 'View Requests on Hold'. ", "2. The System shows the list of pending practices."], "act": ["Selects", " shows"], "obj": [" Requests on Hold", " List of Pending Practices"]}
{"index": 79, "ucName": "Night Reception", "steps": ["1. The user selects the Social Assistance feature by selecting 'Night Reception Request'. ", "2. The system displays the form for entering the applicant and recipient data. ", " The user enters his/her own data and if necessary enters the data of a third person specifying the relationship with that person", " He also specifies an alternative home or address and a possible date of appointment with social workers", " He then submits the form", " The system picks up the master data of the requesting citizen and the receiving citizen (if different from the requestor), and data regarding the receiving Citizen's household", " The request is sent to the Social Services office and the user is notified of the submission"], "act": ["Selects", " displays", "Enter", " specifies", "Submits", "Picks up", "Sent"], "obj": [" Night Reception Request", "Form", "Data", "Address", " Form", "Data", " Request"]}
{"index": 80, "ucName": "Sickness Allowance", "steps": ["1. User selects 'Request Sickness Allowance'. ", "2. The system displays the page with the information for requesting the INPS office for the sickness allowance, also allowing the user to print it out."], "act": ["Requests", " displays"], "obj": [" Request Sickness Allowance", " Page for Requesting INPS Office for Sickness Allowance"]}
{"index": 81, "ucName": "Housing Assistance", "steps": ["1. The user selects the Social Assistance feature by selecting 'Housing Assistance Request (Evictions)'. ", "2. The system displays the form for entering the applicant's and recipient's data (if different). ", " The user enters his/her own data and those of the recipient (if the recipient is a third person)if necessary specifying the relationship with that person, also specifies the new domicile", " The user selects the attached documentation (minutes of enforceable eviction, the new registered lease and the ISEE model)", " He/she then submits the form", " The system retrieves the master data of the recipient citizen, and data regarding the recipient Citizen's household", " The request is sent to the Social Services office and the user is notified of the submission"], "act": ["Selects", " displays", "Enter", " Selects", "Submit", " retrieves", "Sent"], "obj": [" Social Assistance feature", "Form for entering data", "Data", "Documentation", " Form", " Recipient Citizen", "Request"]}
{"index": 82, "ucName": "Home careDomestic assistance", "steps": ["1. User selects 'Request home care elderly, minors, disabled.' ", "2. The system displays the form for entering the applicant and recipient data. ", "3. The user enters the master data of the applicant and if necessary enters the data of a third person specifying the relationship with that person. ", "4. The system retrieves the data of the applicant citizen , the master data of the recipient citizen (in case the applicant and the recipient were not the same person), and the data concerning the household of the recipient Citizen. ", " The user specifies the psycho-physical conditions of the recipient specifying the attached documents (disability certificate issued by the ASL commission and/or health card of the attending physician and/or certificate of the pension provider,ISEE model) finally specifying a possible date of appointment with social workers", " Then submit the form", " The system picks up data regarding any social welfare services the recipient already uses", " It then forwards the request to the Social Services office and notifies the Citizen that the request has been made"], "act": [" Selects", " displays", "Enters", "Retrieves", "Specifies", "Submit", "Picks up", "Forwards"], "obj": [" Request home care elderly", " form", " Applicant Data", " Applicant Citizen", "\n - Psycho-physical Conditions of the Recipient\n - Attached Documents\n - ASL Commission Disability Certificate\n - Health Card of the Attending Physician \n - Certificate of the Pension Provider \n - ISEE Model \n - Date of Appointment with Social Workers", " Form", " Social Welfare Services", " Request"]}
{"index": 83, "ucName": "Economic Assistance", "steps": ["1. User selects 'Request economic assistance elderly, minor orphans, AIDS patients, prisoners, adults in need.' ", "2. The system displays the form for entering the data of the applicant and the recipient. ", "3. The user enters his/her own data and if necessary enters the data of a third person specifying the relationship with that person. ", "4. The system retrieves the data of the applicant citizen , the master data of the recipient citizen (in case the applicant and the recipient were not the same person), and the data regarding the household of the recipient Citizen. ", " The user specifies the psycho-physical conditions of the recipient specifying the attached documents (disability certificate issued by the ASL commission and/or health card of the attending physician and/or certificate of the pension provider,ISEE model) finally specifying a possible date of appointment with social workers", " Then submit the form", " The system picks up data regarding any social welfare services the recipient already uses", " It then forwards the request to the Social Services office and notifies the user that the request has been made"], "act": [" Selects", " displays", "Enter", "Retrieves", "Specifies", "Submit", "Picks up", "Forwards and Notifies"], "obj": [" Request", " Form", " Data", "Data", " User specified psycho-physical conditions of the recipient", "Form", " Social Welfare Services", " Request"]}
{"index": 84, "ucName": "DeleteEmployee", "steps": ["1. The administrator presses the delete employee button. ", "2. The system asks the administrator for confirmation. ", "3. The administrator confirms the operation. ", "4. The system deletes the 'employee."], "act": ["Press", " asks", " confirms", "Deletes"], "obj": [" delete employee button", " Administrator", " Operation", " employee"]}
{"index": 85, "ucName": "AssistanceGirlsMothersMinors", "steps": ["1. The user selects the Social Assistance feature by selecting 'Request for Assistance to GirlsMothers and Minors in Difficulty'. ", "2. The system displays the form for entering the applicant's and recipient's data. ", " The user enters his/her own data and those of the recipient of the request (himself/herself, other person) if necessary specifying the relationship with that person", " He/she also specifies a possible appointment date with Social Workers", " He/she then submits the form", " The system retrieves from the system the master data of the recipient citizen, and data regarding the household of the recipient Citizen", " The request is sent to the Social Services office and the user is notified of the submission"], "act": [" Selects", " displays", "Enter", " specifies", "Submit", " Retrieves", "Sent"], "obj": [" Social Assistance feature", " form", "Data", "Social Workers", " Form", " Recipient Citizen", " Request"]}
{"index": 86, "ucName": "ResidentialResidential care", "steps": ["1. User selects 'Request residential and semi-residential care.' ", "2. The system displays the form for entering the applicant's and recipient's data. ", "3. The user enters his/her own data and if necessary enters the data of a third person specifying the relationship with that person. ", "4. The system retrieves the master data of the applicant, the recipient citizen (if the recipient is a third person), and data regarding the household of the recipient Citizen. ", " The user specifies the recipient's psycho-physical condition, the reason for the request, the type of service requested, and the hours required", " He/she then submits the form", "6. The system forwards the request to the appropriate ASL and notifies the user that the request has been made."], "act": ["selects", " displays", "Enter", " retrieves", " specifies", "Submit", "Forwards"], "obj": [" Request residential and semi-residential care", " Form", " Data", "Data", " Request specifications including recipients psycho-physical condition", "Form", "Request"]}
{"index": 87, "ucName": "Usury Victims Funds", "steps": ["1. The user selects the feature 'Application for Solidarity Fund Allocation for Victims of Usury and Extortion.' ", "2. The system displays the information and related forms to be downloaded and sent to the Prefecture, offering in addition the possibility to print it out."], "act": ["Selects", " offers"], "obj": [" Application for Solidarity Fund Allocation for Victims of Usury and Extortion", " Forms"]}
{"index": 88, "ucName": "IndemnityAccompaniment", "steps": ["1. User selects 'Request Accompaniment Allowance'. ", " The system displays the information about the disability pension and shows the link to download the relevant form to send to INPS, providing the option to print it out", " It also shows direct links to the request for family status and marital status"], "act": ["Selects", " displays", " shows"], "obj": [" Request Accompaniment Allowance", "Form", " Links"]}
{"index": 89, "ucName": "ShowPracticeAttendedEmployee", "steps": ["1. The system displays information regarding the selected practice with its practice acceptance or practice rejection options. ", " The Clerk can Accept or Reject the practice if it is already complete with all the documentation, necessary signatures and after verifying it", " He/she can also print the practice data if necessary"], "act": [" displays information", "Accept or Reject", "Print"], "obj": ["Practice", "Practice", "Practice Data"]}
{"index": 90, "ucName": "PlanZoneAssistance", "steps": ["1. The user remotely selects the Social Assistance feature by selecting 'Zone Plan: assistance services'. ", "2. The system displays the zone plan regarding assistance services."], "act": [" selects", " displays"], "obj": [" Social Assistance feature", " zone plan"]}
{"index": 91, "ucName": "War veteran qualification", "steps": ["1. The user selects the 'Request for Recognition of Qualification as a veteran or orphan of labor' feature. ", " The system shows the information and related forms to be downloaded and sent to the Prefecture,offering the option to print it out", " It also shows a direct link to the page for requesting the Birth Certificate, Residence Certificate and Death Certificate"], "act": [" Selects", " offers", " shows"], "obj": [" Request for Recognition of Qualification as a veteran or orphan of labor", " Forms", " Certificate Request Page"]}
{"index": 92, "ucName": "DisabledParkingRelease", "steps": ["1. The user selects the Social Assistance feature by selecting 'Disabled Parking Release.' ", "2. The system displays the form for entering applicant and recipient data (if different). ", " The user enters the master data of the applicant and those of the recipient (if different) if necessary specifying the relationship to that person", " Also specified is the type of documentation attached to the traffic police command (medical-legal certificate issued by the ASL commission)", " It then submits the form", " The system picks up the master data of the recipient citizen", " The request is sent to the traffic police command and the user is notified of the submission"], "act": ["selects", " displays", "Enter", " specified", "Submit", "Picks up", "Request"], "obj": [" Social Assistance feature", " Form", "Data", " Documentation", " Form", " Master Data", " Request"]}
{"index": 93, "ucName": "DisabledMobilityService", "steps": ["1. User selects 'Disabled Mobility and Transportation Service.' ", "2. The system displays the form for entering applicant and recipient data. ", "3. The user enters his/her own data and if necessary enters the data of a third person specifying the relationship with that person. ", "4. The system picks up the data of the applicant citizen , the master data of the recipient citizen (in case the applicant and recipient were not the same person), and the data regarding the household of the recipient Citizen. ", " The user specifies the psycho-physical conditions of the recipient specifying the attached documents (disability certificate issued by the ASL commission and/or health card of the attending physician and/or certificate of the pension provider,ISEE model) finally specifying a possible date of appointment with the social workers", " Then submit the form", " The system picks up data regarding any social welfare services the recipient already uses", " It then forwards the request to the Social Services office and notifies the user that the request has been made"], "act": ["Selects", " displays", "Enter", "Picks up", "Specifies", "Submit", "Picks up", "Forward"], "obj": [" Disabled Mobility and Transportation Service", "Form", " Data", "Applicant Citizen", " psycho-physical conditions of the recipient", " Form", " Social Welfare Services", " Request"]}
{"index": 94, "ucName": "UnsubscribeNewsInformagiovani", "steps": ["1. Citizen requests unsubscription from advertisement service related to informagiovani news. ", "2. The system displays a form to confirm the request. ", "3. The citizen confirms the unsubscribe operation. ", "4. The system deletes the citizen from the advertisement service."], "act": [" requests", " displays", "Confirms unsubscribin.", "Deletes"], "obj": [" Advertisement Service", " Form", " unsubscribe operation", " Citizen"]}
{"index": 95, "ucName": "EnterCitizen", "steps": ["1. The clerk logs into the system, and activates the citizen registration procedure. ", "2. The system displays the form for entering a new citizen. ", "3. The clerk enters the citizen's data and submits the registration request. ", "4. The system receives the form, checks that the citizen entered by the clerk is not already in the system."], "act": ["Logs into", " displays", "Enter", " checks"], "obj": [" Clerk", " Form", " Registration Request", " Form"]}
{"index": 96, "ucName": "CancellationCardGiovani", "steps": ["1. Citizen requests cancellation of CardGiovani. ", "2. The system displays a form for entering the Card number. ", "3. The citizen enters the number. ", "4. The system verifies the existence of the card and the citizen's membership. ", "5. The system displays a form for confirming the request. ", "6. The citizen confirms the deletion of the card. ", "7. The system deletes the youth card from the repository."], "act": [" requests", " displays", "Enter", " verifies", " displays", "Confirms", "Deletes"], "obj": [" CardGiovani", " Card number", "Number", " Card", " Form", " Card Deletion", " Youth Card"]}
{"index": 97, "ucName": "CardCanceled", "steps": ["1. Citizen decides he wants to cancel the youth card and then enters in the form that he wants to cancel it. ", "2. The system receives the form notifies that the card has been cancelled and resubmits the form."], "act": ["Decides", " receives"], "obj": ["Youth Card", " Form"]}
{"index": 98, "ucName": "EliminationConsultationReservation", "steps": ["1. Citizen requests cancellation of interview reservation in the counseling center. ", "2. The system displays a form to confirm the request. ", "3. The citizen confirms the deletion of the reservation. ", "4. Thesystemeliminatesreservation."], "act": ["Requests", " displays", "Confirm", " eliminates"], "obj": [" Interview reservation", " Form", " Reservation", " reservation"]}
{"index": 99, "ucName": "InformationConsultingYouth", "steps": ["1. The Citizen requests to view the list of consulting rooms. ", " The system allows to view the list of counseling centers", " Citizen chooses the counseling center", " The system returns information regarding the chosen consultatory displaying such data as: - its location; - its opening dates and times", " - the list of booked interviews (if any)(invoking the use case VisualizationReservationConsu ltory)"], "act": [" requests", " allows", "Chooses", " returns", " VisualizationReservationConsultory"], "obj": [" list of consulting rooms", "List of Counseling Centers", "Counseling Center", " Consultatory Information", " VisualizationReservationConsultory"]}
{"index": 100, "ucName": "Information", "steps": ["1. The Citizen requests to view the list of informagiovani news. ", " The system allows to view the list of information regarding: - special employment official gazette; - local competition notices information; - study trips", " The citizen selects the desired information", "4. The system returns the information regarding the news specifying: - date of publication of the notice; - expiration date of the notice; - description"], "act": [" requests", " view", " selects", " returns"], "obj": [" list of informagiovani news", " List of Information", " Information", " News Information"]}
{"index": 101, "ucName": "EnrollmentCardYouth", "steps": ["1. Citizen applies for youth card. ", "2. The system displays a form for submitting the request. ", "3. The citizen enters the card application data into a form. ", "4. The system receives the form, verifies the data, and submits the request. ", "5. The system notifies that the card has been entered and displays the card number and a summary of the data entered in a form."], "act": ["Applies", " displays", "Enter", "Receives", " notifies"], "obj": [" Youth Card", " Form", " Form", " Request", " Card"]}
{"index": 102, "ucName": "SubscribeNewsInformagiovani", "steps": ["1. Citizen requests subscription to informagiovani news to receive service-related advertisements. ", "2. The system displays a form for submitting the request. ", "3. The citizen enters the news request data into a form. ", "4. The system receives the form, verifies the data and submits the request."], "act": [" requests", " displays", "Enter", "Receives"], "obj": [" informagiovani news", "Form", " Form", " Form"]}
{"index": 103, "ucName": "ChangePreservationInterview", "steps": ["1. Citizen requests a change of interview reservation in the counseling center. ", "2. The system displays a form for editing the reservation fields. ", "3. The citizen makes the changes in the form confirms the reservation. ", "4. Ilsistemodificalapreservation."], "act": ["Requests", " displays", "Confirms", " ilsistemodificalapreservation"], "obj": [" Interview reservation", " Reservation Fields Form", " Form", " Ilsistemodificalapreservation"]}
{"index": 104, "ucName": "NewsCanceled", "steps": ["1. Citizen decides she wants to cancel informagiovani news and then enters in the form that she wants to cancel it. ", "2. The system receives the form notifies that the news has been cancelled and resubmits the form."], "act": ["Decides and enters", " receives"], "obj": [" Form", " Form"]}
{"index": 105, "ucName": "ReservationInterview", "steps": ["1. The citizen requests an interview in the preselected counseling center. ", "2. The system displays a form for submitting the request. ", "3. The citizen enters the interview request data into a form. ", "4. The system receives the form, verifies the reservation data, and submits the request. ", "5. Citizen requests prints out receipt of interview booking. ", "6. Thesystemprintsthebooking."], "act": ["Requests an interview", " displays", "Enter", "Receives", "Requests", "prints"], "obj": [" interview", " Form", "Form", " Reservation Request", " Receipt of Interview Booking", " Booking"]}
{"index": 106, "ucName": "EntryEmployee", "steps": ["1. The administrator logs into the system, via administrative terminal, and activates the Employee Registration procedure. ", "2. The system displays the form for entering a new employee. ", "3. The Administrator enters the Employee's data and submits the registration request. ", "4. The system receives the form, verifies that the matriculation entered by the Administrator is not already in the system and generates a password, saves the entered data and displays a notification of successful registration with the password assigned to the employee."], "act": ["Logs in and activates", " displays", "Enters and submits", " Generates"], "obj": [" Employee Registration procedure", " Form", " Registration request", " Form"]}
{"index": 107, "ucName": "ReservationInterviewCanceled", "steps": ["1. Citizen decides he wants to cancel the interview reservation and then enters in the form that he wants to cancel it. ", "2. The system receives the form notifies that the interview booking has been cancelled and resubmits the form."], "act": ["Cancels", " receives"], "obj": [" Form", "Form"]}
{"index": 108, "ucName": "ViewReservationConsulting", "steps": ["1. Citizen requests viewing of reservation made in a consulting room. ", "2. The system returns information regarding the chosen reservation displaying such data as: - Date and time; - Consultatory."], "act": [" requests", " returns"], "obj": [" reservation", "Reservation Information"]}
{"index": 109, "ucName": "DeleteInformation", "steps": ["1. Employee requests news deletion. ", "2. The system displays the list of existing news items ", "3. The employee chooses a news item. ", "4. The system displays a form the confirmation of the operation. ", "5. The employee confirms the operation through the form. ", "6. The system receives the form, and clears the news data from the system."], "act": ["Requests", " displays", "Choose", " displays", " confirms", " clears"], "obj": [" Employee", " list of existing news items", " News item", " Form", " Form", " Form"]}
{"index": 110, "ucName": "InformationLibaries", "steps": ["1. The Citizen requests to view the list of libraries. ", " The system allows viewing the list of libraries", " Citizen chooses the library", "4. The system returns information regarding the chosen library displaying such data as: - - - - location; opening dates and times; link to the library's website."], "act": [" requests", " allows", " chooses", " returns"], "obj": [" list of libraries", "List of Libraries", " Citizen", " Library Information"]}
{"index": 111, "ucName": "InformationEventsInTheTerritory", "steps": ["1. The Citizen requests to view the list of events. ", " The system allows viewing the list of events", " The Citizen chooses the event", "4. The system returns information regarding the chosen event displaying such data as: - - - - the location; the date and time of the event; site managing the event (Pro-loco)."], "act": [" requests", " allows", " chooses", " returns"], "obj": [" list of events", " List of Events", " Event", " Event Information"]}
{"index": 112, "ucName": "InformationMuseums", "steps": ["1. The Citizen requests to view the list of museums. ", " The system allows the list of museums to be displayed", " Citizen chooses the museum", "4. The system returns information regarding the chosen museum displaying such data as: - - - - location; opening dates and times; link to the museum's website."], "act": [" requests", " allows", "Choose", " returns"], "obj": [" museums list", "Museums List", " Museum", " museum information"]}
{"index": 113, "ucName": "InformationPromotionTerritory", "steps": ["1. The Citizen requests to view the list of territorial promotions. ", " The system allows the list of promotions to be displayed", " Citizen chooses the promotion", "4. The system returns information regarding the chosen promotion."], "act": [" requests", "Allows displaying", "Chooses", " returns"], "obj": [" list of territorial promotions", "Promotions List", " Citizen\n\nIn this sentence", " Chosen Promotion Information"]}
{"index": 114, "ucName": "EntryInformation", "steps": ["1. The employee requests a new news entry. ", "2. The system displays a form for submitting the request. ", "3. The employee enters data about the new news item in a form. ", "4. The system receives the form, and enters the news into the system."], "act": ["Requests", " displays", "Enter", " receives"], "obj": [" news entry", " Form", " Form", " Form"]}
{"index": 115, "ucName": "EditInformation", "steps": ["1. Employee requests a news change. ", "2. The system displays the list of existing news items ", "3. The employee chooses a news item. ", "4. The system displays a form for editing the news. ", "5. The employee enters data about the news into a form. ", "6. The system receives the form, and updates the news data in the system."], "act": ["Requests", " displays", "Chooses", " displays", "Enter", " receives"], "obj": [" News Change", "List of News Items", "News item", " Form", "Form", " Form"]}
{"index": 116, "ucName": "ViewInformation", "steps": ["1. The Citizen requests to view the information in the territory. ", "2. The system returns information regarding the territory by displaying such data as: - libraries; - events; - museums; - promotions present in the territory."], "act": [" requests", " returns information"], "obj": [" Citizen", " Information Regarding Territory"]}
{"index": 117, "ucName": "LogoutAdministrator", "steps": ["1. The administrator wants to end the work session and clicks on the Logout button. ", "2. The system disconnects the administrator from the system and returns to the main screen."], "act": ["Logout", " disconnects"], "obj": [" Logout button", " System"]}
{"index": 118, "ucName": "Communications", "steps": ["1. The citizen accesses the communications area using the appropriate link ", " The system displays the form for entering the data required for the communication (e", "g", " communication of the start of works,D", "I", "A", ", communication of the end of works", ") ", "3. The citizen enters the required data ", "4. The system verifies correctness and completeness of the data then displays a summary screen or activates the use case DatiErrati. ", "5. The citizen confirms the operation ", "6. The system displays the form for printing ", "7. The system sends a message notifying the appropriate employee of the request ", "8. The citizen makes the printout to be delivered to the municipal office with a revenue stamp."], "act": ["Accesses", " displays", "Sorry", " communication", " Enter", "", " communication", " enter", "Enter", " Verifies", "Confirms", "Display", "Sends", " makes"], "obj": [" communications area", " Form for entering communication data", "Sorry", " Start of Works Communication", "Im sorry", "", " End of Works Communication", " Personal Representative", " Data", " Data", "Operation", "Form", "Request", "Printout"]}
{"index": 119, "ucName": "DefinitionBuilding Offenses", "steps": ["1. The citizen accesses the request area definition building offenses using the appropriate link ", "2. The system displays the form for entering the data required for the request ", "3. The citizen enters the required data ", "4. The system verifies the correctness and completeness of the data then displays a summary screen or activates the use case DatiErrati ", "5. The citizen confirms the operation ", "6. The system displays a message notifying the request ", "7. The system sends a request notification message to the appropriate employee."], "act": ["Accesses", "Displays", "Enter", " Verifies", "Confirms", "Notify", "Sends"], "obj": [" Request Area Definition Building Offenses", "Data Entry Form", " Data", " Data", " Operation", " Request", "Notification Message"]}
{"index": 120, "ucName": "Declaration in lieu of Notarization", "steps": ["1. The citizen accesses the area Dichiarazione sostitutiva dell'atto di notoriet using the appropriate link ", "2. The system displays the form for entering the data required for the request ", "3. The citizen enters the required data ", "4. The system verifies the correctness and completeness of the data then displays a summary screen or activates the DatiErrati use case ", "5. The citizen confirms the operation ", "6. The system displays a notification message ", "7. The system sends a message notifying the appropriate employee of the request."], "act": ["", "displays", "Enters", " Verifies", "Confirms", " displays", "Sends"], "obj": ["", "Data Entry Form", " Data", " Data", "Operation", "Notification Message", " Message"]}
{"index": 121, "ucName": "VisionPlanRegulator", "steps": ["1. citizen accesses the Regulatory Plan area via the appropriate link ", "2. the system displays the document"], "act": ["Accesses", " displays"], "obj": ["Regulatory Plan area", " Document"]}
{"index": 122, "ucName": "SubmitBuildingProject", "steps": ["1. The citizen accesses the submit building project area via the appropriate link ", "2. The system displays the form for entering the required data ", "3. The citizen enters the required data ", "4. The system verifies correctness and completeness of the data then displays a summary screen or activates the use case DatiErrati ", "5. The citizen confirms the operation ", "6. The system displays the form for printing ", "7. The system sends a message notifying the appropriate employee of the request ", "8. The citizen makes the printout to be delivered to the municipal office with the required documents and a revenue stamp attached."], "act": ["Accesses", " Displays", "Enter", " Verifies", "Confirms", "Displays", "Sends", " makes"], "obj": [" Building Project Area", "Data Entry Form", "Data", " DatiErrati", "Operation", "Form", "Request", " Printout"]}
{"index": 123, "ucName": "SearchBuildingFile", "steps": ["5. The citizen accesses the search area ", "2. The system displays the form for entering the search key The citizen enters the search key ", "4. Thesystemshowstheresultsof the search The citizen selects the file ", "6. Thesystemdisplaysthefile."], "act": ["Accesses", "Enter", " shows", " displays"], "obj": [" Search Area", " Search Key", " file", " File"]}
{"index": 124, "ucName": "RequestAuthorization", "steps": ["1. The citizen accesses the certificate and authorization issuance area using the appropriate link ", " The system displays the form for entering the data necessary to request the authorization (e", "g", " authorization connection to the water network, authorization connection to the sewer network ", ") ", "3. The citizen enters the required data ", "4. The system verifies correctness and completeness of the data then displays a summary screen or activates the use case DatiErrati ", "5. The citizen confirms the operation ", "6. The system displays the form for printing ", "7. The system sends a message notifying the appropriate employee of the request ", "8. The citizen makes the printout to be delivered to the municipal office with the stamp and attachments."], "act": ["Accesses", " displays", "", "Authorization connection", " enter", "Enter", " Verifies", "Confirms", "Display", "Sends", " makes"], "obj": ["Certificate and Authorization Issuance Area", " Form for Request Authorization", "Sorry", " Authorization Connection", "In this sentence", "Data", " DatiErrati", " Operation", "Form", "Request", "Printout"]}
{"index": 125, "ucName": "RequestCopyFileEdilizio", "steps": ["1. The citizen requests a copy of the file using the appropriate button ", "2. The system sends the request to the clerk ", "3. The system notifies the citizen that the request has been submitted and the copy will be sent to him/her shortly."], "act": ["Requests", "Sends", " notifies"], "obj": [" File Copy Request", "Request", " Request"]}
{"index": 126, "ucName": "Request for Condonation Definition", "steps": ["1. Citizen accesses the request area definition condono using the appropriate link ", "2. The system displays the form for entering the data required for the ", "5. request The citizen enters the required data ", "4. The system verifies the correctness and completeness of the data then displays a summary screen or activates the use case DatiErrati The citizen confirms the operation ", "6. The system displays a message notifying the request ", "7. The system sends a request notification message to the appropriate employee."], "act": ["Accesses", "Displays", "Enter", " Verifies", " displays", "Sends"], "obj": [" Request Area Definition", " Data Entry Form", "Data", " Operation", " Request", " Request notification message"]}
{"index": 127, "ucName": "RequestNumberCivic", "steps": ["1. The citizen accesses the request area house number using the appropriate link ", "2. The system displays the form for entering the data required for the request The citizen enters the required data ", "4. The system verifies the correctness and completeness of the data then displays a summary screen or activates the use case DatiErrati The citizen confirms the operation ", "6. The system displays a message notifying the request ", "7. The system sends a request notification message to the appropriate employee."], "act": ["Accesses", "Enter", " Verifies", " displays", "Sends"], "obj": [" Request Area House Number", "Data Entry Form", " Operation", " Request", " Request notification message"]}
{"index": 128, "ucName": "LogoutCitizen", "steps": ["1. The citizen wants to end the work session and clicks on the Logout button. ", "2. The system disconnects the citizen from the system and returns to the main screen."], "act": ["Logout", " disconnects"], "obj": [" Logout button", " System"]}
{"index": 129, "ucName": "RequestCadastralService", "steps": ["1. The citizen accesses the municipal cadastral service area using the appropriate link ", "2. The system displays the form for entering the data required for the request ", "3. The citizen enters the required data ", "4. The system verifies correctness and completeness of the data then displays a summary screen or activates the use case DatiErrati ", "5. The citizen confirms the transaction ", "6. The system displays the payment method ", "7. The citizen makes the choice ", "8. The system sends a message notifying the appropriate employee of the request ", "9. The system notifies the citizen that the request has been submitted and the copy will be sent to him/her shortly."], "act": ["Accesses", "displays", "Enter", " Verifies", "Confirms", " displays", " Makes", "Sends", " notifies"], "obj": [" municipal cadastral service area", "Data Entry Form", " Data", " Data", " Transaction", "Payment Method", " choice", "Request", "Notification"]}
{"index": 130, "ucName": "IssuingCertificates", "steps": ["1. The citizen accesses the certificate and permit issuance area using the appropriate link ", " The system displays the form for entering the data required for the issuance of the certificate (e", "g", " certificate of fitness, certificate of habitability, ", ") ", "3. The citizen enters the required data ", "4. The system verifies correctness and completeness of the data then displays a summary screen or activates the use case DatiErrati ", "5. The citizen confirms the operation ", "6. The system displays the form for printing ", "7. The system sends a message notifying the appropriate employee of the request ", "8. The citizen makes the printout to be delivered to the municipal office with the revenue stamp."], "act": ["Accesses", " displays", "", " certificate of fitness", " Enter", "Enters", " Verifies", "Confirms", "Displays", "Sends", " makes"], "obj": ["Certificate and Permit Issuance Area", "Form for Entering Data", "", "Certificate", "Based on the provided input", " Data", "Data", " Operation Confirmation", " Form for Printing", "Request", " Revenue Stamp"]}
{"index": 131, "ucName": "VisionCirculars", "steps": ["3. The citizen accesses the circulars area through the appropriate link ", "2. The system displays the numbered list of circulars The citizen chooses the circular via link ", "4. Thesystemdisplaysthechosencircular"], "act": ["Accesses", " Displays", " displays"], "obj": ["Link", " Circular List", " System"]}
{"index": 132, "ucName": "UpdateEnvironmentalAnalysis", "steps": ["1. The municipal clerk after authenticating in the system updates the form that simply provides for the copy of the report of the analysis carried out on the environment by the Civil Defense ", "2. The system responds by providing the clerk with a form in which to report the information prepared by the chemical experts. ", "3. The employee completes the form field presented by the system and submits it. ", "4. The system updates the form and allows it to be viewed by the Citizen."], "act": ["Updates", " provides", "Completes", "Updates"], "obj": ["Form", " Form", "Form Field", " Form"]}
{"index": 133, "ucName": "UpdateBandsECompetitions", "steps": ["3. The municipal clerk after authenticating in the system updates the list of associations that have published a new notice of competition. ", " The system responds by providing the clerk with a form to complete to update the fields: association_logo, description, association_name, notice", " The clerk completes the fields of the form presented by the system and submits it", "4. The system updates the form and allows it to be viewed by the Citizen."], "act": ["Updates", " provides", "Completes and submits", "Updates"], "obj": [" List of Associations", "Form to Complete", "Form", " Form"]}
{"index": 134, "ucName": "UpdateWeatherConditions", "steps": ["3. The municipal employee after authenticating in the system updates the weather conditions of the municipality and regional provinces. ", "2. The system responds by providing the clerk with a form to complete in order to update the fields: tempMin, tempMax, stateAtmospheric, nameCity, date. The employee completes the fields of the form presented by the system and submits it ", "4. The system updates the form and allows it to be viewed by the Citizen."], "act": ["Updates", "Completes and Submits", "Updates"], "obj": [" Weather Conditions", "Form", "Form"]}
{"index": 135, "ucName": "ActivitiesUseful", "steps": ["1. By selecting this use case, the Citizen accesses a screen for choosing two use cases: Woods, Waste ", "2. The system provides a simple and intuitive screen that allows the user to choose which of the two services to visit, to indirectly help maintain acceptable, municipal environmental conditions. ", "3. The Citizen chooses one of the two use cases Woods, or Waste. ", "4. The system responds to the Citizen's need by displaying the desired page they had requested."], "act": ["Accesses", " provides", " chooses", " displays"], "obj": ["Use Cases", "Screen", " use case", " Page"]}
{"index": 136, "ucName": "Announcements And Contests", "steps": ["1. The Citizen accesses the home screen to be able to view the opportunity to view the associations that support Civil Defense. ", "2. The system responds to the need by allowing the Citizen to view all the associations that are part of the Civil Defense and that hire staff, with a small image of the association, with next to it the possibility of receiving the download of the notice made available by the association in question. ", "3. The Citizen takes note of what the form provides, and chooses from which, among the associations made available, to receive news for a possible recruitment or participation in the competition, about the modalities of the same. ", "4. The system responds to this by allowing him or her to view the corresponding competition notice."], "act": ["accesses", " respond to the need", " takes note of", " allows"], "obj": [" Home Screen", " Civil Defense Associations", " Form", " Competition Notice"]}
{"index": 137, "ucName": "Woods", "steps": ["1. The Citizen accesses this screen to be able to learn about the advice that Civil Defense makes available to anyone in order to avoid and have people avoid forest fires. ", "2. The system provides a screen with a set of rules that the Citizen should follow and have others follow if they are with third parties, to prevent the occurrence of arson, and in case of this, which authority to call."], "act": [" accesses", " provides"], "obj": [" Screen", "Rules"]}
{"index": 138, "ucName": "Weather", "steps": ["1. The Citizen accesses this screen to view the weather situation in the municipality where he or she resides. ", "2. The system responds to the Citizen's need by allowing him to view, in addition to the weather situation, of his municipality,also that of the provinces of the region to which he belongs, with update date, minimum and maximum temperatures, and of course, weather conditions expressed with a small descriptive image."], "act": [" accesses", " responds\n\nAction"], "obj": [" Citizen", " Citizen"]}
